[
  {
    "id": 1,
    "titleEn": "Talbiyah",
    "titleMy": "Talbiyah",
    "doa": [{
      "id": 1,
      "arabic": "لَبَّيْكَ اَللَّهُمَّ لَبَّيْكَ –\nلَبَّيْكَ لَا شَرِيكَ لَكَ لَبَّيْكَ –\nإِنَّ الْحَمْدَ وَالنِّعْمَةَ لَكَ وَالْمُلْكَ – \nلَا شَرِيكَ لَكَ – ❁",
      "translationEn": "I answer, O my Lord, I answer Your call. There is no ally for You, I answer the call. All praise and goodness to You, and government also to You, There is no ally for You",
      "translationMy": "Aku menyahut wahai Tuhanku aku menyahut panggilanMu (panggilan Nabi Ibrahim). Tiada sekutu bagiMu, aku menyahut akan panggilan itu. Segala pujian dan kebaikan bagiMu, dan pemerintahan juga bagiMu, Tiada sekutu bagiMu"
    }, {
      "id": 2,
      "arabic": "اَللّٰهُمَّ صَلِّ عَلَى سَيِّدِنَا مُحَمَّد –\nوَعَلَى آلِ سَيِّدِنَا مُحَمَّدٍ –\nكَمَا صَلَّيْتَ عَلَى سَيِّدِنَا إِبْرَاهِيمَ – وَعَلَى آلِ سَيِّدِنَا إِبْرَاهِيمَ –\nكَمَا بَارَكْتَ عَلَى سَيِّدِنَا إِبْرَاهِيمَ – وَعَلَى آلِ سَيِّدِنَا إِبْرَاهِيمَ –\nفِي الْعَالَمِينَ – إِنَّكَ حَمِيدٌ مَجِيدٌ ❁ اَللّٰهُمَّ إِنِّي أَسْئَلُكَ\nرِضَاكَ وَالْجَنَّةَ وَأَعُوْذُبِكَ \nمِنْ سَخَطِكَ وَالنَّارِ – ❁",
      "translationEn": "I answer, O my Lord, I answer Your call. There is no ally for You, I answer the call. All praise and goodness to You, and government also to You, There is no ally for You.\u2028O Allah, grant additional mercy to our lord Prophet Muhammad and to the family of our lord Prophet Muhammad. As You have bestowed blessings on our lord Prophet Abraham and on the family of our lord Prophet Ibrahim. Bless our lord Prophet Muhammad and the family of our lord Prophet Muhammad. As You have bestowed blessings on our lord Prophet Ibrahim and on the family of our lord Prophet Abraham. In all the realms, indeed You are the Most Praiseworthy and Glorious. O Allah, I ask for Your mercy, and Paradise and I pray with You to be kept away from Your wrath and the fire of Hell",
      "translationMy": "Aku menyahut wahai Tuhanku aku menyahut panggilanMu (panggilan Nabi Ibrahim). Tiada sekutu bagiMu, aku menyahut akan panggilan itu. Segala pujian dan kebaikan bagiMu, dan pemerintahan juga bagiMu, Tiada sekutu bagiMu. Ya Allah, kurniakanlah tambahan rahmat kepada junjungan kami Nabi Muhammad dan kepada keluarga junjungan kami Nabi Muhammad. Sebagaimana Engkau telah mengurniakan rahmat ke atas junjungan kami Nabi Ibrahim dan kepada keluarga junjungan kami Nabi Ibrahim. Kurniakanlah keberkatan kepada junjungan kami Nabi Muhammad dan kepada keluarga junjungan kami Nabi Muhammad. Sebagaimana Engkau telah mengurniakan keberkatan kepada junjungan kami Nabi Ibrahim dan kepada keluarga junjungan kami Nabi Ibrahim. Di dalam seluruh alam, sesungguhnya Engkau adalah Maha Terpuji lagi Mulia. Ya Allah, aku memohon keredaanMu, dan syurga dan aku memohon dengan Engkau dijauhkan dari kemarahanMu dan api neraka"
    }],
    "category": ["talbiyah"],
    "audio": "talbiyah.mp3"
  },
  {
    "id": 2,
    "titleEn": "Intention For Ihram Prayer",
    "titleMy": "Niat Solat Sunat Ihram",
    "doa": [{
      "id": 1,
      "arabic": "اُصَلِّي سُنَّةَ الْاِحْرَامِ رَكْعَتَيْنِ لِلّٰهِ تَعَالٰىَ",
      "translationEn": "I intend to pray two raka’at of sunnah Ihram for the sake of Allah Most High",
      "translationMy": "Sahaja aku solat sunat Ihram dua rakaat kerana Allah Taala"
    }],
    "category": ["intention"],
    "audio": ""
  },
  {
    "id": 3,
    "titleEn": "Intention For Umrah Ihram",
    "titleMy": "Niat Ihram Umrah",
    "doa": [{
      "id": 1,
      "arabic": "نَوَيْتُ العُمْرَةَ وَأَحْرَمْتُ بِهَا لِلّٰهِ تَعَالَى",
      "translationEn": "I intend to perform Umrah and perform ihram for it for the sake of Allah",
      "translationMy": "Sahaja aku menunaikan Umrah dan aku berihram dengannya kerana Allah"
    }],
    "category": ["intention", "umrah"],
    "audio": ""
  },
  {
    "id": 4,
    "titleEn": "Intention For Ihram Umrah On Behalf",
    "titleMy": "Niat Umrah Badal",
    "doa": [{
      "id": 1,
      "arabic": "نَوَيْتُ العُمْرَةَ عَن ______ وَأَحْرَمْتُ بِهَا لِلّٰهِ تَعَالَى",
      "translationEn": "I intend to perform Umrah on behalf of ______ and perform ihram for it for the sake of Allah Most High",
      "translationMy": "Sahaja aku menunaikan Umrah bagi ______ dan aku berihram dengannya kerana Allah Ta’ala"
    }],
    "category": ["intention", "umrah"],
    "audio": ""
  },
  {
    "id": 5,
    "titleEn": "Intention For Ihram Umrah With Terms",
    "titleMy": "Niat Umrah Bersyarat",
    "doa": [{
      "id": 1,
      "arabic": "نَوَيْتُ العُمْرَةَ وَأَحْرَمْتُ بِهَا لِلّٰهِ تَعَالَى فَإِنْ حَبَسَنِيْ حَابِسٌ فَمَحِلِّيْ حَيْثُ حَبَسَنِيْ",
      "translationEn": "I have intended to perform Umrah and performed ihram for it for the sake of Allah Most High, If I am hindered by any hitch, then I will perform tahallul in that place.",
      "translationMy": "Sahaja aku menunaikan Umrah dan aku berihram dengannya kerana Allah Ta’ala, jika aku terhalang oleh sesuatu, maka aku akan bertahallul di tempat tersebut."
    }],
    "category": ["intention", "umrah"],
    "audio": ""
  },
  {
    "id": 6,
    "titleEn": "Intention For Haj Ihram",
    "titleMy": "Niat Ihram Haji",
    "doa": [{
      "id": 1,
      "arabic": "نَوَيْتُ الحَجَّ وَأَحْرَمْتُ بِهِ لِلّٰهِ تَعَالَى",
      "translationEn": "I have intended to perform Haj and performed ihram for it for the sake of Allah Most High",
      "translationMy": "Sahaja aku menunaikan Haji dan aku berihram dengannya kerana Allah Ta’ala"
    }],
    "category": ["intention", "haji"],
    "audio": ""
  },
  {
    "id": 7,
    "titleEn": "Intention For Haj Ihram On Behalf",
    "titleMy": "Niat Haji Badal",
    "doa": [{
      "id": 1,
      "arabic": "نَوَيْتُ الحَجَّ عَن ______ وَأَحْرَمْتُ بِهِ لِلّٰهِ تَعَالَى",
      "translationEn": "I have intended to perform Haj on behalf of ______ and performed ihram for it for the sake of Allah Most High",
      "translationMy": "Sahaja aku menunaikan Haji bagi ______ dan aku berihram dengannya kerana Allah Ta’ala"
    }],
    "category": ["intention", "haji"],
    "audio": ""
  },
  {
    "id": 8,
    "titleEn": "Intention For Haj Ihram With Terms",
    "titleMy": "Niat Haji Bersyarat",
    "doa": [{
      "id": 1,
      "arabic": "نَوَيْتُ الحَجَّ وَأَحْرَمْتُ بِهِ لِلّٰهِ تَعَالَى فَإِنْ حَبَسَنِيْ حَابِسٌ فَمَحِلِّيْ حَيْثُ حَبَسَنِيْ",
      "translationEn": "I have intended to perform Haj and performed ihram for it for the sake of Allah Most High, If I am hindered by any hitch, then I will perform tahallul in that place.",
      "translationMy": "Sahaja aku menunaikan Haji dan aku berihram dengannya kerana Allah Ta’ala, jika aku terhalang oleh sesuatu, maka aku akan bertahallul di tempat tersebut."
    }],
    "category": ["intention", "haji"],
    "audio": ""
  },
  {
    "id": 9,
    "titleEn": "Dua When Entering Masjidil Haram",
    "titleMy": "Doa Memasuki Masjidil Haram",
    "doa": [{
      "id": 1,
      "arabic": "اَللّٰهُمَّ اغْفِرْلِيْ ذُنُوبِي وَافْتَحْ لِي أَبْوَابَ رَحْمَتِكَ، وَأَدْخِلْنِي فِيْهَا، وَسَهِّلْ لِي أَبْوَابَ رِزْقِكَ اَللّٰهُمَّ هَذَا حَرَمُكَ، وَمَوْضِعُ أَمْنِكَ فَحَرِّمْ لَحْمِي وَبَشَرِي وَعِظَامِي عَلَى النَّارِ\nاَللّٰهُمَّ أَنْتَ السَّلَامُ وَمِنْكَ السَّلَامُ، وَإِلَيْكَ يَعُوْدُ السَّلَامُ فَحَيِّنَا رَبَّنَا بِالسَّلَامِ\nوَأَدْخِلْنَا الْجَنَّةَ دَارَ السَّلَامِ تَبَارَكْتَ رَبَّنَا وَتَعَالَيْتَ يَا ذَا الْجَلَالِ وَالْإِكْرَامِ\nاَللّٰهُمَّ إِنِّي أَسْأَلُكَ أَنْ تَغْفِرَ لِي، وَتَرْحَمَنِي، وَتُقِيلَ عَثَرَتِيْ، وَتَضَعَ وِزْرِي\nبِرَحْمَتِكَ يَا أَرْحَمَ الرَّاحِمِينَ\nاَللّٰهُمَّ اغْفِرْلِيْ ذُنُوبِي وَافْتَحْ لِي أَبْوَابَ رَحْمَتِكَ، وَأَدْخِلْنِي فِيْهَا، وَسَهِّلْ لِي أَبْوَابَ رِزْقِكَ اَللّٰهُمَّ هَذَا حَرَمُكَ، وَمَوْضِعُ أَمْنِكَ فَحَرِّمْ لَحْمِي وَبَشَرِي وَعِظَامِي عَلَى النَّارِ\nاَللّٰهُمَّ أَنْتَ السَّلَامُ وَمِنْكَ السَّلَامُ، وَإِلَيْكَ يَعُوْدُ السَّلَامُ فَحَيِّنَا رَبَّنَا بِالسَّلَامِ\nوَأَدْخِلْنَا الْجَنَّةَ دَارَ السَّلَامِ تَبَارَكْتَ رَبَّنَا وَتَعَالَيْتَ يَا ذَا الْجَلَالِ وَالْإِكْرَامِ\nاَللّٰهُمَّ إِنِّي أَسْأَلُكَ أَنْ تَغْفِرَ لِي، وَتَرْحَمَنِي، وَتُقِيلَ عَثَرَتِيْ، وَتَضَعَ وِزْرِي\nبِرَحْمَتِكَ يَا أَرْحَمَ الرَّاحِمِينَ",
      "translationEn": "O Allah, forgive my sins and open for me the doors of Your mercy, and enter me into Your mercy, and make the door of Your sustenance easy for me. O Allah, verily this place is Your sanctuary, and the place of security that You provide. So forbid my flesh, my skin and my bones from the fire of Hell. O Allah, You are salvation, from You are salvation and enter us in Paradise a place of safety, Your blessings are plentiful, O Lord of Greatness and Glory. O Allah, I beseech Thee to forgive my sins and forgive my faults and lay the burden that burdens me with Thy mercy. O Merciful God.",
      "translationMy": "Ya Allah, ampunilah dosaku dan bukakanlah bagiku pintu-pintu rahmatMu, dan masukkanlah aku dalam rahmatMu, dan permudahkanlah bagiku pintu rezekiMu. Ya Allah, sesungguhnya tempat ini adalah tempat suciMu, dan tempat keamanan yang Engkau sediakan. Maka haramkanlah dagingku, kulitku dan tulangku dari api neraka. Ya Allah, Engkaulah keselamatan, daripadaMulah keselamatan dan masukkanlah kami di dalam syurga tempat keselamatan, Maha banyak keberkatanMu, Ya Tuhan yang mempunyai Kebesaran dan Kemuliaan. Ya Allah, aku bermohon kepadaMu agar Engkau mengampuni dosaku dan menghapuskan kesalahanku dan meletakkan beban yang memberatiku dengan rahmatMu. Ya Tuhan yang Maha Penyayang."
    }],
    "category": ["masjidil haram"],
    "audio": ""
  },
  {
    "id": 10,
    "titleEn": "Intention For I'tikaf At Mosque",
    "titleMy": "Niat I’tikaf Masjid",
    "doa": [{
      "id": 1,
      "arabic": "نَذَرتُ الإِعتِكَافَ فِي هَذَا الْمَسْجِدِ مَا دُمْتُ فِيهِ لِلَّهِ تَعَالَى",
      "translationEn": "I intend to iktikaf in this blessed mosque because of AIIah Taala.",
      "translationMy": "Sahaja aku beri'tikaf di masjid ini kerana AIIah Taala."
    }],
    "category": ["intention", "masjidil haram", "madinah"],
    "audio": ""
  },
  {
    "id": 11,
    "titleEn": "Dua When Looking At The Ka’abah",
    "titleMy": "Doa Ketika Melihat Ka’abah",
    "doa": [{
      "id": 1,
      "arabic": "اَللّٰهُمَّ زِدْ هَذَا الْبَيْتَ تَشْرِيْفًا وَتَعْظِيمًا وَتَكْرِيمًا وَمَهَابَةً، وَزِدْ مَنْ شَرَّفَهُ وَعَظَّمَهُ\nمِمَّنْ حَجَّهُ أَوِ اعْتَمَرَهُ تَشْرِيْفًا، وَتَكرِيمًا، وَتَعْظِيمًا وَبِرًّا\nاَللّٰهُمَّ زِدْ هَذَا الْبَيْتَ تَشْرِيْفًا وَتَعْظِيمًا وَتَكْرِيمًا وَمَهَابَةً، وَزِدْ مَنْ شَرَّفَهُ وَعَظَّمَهُ\nمِمَّنْ حَجَّهُ أَوِ اعْتَمَرَهُ تَشْرِيْفًا، وَتَكرِيمًا، وَتَعْظِيمًا وَبِرًّا",
      "translationEn": "O Allah, add to the glory of this house, its greatness and greatness. And add glory, greatness and goodness to those who visit it for Hajj and Umrah.",
      "translationMy": "Ya Allah, tambahkanlah kemuliaan rumah ini, kebesaran dan kehebatannya. Dan tambahkanlah kemuliaan, kebesaran dan kebaikan kepada orang yang mengunjunginya kerana membuat haji dan umrah."
    }],
    "category": ["masjidil haram"],
    "audio": ""
  },
  {
    "id": 12,
    "titleEn": "Dua before Tawaf",
    "titleMy": "Doa Sebelum Memulakan Tawaf",
    "doa": [{
      "id": 1,
      "arabic": "اَللّٰهُمَّ إِنِّي أُرِيدُ طَوَافَ بَيتِكَ الحَرَامِ فَيَسِّرهُ وَ تَقَبَّلهُ مِنِّي",
      "translationEn": "O Allah, I am about to perform tawaf around Your holy house, so give me ease and accept it from me.",
      "translationMy": "Ya Allah, sesungguhnya aku hendak mengerjakan tawaf mengelilingi rumahMu yang suci, maka berikanlah aku kemudahan dan terimalah ia daripadaku."
    }],
    "category": ["tawaf"],
    "audio": ""
  },
  {
    "id": 13,
    "titleEn": "Arrival Tawaf",
    "titleMy": "Tawaf Qudum",
    "doa": [{
      "id": 1,
      "arabic": "نَوَيْتُ أَن أَطُوفَ طَوَافَ القُدُومِ سَبعَةَ أَشوَاطٍ لِلّٰهِ تَعَالَى",
      "translationEn": "I intended to perform arrival tawaf, seven rounds for the sake of Allah Most High",
      "translationMy": "Sahaja aku berniat mengerjakan tawaf qudum tujuh pusingan kerana Allah Taala."
    }],
    "category": ["intention", "tawaf"],
    "audio": ""
  },
  {
    "id": 14,
    "titleEn": "Tawaf Hajj",
    "titleMy": "Tawaf Haji",
    "doa": [{
      "id": 1,
      "arabic": "نَوَيْتُ أَن أَطُوفَ طَوَافَ الحَجِّ سَبعَةَ أَشوَاطٍ لِلّٰهِ تَعَالَى",
      "translationEn": "I intended to perform haj tawaf, seven rounds for the sake of Allah Most High",
      "translationMy": "Sahaja aku berniat mengerjakan tawaf haji tujuh pusingan kerana Allah Taala"
    }],
    "category": ["intention", "tawaf"],
    "audio": ""
  },
  {
    "id": 15,
    "titleEn": "Tawaf Umrah",
    "titleMy": "Tawaf Umrah",
    "doa": [{
      "id": 1,
      "arabic": "نَوَيْتُ أَن أَطُوفَ طَوَافَ العُمرَةِ سَبعَةَ أَشوَاطٍ لِلّٰهِ تَعَالَى",
      "translationEn": "Sahaja aku berniat mengerjakan tawaf umrah tujuh pusingan kerana Allah Taala",
      "translationMy": "I intended to perform umrah tawaf, seven rounds for the sake of Allah Most High"
    }],
    "category": ["intention", "tawaf"],
    "audio": ""
  },
  {
    "id": 16,
    "titleEn": "Tawaf Sunnah",
    "titleMy": "Tawaf Sunnah",
    "doa": [{
      "id": 1,
      "arabic": "نَوَيْتُ أَن أَطُوفَ طَوَافَ السُّنَّةِ سَبعَةَ أَشوَاطٍ لِلّٰهِ تَعَالَى",
      "translationEn": "I intended to perform sunnah tawaf, seven rounds for the sake of Allah Most High",
      "translationMy": "Sahaja aku berniat mengerjakan tawaf sunnah tujuh pusingan kerana Allah Taala"
    }],
    "category": ["intention", "tawaf"],
    "audio": ""
  },
  {
    "id": 17,
    "titleEn": "Farewell Tawaf",
    "titleMy": "Tawaf Wada’",
    "doa": [{
      "id": 1,
      "arabic": "نَوَيْتُ أَن أَطُوفَ طَوَافَ الوَدَاعِ سَبعَةَ أَشوَاطٍ لِلّٰهِ تَعَالَى",
      "translationEn": "I intended to perform farewell tawaf, seven rounds for the sake of Allah Most High",
      "translationMy": "Sahaja aku berniat mengerjakan tawaf wada’ tujuh pusingan kerana Allah Taala"
    }],
    "category": ["tawaf"],
    "audio": ""
  },
  {
    "id": 18,
    "titleEn": "1st Round Of Tawaf",
    "titleMy": "Doa Tawaf Pusingan Pertama",
    "doa": [{
      "id": 1,
      "arabic": "سُبْحَانَ اللهِ وَالْحَمْدُ لِلَّهِ وَلَا إِلٰهَ إِلَّا اللهُ وَ اللهُ أَكْبَرُ\nوَلَا حَوْلَ وَلَا قُوَّةَ إِلَّا بِاللهِ الْعَلِيِّ الْعَظِيْمِ\nوَالصَّلَاةُ وَالسَّلاَمُ عَلَى رَسُولِ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ\nاَللَّهُمَّ إِيْمَانًا بِكَ وَتَصَدِيْقًا بِكِتَابِكَ وَوَفَاءًا بِعَهدِك وَاتِّبَاعًا لِسُنَّةِ\nنَبِيِّكَ وَ حَبِيبِكَ مُحَمَّدٍ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ\nاَللَّهُمَّ إِنِّي أَسْئَلُكَ الْعَفْوَى وَالْعَافِيَةَ وَ الُمعَافَاةَ الدَّائِمَةَ\nفِي الدِّيْنِ وَالدُّنْيَا وَالْأَخِرَةِ وَالْفَوْزَ بِالْجَنَّةِ وَالنَّجَاةَ مِنَ النَّارِ\nسُبْحَانَ اللهِ وَالْحَمْدُ لِلَّهِ وَلَا إِلٰهَ إِلَّا اللهُ وَ اللهُ أَكْبَرُ\nوَلَا حَوْلَ وَلَا قُوَّةَ إِلَّا بِاللهِ الْعَلِيِّ الْعَظِيْمِ\nوَالصَّلَاةُ وَالسَّلاَمُ عَلَى رَسُولِ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ\nاَللَّهُمَّ إِيْمَانًا بِكَ وَتَصَدِيْقًا بِكِتَابِكَ وَوَفَاءًا بِعَهدِك وَاتِّبَاعًا لِسُنَّةِ\nنَبِيِّكَ وَ حَبِيبِكَ مُحَمَّدٍ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ\nاَللَّهُمَّ إِنِّي أَسْئَلُكَ الْعَفْوَى وَالْعَافِيَةَ وَ الُمعَافَاةَ الدَّائِمَةَ\nفِي الدِّيْنِ وَالدُّنْيَا وَالْأَخِرَةِ وَالْفَوْزَ بِالْجَنَّةِ وَالنَّجَاةَ مِنَ النَّارِ",
      "translationEn": "Glory be to Allah and all praise be to Him. There is no God but Allah. Allah is Great, and there is no power, except by the permission of Allah the Most High and the Exalted. Peace and blessings be upon the Messenger of Allah s.a.w. O Allah, for believing in You, and for believing in Your Book, and being faithful to Your promises, and following the Sunnah of Your Prophet, and Your beloved Muhammad s.a.w. O Allah, I ask for forgiveness, health and well-being in religion, in this world and in the hereafter, to obtain victory and paradise and to be spared from Hellfire.",
      "translationMy": "Maha Suci Allah dan segala puji bagiNya. Tiada Tuhan kecuali Allah. Allah Maha Besar, dan tidak ada suatu kekuatan, kecuali dengan izin Allah Yang Maha Tinggi dan Maha Agung. Selawat dan salam bagi Rasulullah s.a.w. Ya Allah, kerana iman kepadaMu, dan kerana meyakini kitabMu, serta setia kepada janjiMu, dan mengikuti sunnah NabiMu, dan kekasihMu Muhammad s.a.w. Ya Allah sesungguhnya aku mohon keampunan, kesihatan dan kesejahteraan terus menerus di dalam beragama, di dunia dan di akhirat, memperoleh kemenangan dan syurga serta terhindar dari neraka."
    }],
    "category": ["tawaf"],
    "audio": ""
  },
  {
    "id": 19,
    "titleEn": "Doa From Rukun Yamani To Hajar Aswad",
    "titleMy": "Doa Dari Rukun Yamani Hingga Hajar Aswad",
    "doa": [{
      "id": 1,
      "arabic": "اَللَّهُمَّ رَبَّنَا آتِنَا فِي الدُّنْيَا حَسَنَةً وَفِي الآخِرَةِ حَسَنَةً وَقِنَا عَذَابَ النَّارِ\nوَ أَدخِلنَا الجَنَّةَ مَعَ الأَبرَارِ يَا عَزِيزُ يَا غَفَّارُ يَا رَبَّ العَالَمِين",
      "translationEn": "O Allah, O our Lord, give us good in this world and good in the Hereafter, and save us from the punishment of Hell, and admit us to Paradise with those who do righteous deeds. O Lord, the Most Forgiving. Oh the Lord of the universe.",
      "translationMy": "Ya Allah Ya Tuhan kami, berilah kami kebaikan di dunia dan kebaikan di akhirat, serta selamatkanlah kami dari azab neraka, Dan masukkanlah kami ke dalam syurga bersama orang-orang yang berbuat kebajikan. Ya Tuhan yang Maha Mulia Iagi Maha Pengampun. Ya Tuhan alam semesta."
    }],
    "category": ["tawaf"],
    "audio": ""
  },
  {
    "id": 20,
    "titleEn": "2nd Round Of Tawaf",
    "titleMy": "Doa Tawaf Pusingan Kedua",
    "doa": [{
      "id": 1,
      "arabic": "اَللَّهُمَّ إِنََ هَذَا الْبَيْتَ بَيْتُكَ وَالْحَرَمَ حَرَمُكَ وَالْأَمْنَ أَمْنُكَ وَالْعَبْدَ عَبْدُكَ\nوَأَنَا عَبْدُكَ وَابْنُ عَبْدِكَ وَهَذَا مَقَامُ العَائِذِ بِكَ مِنَ النَّارِ\nفَحَرِّمْ لُحُومُنَا وَبَشَرَتَنَا عَلَى النَّارِ\nاَللَّهُمَّ حَبِّبْ إِلَيْنَا الْإيْمَانَ وَزَيِّنْهُ فِي قَلُوبِنَا وَكَرِّهْ إِلَيْنَا الْكُفْرَ وَالْفُسُوقَ\nوَالْعِصْيَانَ وَاجْعَلْنَا مِنَ الرَّاشِدِينَ اللَّهُمَّ قِنِي عَذَابَكَ يَوْمَ تَبْعَثُ عِبَادَكَ\nاَللَّهُمَّ ارْزُقْنَا الْجَنَّةَ بِغَيْرِ حِسَابٍ",
      "translationEn": "Allah, this house is Your house, and this forbidden land is Your forbidden land, this land of peace is Yours, this servant is Your servant, and the son of Your servant, and this place is a place where people take refuge in You from the torment of Hell, so keep our flesh and skin away from the fire of Hell. O Allah, make our hearts lovers of faith, adorn our hearts with it (faith), and make us hate with disbelief, wickedness and disobedience, and make us among those who are guided. O Allah, protect us from Your punishment on the day You raise up Your servants. O Allah, grant me paradise without reckoning.",
      "translationMy": "Ya Allah, sesungguhnya rumah ini adalah rumahMu, dan tanah haram ini adalah tanah haramMu, negeri aman ini adalah negeriMu, hamba ini adalah hambaMu, dan anak dari hambaMu, dan tempat ini adalah tempat orang berlindung padaMu dari seksa neraka, maka jauhkanlah daging dan kulit kami dari api neraka. Ya Allah, jadikanlah hati kami pencinta keimanan, hiasilah hati kami dengannya (iman), dan jadikanlah kami benci dengan kekafiran, kefasikan dan kemaksiatan, serta jadikanlah kami di antara orang yang mendapat petunjuk. Ya Allah, lindungilah kami dari azabMu pada hari Engkau membangkitkan hamba-hambaMu. Ya Allah, anugerahilah aku syurga tanpa perhitungan”"
    }],
    "category": ["tawaf"],
    "audio": ""
  },
  {
    "id": 21,
    "titleEn": "Doa From Rukun Yamani To Hajar Aswad",
    "titleMy": "Doa Dari Rukun Yamani Hingga Hajar Aswad",
    "doa": [{
      "id": 1,
      "arabic": "اَللَّهُمَّ رَبَّنَا آتِنَا فِي الدُّنْيَا حَسَنَةً وَفِي الآخِرَةِ حَسَنَةً وَقِنَا عَذَابَ النَّارِ\nوَ أَدخِلنَا الجَنَّةَ مَعَ الأَبرَارِ يَا عَزِيزُ يَا غَفَّارُ يَا رَبَّ العَالَمِينَ",
      "translationEn": "O Allah, O our Lord, give us good in this world and good in the Hereafter, and save us from the punishment of Hell, and admit us to Paradise with those who do righteous deeds. O Lord, the Most Forgiving. Oh the Lord of the universe.",
      "translationMy": "Ya Allah Ya Tuhan kami, berilah kami kebaikan di dunia dan kebaikan di akhirat, serta selamatkanlah kami dari azab neraka, Dan masukkanlah kami ke dalam syurga bersama orang-orang yang berbuat kebajikan. Ya Tuhan yang Maha Mulia Iagi Maha Pengampun. Ya Tuhan alam semesta. "
    }],
    "category": ["tawaf"],
    "audio": ""
  },
  {
    "id": 22,
    "titleEn": "3rd Round Of Tawaf",
    "titleMy": "Doa Tawaf Pusingan Ketiga",
    "doa": [{
      "id": 1,
      "arabic": "اَ اَللّٰهُمَّ إِنِّي أَعُوذُ بِكَ مِن الشَّكِّ وَالشِرْكِ والشِّقَاقِ والنِّفَاقِ\nوسُوءِ الأَخْلاَقِ وَسُوءِ المَنْظَرِ وَالُمنْقَلَبِ فِي الَمالِ والأَهْلِ والوَلَدِ\nاَللَّهُمَّ إِنِّي أَسْأَلُكَ رِضَاكَ والجَنَّةَ وأَعُوذُبِكَ مِن سَخَطِكَ والنَّارِ\nاَللَّهُمَّ إِنِّي أَعُوذُبِكَ مِنْ فِتْنَةِ القَبرِ وأَعُوذُ بِكَ مِن فِتْنَةِ المَحْيَا وَالمَمَاتِ",
      "translationEn": "O Allah, I take refuge in You from anxiety, shirk, division, hypocrisy, bad morals, bad outlook, and wrong dealings in property, family and children. O Allah, I ask You and Paradise to be pleased and to protect Your wrath and Hell. O Allah, I beg to be protected from the slander of the grave and to be protected from the temptations of life and death.",
      "translationMy": "Ya Allah, sesungguhnya aku berlindung kepadaMu dari kebimbangan, kesyirikan, perpecahan, kemunafikan, keburukan akhlak, keburukan pandangan, dan kesalahan urusan dalam harta, keluarga dan anak-anak. Ya Allah, aku mohon redaMu dan syurga serta mohon perlindungan terhadap kemarahanMu dan neraka. Ya Allah, aku mohon dilindungi dari fitnah kubur dan mohon dilindungi dari berbagai godaan kehidupan dan kematian."
    }],
    "category": ["tawaf"],
    "audio": ""
  },
  {
    "id": 23,
    "titleEn": "Doa From Rukun Yamani To Hajar Aswad",
    "titleMy": "Doa Dari Rukun Yamani Hingga Hajar Aswad",
    "doa": [{
      "id": 1,
      "arabic": "اَللَّهُمَّ رَبَّنَا آتِنَا فِي الدُّنْيَا حَسَنَةً وَفِي الآخِرَةِ حَسَنَةً وَقِنَا عَذَابَ النَّارِ\nوَ أَدخِلنَا الجَنَّةَ مَعَ الأَبرَارِ يَا عَزِيزُ يَا غَفَّارُ يَا رَبَّ العَالَمِينَ",
      "translationEn": "O Allah, O our Lord, give us good in this world and good in the Hereafter, and save us from the punishment of Hell, and admit us to Paradise with those who do righteous deeds. O Lord, the Most Forgiving. Oh the Lord of the universe.",
      "translationMy": "Ya Allah Ya Tuhan kami, berilah kami kebaikan di dunia dan kebaikan di akhirat, serta selamatkanlah kami dari azab neraka, Dan masukkanlah kami ke dalam syurga bersama orang-orang yang berbuat kebajikan. Ya Tuhan yang Maha Mulia Iagi Maha Pengampun. Ya Tuhan alam semesta. "
    }],
    "category": ["tawaf"],
    "audio": ""
  },
  {
    "id": 24,
    "titleEn": "4th Round Of Tawaf",
    "titleMy": "Doa Tawaf Pusingan Keempat",
    "doa": [{
      "id": 1,
      "arabic": "اَللّٰهُمَّ اجْعَلْنِي حَجًّا مَبْرُورًا وَسَعْياً مَشْكُورًا وَذَنباً مَغْفُورًا\nوَعَمَلًا صَالِحًا مَقْبُولًا وَتِجًارَةً لَنْ تَبُورَ\nيَا عَالِمَ مَا فِي الصُّدُورِ أَخْرِجْنِي  يَا اَللهُ مِنَ الظُّلُمَاتِ إِلَى النُّورِ\nاَللّٰهُمَّ إِنِّي أَسْأَلُكَ مُوجِبَاتِ رَحْمَتِكَ وَعَزَائِمَ مَغْفِرَتِكَ وَالسَّلاَمَةَ\nمِن كُلِّ إِثْمٍ والغَنِيمَةَ مِن كُلِّ بِرٍّ والفَوْزَ بِالجَنَّةِ وَ النَّجَاةَ مِن النَّارِ\nرَبِّي قَنِّعْنِي بِمَا رَزَقتَنِي وَبَارِكْ لِي فِيمَا أَعْطَيْتَنِي\nوَاخْلُفْ عَلَيَّ كُلَّ غَائِبَةٍ لِي مِنْكَ بِخَيْرٍ",
      "translationEn": "O Allah, make my Hajj a mabrur, a blessing that is accepted, sins that are forgiven, righteous deeds that are accepted, and merchandise that is not harmful. O God Almighty, there is nothing stored in the chest. O Allah, bring me out of darkness into a bright light. O Allah, I beg forgiveness from You all that brings Your mercy, all that leads to forgiveness, the farthest from all sins, to obtain all goodness, and to enter Paradise and escape from Hell. O my Lord, comfort my heart with the sustenance You have given me and bless all that You have given me, and replace all that I have lost with goodness from Your side.",
      "translationMy": "Ya Allah, jadikanlah hajiku haji yang mabrur, sai yang diterima, dosa yang terampun, amal soleh yang diterima, serta dagangan yang tidak merugikan. Wahai Tuhan Yang Maha Mengetahui apa-apa tersimpan di dalam dada. Ya Allah, keluarkanlah aku dari kegelapan kepada cahaya terang. Ya Allah, aku mohon maaf padaMu segala hal yang mendatangkan rahmatMu, semua yang membawa kepada keampunan, terjauh dari segala dosa, memperoleh segala kebaikan, dan berjaya memasuki syurga serta terlepas dari neraka. Ya Tuhanku tenteramkan hatiku dengan rezeki yang Engkau beri dan berkatilah segala yang Engkau telah kurniakan kepadaku, dan gantilah segala yang terluput dariku dengan kebaikan dari sisiMu"
    }],
    "category": ["tawaf"],
    "audio": ""
  },
  {
    "id": 25,
    "titleEn": "Doa From Rukun Yamani To Hajar Aswad",
    "titleMy": "Doa Dari Rukun Yamani Hingga Hajar Aswad",
    "doa": [{
      "id": 1,
      "arabic": "اَللَّهُمَّ رَبَّنَا آتِنَا فِي الدُّنْيَا حَسَنَةً وَفِي الآخِرَةِ حَسَنَةً وَقِنَا عَذَابَ النَّارِ\nوَ أَدخِلنَا الجَنَّةَ مَعَ الأَبرَارِ يَا عَزِيزُ يَا غَفَّارُ يَا رَبَّ العَالَمِينَ",
      "translationEn": "O Allah, O our Lord, give us good in this world and good in the Hereafter, and save us from the punishment of Hell, and admit us to Paradise with those who do righteous deeds. O Lord, the Most Forgiving. Oh the Lord of the universe.",
      "translationMy": "Ya Allah Ya Tuhan kami, berilah kami kebaikan di dunia dan kebaikan di akhirat, serta selamatkanlah kami dari azab neraka, Dan masukkanlah kami ke dalam syurga bersama orang-orang yang berbuat kebajikan. Ya Tuhan yang Maha Mulia Iagi Maha Pengampun. Ya Tuhan alam semesta. "
    }],
    "category": ["tawaf"],
    "audio": ""
  },
  {
    "id": 26,
    "titleEn": "5th Round Of Tawaf",
    "titleMy": "Doa Tawaf Pusingan Kelima",
    "doa": [{
      "id": 1,
      "arabic": "اَللَّهُمَّ أَظِلَّنِي تَحْتَ ظِلِّ عَرْشِكَ يَوْمَ لَا ظِلَّ إِلَّا ظِلَّكَ وَلَا بَقِيَ\nإِلَّا وَجْهُكَ وَاسْقِنِي مِنْ حَوْضِ نَبِيِّكَ مُحَمَّدٍ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ\nشَرْبَةً هَنِيئَةً مَرِيئَةً لَا أَظمَؤُ بَعْدَهَا أَبَدًا، اَللَّهُمَّ إِنِّي أَسْأَلُكَ مِنْ خَيْرِ\nمَا سَأَلَكَ مِنهُ نَبِيُّكَ مُحَمَّدٌ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَأَعُوُذُبِكَ مِنْ شَرِّ\nمَا استَعَاذَكَ مِنْهُ نَبِيُّكَ مُحَمَّدٌ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ اَللّٰهُمَّ إِنِّي أَسْأَلُكَ\nالجَنَّةَ وَنَعِيمَهَا وَمَا يُقَرِّبُنِي إِلَيْهَا مِنْ قَوْلٍ أَوْ فِعْلٍ أَوْ عَمَلٍ وَأَعُوذُبِكَ\nمِنَ النَّارِ وَمَا يُقَرِّبُنِي إِلَيْهَا مِنْ قَوْلٍ أَوْ فِعْلٍ أَوْ عَمَلٍ",
      "translationEn": "O Allah, protect me under Your shade on a day when there is no shade except Your shade, and there is nothing left but Your face, Give me a drink from the well of the Prophet Muhammad s.a.w., a delicious and refreshing drink, after which I will never thirst Iagi. O Allah, I ask You for the best that Your Prophet, Muhammad s.a.w. has ever asked for. And I take refuge in You from evil as the protection requested by the Prophet Muhammad s.a.w. O Allah, I ask You for Paradise with all its pleasures and all that brings me closer to it, whether in word, deed or deed. And I ask You for protection from Hell and everything that brings me closer to it, both in word, deed and deed.",
      "translationMy": "Ya Allah, lindungilah aku di bawah naunganMu pada hari yang tiada naungan, kecuali naunganMu, dan tiada yang tinggal kecuali wajahMu, Berilah aku minum dari telaga Nabi Muhammad s.a.w., minuman yang lazat yang menyegarkan, yang sesudahnya aku tidak akan pernah haus Iagi. Ya Allah, aku mohon kepadaMu dari apa yang terbaik yang pernah diminta oleh NabiMu, Muhammad s.a.w.  Dan aku berlindung kepadaMu dari kejahatan sebagaimana perlindungan yang di mohon oleh Nabi Muhammad s.a.w. Ya Allah, aku mohon kepadaMu syurga dengan segala kenikmatannya dan segala yang mendekatkan aku kepadanya, baik perkataan, perbuatan ataupun tindakan. Dan aku mohon perlindungan kepadaMu dari neraka dan segala yang mendekatkan aku kepadanya, baik perkataan, perbuatan dan tindakan."
    }],
    "category": ["tawaf"],
    "audio": ""
  },
  {
    "id": 27,
    "titleEn": "Doa From Rukun Yamani To Hajar Aswad",
    "titleMy": "Doa Dari Rukun Yamani Hingga Hajar Aswad",
    "doa": [{
      "id": 1,
      "arabic": "اَللَّهُمَّ رَبَّنَا آتِنَا فِي الدُّنْيَا حَسَنَةً وَفِي الآخِرَةِ حَسَنَةً وَقِنَا عَذَابَ النَّارِ\nوَ أَدخِلنَا الجَنَّةَ مَعَ الأَبرَارِ يَا عَزِيزُ يَا غَفَّارُ يَا رَبَّ العَالَمِينَ",
      "translationEn": "O Allah, O our Lord, give us good in this world and good in the Hereafter, and save us from the punishment of Hell, and admit us to Paradise with those who do righteous deeds. O Lord, the Most Forgiving. Oh the Lord of the universe.",
      "translationMy": "Ya Allah Ya Tuhan kami, berilah kami kebaikan di dunia dan kebaikan di akhirat, serta selamatkanlah kami dari azab neraka, Dan masukkanlah kami ke dalam syurga bersama orang-orang yang berbuat kebajikan. Ya Tuhan yang Maha Mulia Iagi Maha Pengampun. Ya Tuhan alam semesta. "
    }],
    "category": ["tawaf"],
    "audio": ""
  },
  {
    "id": 28,
    "titleEn": "6th Round Of Tawaf",
    "titleMy": "Doa Tawaf Pusingan Keenam",
    "doa": [{
      "id": 1,
      "arabic": "اَللّٰهُمَّ إِنَّ لَكَ عَلَيَّ حُقُوقًا كَثِيرًا فِيمَا بَيْنِي وَبَيْنَكَ وَحُقُوقًا كَثِيرًا\nفِيمَا بَيْنِي وَبَيْنَ خَلْقِكَ ، اَللّٰهُمَّ مَا كَانَ لَكَ مِنْهُ فَاغْفِرْهُ لِي\nوَمَا كَانَ لِخَلْقِكَ فَتَحَمَّلهُ عَنِّي وَأَغْنِنِي بِحَلَالِكَ عَنْ حَرَامِكَ\nوَبِطَاعَتِكَ عنْ مَعْصِيَتِكَ وَبِفَضْلِكَ عَمَّنْ سِوَاكَ يَا وَاسِعَ الَمغْفِرَةِ\nاَللّٰهُمَّ إِنَّ بَيْتَكَ عَظِيمٌ وَوَجْهَكَ كَرِيْمٌ وَأَنْتَ يَا اللَّهُ\nحَلِيمٌ كَرِيمٌ عَظِيمٌ تُحِبُّ العَفْوَ فَاعْفُ عَنِّي",
      "translationEn": "O Allah, Your rights are great for me, as well as those related to me and Your creatures. All your rights against me, forgive me about them, and what belongs to your servant to me, then set me free from it. Satisfy me with the lawful sustenance that You give, free from what is haram. Give me obedience to You and keep me from being disobedient to You. Suffice Your gift for me, so that I do not need anything else, O Lord of the Most Abundant Your forgiveness. O Allah, verily Thy house is great, Thy face is noble, and You, O Allah, are Most Merciful, Most Merciful, and Most Wise. You love forgiveness, forgive me.",
      "translationMy": "Ya Allah, hakMu sungguh banyak padaku, begitu juga yang berkaitan antara aku dan makhlukMu. Segala hakMu terhadapku, ampunilah aku tentang itu, dan mana yang termasuk hak hambaMu padaku, maka bebaskanlah aku daripadanya. Cukupkan aku dengan rezeki yang halal yang Engkau berikan, terbebas dari yang haram. Kurniakanlah aku ketaatan padaMu dan jauhkanlah aku dari kederhakaan terhadapMu. Cukupkan bagiku kurniaanMu, sehingga aku tidak memerlukan selain itu, wahai Tuhan Yang Maha Luas keampunanMu. Ya Allah, sesungguhnya rumahMu Agung, wajahMu Mulia, dan Engkau Ya Allah Maha Penyayang, Pemurah dan Maha Bijaksana. Engkau menyukai keampunan, ampunilah aku."
    }],
    "category": ["tawaf"],
    "audio": ""
  },
  {
    "id": 29,
    "titleEn": "Doa From Rukun Yamani To Hajar Aswad",
    "titleMy": "Doa Dari Rukun Yamani Hingga Hajar Aswad",
    "doa": [{
      "id": 1,
      "arabic": "اَللَّهُمَّ رَبَّنَا آتِنَا فِي الدُّنْيَا حَسَنَةً وَفِي الآخِرَةِ حَسَنَةً وَقِنَا عَذَابَ النَّارِ\nوَ أَدخِلنَا الجَنَّةَ مَعَ الأَبرَارِ يَا عَزِيزُ يَا غَفَّارُ يَا رَبَّ العَالَمِينَ",
      "translationEn": "O Allah, O our Lord, give us good in this world and good in the Hereafter, and save us from the punishment of Hell, and admit us to Paradise with those who do righteous deeds. O Lord, the Most Forgiving. Oh the Lord of the universe.",
      "translationMy": "Ya Allah Ya Tuhan kami, berilah kami kebaikan di dunia dan kebaikan di akhirat, serta selamatkanlah kami dari azab neraka, Dan masukkanlah kami ke dalam syurga bersama orang-orang yang berbuat kebajikan. Ya Tuhan yang Maha Mulia Iagi Maha Pengampun. Ya Tuhan alam semesta. "
    }],
    "category": ["tawaf"],
    "audio": ""
  },
  {
    "id": 30,
    "titleEn": "7th Round Of Tawaf",
    "titleMy": "Doa Tawaf Pusingan Ketujuh",
    "doa": [{
      "id": 1,
      "arabic": "اَللَّهُمَّ إِنِّي أَسْأَلُكَ إِيْمَاناً كَامِلًا وَيَقِينًا صَادِقًا وَرِزْقًا وَاسِعًا\nوَقَلْبًا خَاشِعًا ولِسَانًا ذَاكِرًا وَحَلَالًا طَيِّبًا وَتَوْبَةً نَصُوحًا\nوَتَوْبَةً قَبْلَ المَوْتِ وَرَاحَةً عِنْدَ الَموْتِ وَمَغْفِرَةً وَرَحْمَةً\nبَعْدَ المَوْتِ وَالْعَفْوَ عِنْدَ الحِساَبِ وَالفَوْزَ بِالْجَنَّةِ وَالنَّجَاةَ مِنَ النَّارِ\nبِرَحْمَتِكَ يَا عَزِيْزُ يَا غَفَّارُ رَبِّ زِدنِي عِلمًا وَ اَلحِقنِي بِاْلصَّالِحِينَ",
      "translationEn": "O Allah, O my Lord, I ask for the blessing of perfect faith, true confidence, sustenance, a sincere heart, a tongue who always recite zikr, halal good things provided by you, true repentance before death, forgiveness and mercy after death forgiveness when deceived by practice, success in obtaining Paradise and salvation from Hell, with the mercy of You, O Lord Almighty, the Most Forgiving, O Lord, add knowledge to me and put me in the company of the righteous.",
      "translationMy": "Ya Allah ya Tuhanku, sesungguhnya aku memohon dikurniakan iman yang sempurna, keyakinan yang sebenar-benarnya, rezeki yang Iuas, hati yang khusyuk, Iidah yang sentiasa berziki, dan perkara halal yang baik, taubat yang sebenar sebelum mati keampunan dan rahmat sesudah mati kemaafan ketika dihisabkan amalan, kejayaan dengan mendapat syurga dan keselamatan daripada neraka, dengan belas kasihan Engkau ya Tuhan yang Maha Kuasa Iagi Maha Pengampun, ya Tuhan, tambahkan ilmu pengetahuan kepadaku dan masukkan daku ke dalam golongan orang-orang yang soleh."
    }],
    "category": ["tawaf"],
    "audio": ""
  },
  {
    "id": 31,
    "titleEn": "Doa From Rukun Yamani To Hajar Aswad",
    "titleMy": "Doa Dari Rukun Yamani Hingga Hajar Aswad",
    "doa": [{
      "id": 1,
      "arabic": "اَللَّهُمَّ رَبَّنَا آتِنَا فِي الدُّنْيَا حَسَنَةً وَفِي الآخِرَةِ حَسَنَةً وَقِنَا عَذَابَ النَّارِ\nوَ أَدخِلنَا الجَنَّةَ مَعَ الأَبرَارِ يَا عَزِيزُ يَا غَفَّارُ يَا رَبَّ العَالَمِينَ",
      "translationEn": "O Allah, O our Lord, give us good in this world and good in the Hereafter, and save us from the punishment of Hell, and admit us to Paradise with those who do righteous deeds. O Lord, the Most Forgiving. Oh the Lord of the universe.",
      "translationMy": "Ya Allah Ya Tuhan kami, berilah kami kebaikan di dunia dan kebaikan di akhirat, serta selamatkanlah kami dari azab neraka, Dan masukkanlah kami ke dalam syurga bersama orang-orang yang berbuat kebajikan. Ya Tuhan yang Maha Mulia Iagi Maha Pengampun. Ya Tuhan alam semesta. "
    }],
    "category": ["tawaf"],
    "audio": ""
  },
  {
    "id": 32,
    "titleEn": "Sunnah Prayer Intention  After Tawaf",
    "titleMy": "Niat Solat Sunnah Tawaf",
    "doa": [{
      "id": 1,
      "arabic": "اُصَلِّي سُنَّةَ الطَّوَافِ رَكْعَتَيْنِ لِلّٰهِ تَعَالٰى",
      "translationEn": "I intended to pray two raka’at of sunnah Tawaf for the sake of Allah Most High",
      "translationMy": "Sahaja aku solat Tawaf dua rakaat kerana Allah Taala"
    }],
    "category": ["tawaf", "intention"],
    "audio": ""
  },
  {
    "id": 33,
    "titleEn": "Dua After Tawaf Prayer",
    "titleMy": "Doa Setelah Solat Sunat Tawaf",
    "doa": [{
      "id": 1,
      "arabic": "اَللّٰهُمَّ إِنَّ هَذَا بَلَدُكَ الْحَرَمُ، وَمَسْجِدُكَ الْحَرَامُ، وَبَيْتُكَ الْحَرَامُ\nوَأَنَا عَبْدُكَ وَابْنُ عَبْدِكَ وَابْنُ أَمَتِكَ أَتَيْتُكَ بِذُنُوْبٍ كَثِيرَةٍ\nوَخَطَايَا جَمَّةٍ وَأَعْمَالٍ سَيِّئَةٍ، وَهَذَا مَقَامُ الْعَائِذِ بِكَ مِنَ النَّارِ\n\nاَللّٰهُمَّ عَافِنَا وَاعْفُ عَنَّا وَاغْفِرْ لَنَا إِنَّكَ أَنْتَ الْغَفُوْرُ الرَّحِيمُ \nاَللّٰهُمَّ إِنَّكَ دَعَوْتَ عِبَادَكَ إِلَى بَيْتِكَ الْحَرَامِ، وَقَدْ جِئْتُ طَالِبًا مَرْضَاتِكَ\n\nوَأَنْتَ مَنَنْتَ عَلَىَّ فَاغْفِرْ لِي وَارْحَمْنِي وَعَافِنِي وَاعْفُ عَنِّي\nإِنَّكَ عَلَى كُلِّ شَيْءٍ قَدِيرٌ. اَللّٰهُمَّ يَسِّرْلِيَ الْيُسْرَى وَجَنِّبْنِيَ الْعُسْرَى\n\nوَاغْفِرْ لِي فِي الْآخِرَةِ وَالْأَوْلَى، اَللّٰهُمَّ اعْصِمْنِي بِأَلطَافِكَ\nوَاجْعَلْنِي مِمَّنْ يُحِبُّكَ وَيُحِبُّ مَلَائِكَتَكَ وَرُسُلَكَ وَأَنْبِيَائَكَ\n\nوَعِبَادَكَ الصَّالِحِيْنَ وَأَوْلِيَائَكَ الْمُتَّقِينَ. اَللّٰهُمَّ كَمَا هَدَيْتَنِي لِلْإِسْلَامِ\nفَثَبِّتنِي عَلَيْهِ وَاسْتَعْمِلْنِي فِي طَاعَتِكَ وَطَاعَةِ رَسُوْلِكَ\n\nوَأَجِرْنِي مِنْ مُضِلَّاتِ الْفِتَنِ. اَللّٰهُمَّ إِنَّكَ تَعْلَمُ سِرِّي وَعَلَانِيَتِي\nفَاغْفِرْ لِي ذَنْبِي، اَللّٰهُمَّ إِنِّي أَسْأَلُكَ إِيْمَانًا دَائِمًا يُبَاشِرُ قَلْبِي\n\nوَأَسْأَلُكَ يَقِيْنًا صَادِقًا حَتَّى أَعْلَمَ أَنَّهُ لَنْ يُصِيبَنِي إِلَّا مَا كَتَبْتَهُ عَلَيَّ\nوَرَضِّنِي بِمَا قَسَمْتَهُ لِي يَا ذَا الْجَلَالِ وَالْإِكْرَامِ، اَللّٰهُمَّ صَلِّ وَسَلَّمْ\n\nعَلَى حَبِيْبِكَ سَيِّدِنَا مُحَمَّدٍ وَعَلَى جَمِيعِ الْأَنْبِيَاءِ وَالْمُرْسَلِيْنَ\nوَ آلِ كُلِّ مِنهُم وَ مَن تَبِعَهُم بِإِحسَانٍ إِلَى يَومِ الدِّينِ، يَا أَرحَمَ الرَّاحِمِينَ",
      "translationEn": "",
      "translationMy": "Ya Allah, sesungguhnya ini negeriMu yang suci, masjidMu yang suci rumahMu yang suci, aku adalah hambaMu dan anak kepada hambaMu, telah datang dengan dosa dan banyak kesalahan dan amalan-amalan yang buruk dan inilah tempatnya bagi hamba yang berlindung denganMu dari api neraka.\n\nYa Allah, selamatkanlah kami, ampunilah kami kasihaniIah kami, sesungguhnya Engkau Maha Pengampun Iagi Maha Penyayang. Ya Allah, bahawasanya Engkau telah memanggil hambahambaMu ke rumah suciMu dan sesungguhnya aku telah datang memohon keredaanMu, dan Engkau telah memberi kurnia kepadaku. Maka ampunilah aku, kasihanilah aku, afiatkan aku dan maafkan aku, sesungguhnya Engkau berkuasa atas segala sesuatu.\n\nYa Allah, berikanlah aku kemudahan dan jauhkan aku dari kepayahan, ampunilah aku di akhirat dan di dunia.\n\nYa Allah, peliharalah aku dengan sifat kelembutanMu, dan jadikanlah aku dari golongan mereka yang cintakanMu, cintakan malaikat-malaikatMu, Rasul-RasulMu, Nabi-NabiMu, hamba-hambaMu yang soleh dan Wali-WaliMu orang yang bertakwa.\n\nYa  Allah, sebagaimana  Engkau telah tunjuki aku kepada Islam, maka tetapkanlah aku di dalamnya, arahkanlah aku kepada ketaatanMu, ketaatan rasulMu, mengetahui perkara yang tersembunyi dan terang dariku, maka terimalah keuzuranku. Engkaulah yang mengetahui hajatku maka berilah keinginanku, dan Engkau mengetahui apa yang di dalam diriku, maka ampunilah dosaku.\n\nYa Allah, aku bermohon mendapat keimanan yang sentiasa hidup dalam hatiku dan keyakinan yang benar hingga aku yakin tidak ada sesuatu yang menimpaku melainkan apa yang telah Engkau tuliskan buatku, maka redakanlah aku dengan apa yang Engkau bahagikan untukku ya Tuhan yang mempunyai Kebesaran dan Kemuliaan.\n\nYa Allah, selawatMu atas kekasihMu Muhammad dan atas sekelian Nabi dan Rasul dan keluarga setiap orang dari mereka dan sesiapa yang mengikutnya hingga ke hari kemudian. Ya Allah, yang Maha Pengasih Iagi Maha Penyayang."
    }],
    "category": ["tawaf"],
    "audio": ""
  },
  {
    "id": 34,
    "titleEn": "Drinking Zam-Zam",
    "titleMy": "Cara Minum Air Zam-Zam",
    "doa": [{
      "id": 1,
      "arabic": "",
      "translationEn": ["To drink with good intentions. This is in accordance with the meaning of the words of the Prophet s.a.w. \"Zam-zam water is for something that we drink because of it", "To faced the Kaaba", "Mention the name of Allah", "Drink with three sips (breaths)", "Drink untill youˈve had enough", "Praise Allah", "Doa"],
      "translationMy": ["Berniat dengan niat yang baik. Ini sesuai dengan maksud sabda baginda Rasulullah s.a.w. \"Air zamzam adalah untuk sesuatu yang kita minum kerananya\"", "Hadapkan muka ke Kaabah", "Menyebut nama Allah", "Minum dengan tiga tegok(nafas)", "Minum dengan sepuas-puasnya (hingga kenyang)", "Bersyukur kehadrat Allah", "Berdoa"]
    }],
    "category": ["zam-zam"],
    "audio": ""
  },
  {
    "id": 35,
    "titleEn": "Doa Before Drinking Zam-Zam",
    "titleMy": "Doa Ketika Minum Air Zam-Zam",
    "doa": [{
      "id": 1,
      "arabic": "اَللّٰهُمَّ إِنِّي أَسأَلُكَ عِلْمًا نَافِعًا، وَرِزْقًا واسعًا، وَشِفَاءً مِنْ كُلِّ دَاءٍ",
      "translationEn": "Ya Allah, sesungguhnya aku bermohon kepada Engkau ilmu yang bermanfaat, dan rezeki yang Iuas (banyak), dan sembuh dari segala penyakit.",
      "translationMy": "O Allah, verily I ask You for useful knowledge, and abundant sustenance, and healing from all diseases."
    }],
    "category": ["zam-zam"],
    "audio": ""
  },
  {
    "id": 36,
    "titleEn": "",
    "titleMy": "",
    "doa": [{
      "id": 1,
      "arabic": "",
      "translationEn": "",
      "translationMy": ""
    }],
    "category": ["tawaf"],
    "audio": ""
  },
  {
    "id": 37,
    "titleEn": "",
    "titleMy": "",
    "doa": [{
      "id": 1,
      "arabic": "",
      "translationEn": "",
      "translationMy": ""
    }],
    "category": ["tawaf"],
    "audio": ""
  },
  {
    "id": 38,
    "titleEn": "",
    "titleMy": "",
    "doa": [{
      "id": 1,
      "arabic": "",
      "translationEn": "",
      "translationMy": ""
    }],
    "category": ["tawaf"],
    "audio": ""
  },
  {
    "id": 39,
    "titleEn": "",
    "titleMy": "",
    "doa": [{
      "id": 1,
      "arabic": "",
      "translationEn": "",
      "translationMy": ""
    }],
    "category": ["tawaf"],
    "audio": ""
  },
  {
    "id": 40,
    "titleEn": "",
    "titleMy": "",
    "doa": [{
      "id": 1,
      "arabic": "",
      "translationEn": "",
      "translationMy": ""
    }],
    "category": ["tawaf"],
    "audio": ""
  }
]