[
  {
    "id": 1,
    "titleEn": "Talbiyah",
    "titleMy": "Talbiyah",
    "doa": [
      {
        "id": 1,
        "arabic": "لَبَّيْكَ اللّٰهُمَّ لَبَّيْكَ، لَبَّيْكَ لَا شَرِيكَ لَكَ لَبَّيْكَ\nإِنَّ الْحَمْدَ، وَالنِّعْمَةَ، لَكَ وَالْمُلْكَ، لَا شَرِيْكَ لَكَ",
        "translationEn": "Ever at Your service, O Allah, ever at Your service. Ever at Your service, You have no partner, ever at Your service. Verily, all praise, blessings and dominion are Yours. You have no partner. ",
        "translationMy": "Aku menyahut wahai Tuhanku aku menyahut panggilanMu (panggilan Nabi Ibrahim). Tiada sekutu bagiMu, aku menyahut akan panggilan itu. Segala pujian dan kebaikan bagiMu, dan pemerintahan juga bagiMu, Tiada sekutu bagiMu."
      },
      {
        "id": 2,
        "arabic": "اَللّٰهُمَّ صَلِّ عَلَى سَيِّدِنَا مُحَمَّدٍ، وَعَلَى آلِ سَيِّدِنَا مُحَمَّدٍ،\nكَمَا صَلَّيْتَ عَلَى سَيِّدِنَا إِبْرَاهِيمَ، وَعَلَى آلِ سَيِّدِنَا إِبْرَاهِيمَ،\nوَبَارِكْ عَلَى سَيِّدِنَا مُحَمَّدٍ، وَعَلَى آلِ سَيِّدِنَا مُحَمَّدٍ،\nكَمَا بَارَكْتَ عَلَى سَيِّدِنَا إِبْرَاهِيمَ، وَعَلَى آلِ سَيِّدِنَا إِبْرَاهِيمَ،\nفِي الْعَالَمِينَ، إِنَّكَ حَمِيدٌ مَجِيدٌ. اَللّٰهُمَّ إِنِّي أَسْئَلُكَ\nرِضَاكَ وَالْجَنَّةَ وَأَعُوْذُبِكَ مِنْ سَخَطِكَ وَالنَّارِ",
        "translationEn": "O Allah, send blessings upon our master Muhammad and upon the family of our master Muhammad, as You sent blessings upon our master Ibrahim and upon the family of our master Ibrahim. And bless our master Muhammad and the family of our master Muhammad, as You blessed our master Ibrahim and the family of our master Ibrahim, among all the worlds. Indeed, You are the Most Praiseworthy, the Most Glorious. O Allah, I ask You for Your Pleasure and for Paradise, and I seek refuge in You from Your displeasure and from the Fire.",
        "translationMy": "Aku menyahut wahai Tuhanku aku menyahut panggilanMu (panggilan Nabi Ibrahim). Tiada sekutu bagiMu, aku menyahut akan panggilan itu. Segala pujian dan kebaikan bagiMu, dan pemerintahan juga bagiMu, Tiada sekutu bagiMu. Ya Allah, kurniakanlah tambahan rahmat kepada junjungan kami Nabi Muhammad dan kepada keluarga junjungan kami Nabi Muhammad. Sebagaimana Engkau telah mengurniakan rahmat ke atas junjungan kami Nabi Ibrahim dan kepada keluarga junjungan kami Nabi Ibrahim. Kurniakanlah keberkatan kepada junjungan kami Nabi Muhammad dan kepada keluarga junjungan kami Nabi Muhammad. Sebagaimana Engkau telah mengurniakan keberkatan kepada junjungan kami Nabi Ibrahim dan kepada keluarga junjungan kami Nabi Ibrahim. Di dalam seluruh alam, sesungguhnya Engkau adalah Maha Terpuji lagi Mulia. Ya Allah, aku memohon keredaanMu, dan syurga dan aku memohon dengan Engkau dijauhkan dari kemarahanMu dan api neraka"
      }
    ],
    "categoryKey": [
      "talbiyah"
    ],
    "audio": "talbiyah.mp3"
  },
  {
    "id": 2,
    "titleEn": "Intention For Ihram Prayer",
    "titleMy": "Niat Solat Sunnah Ihram",
    "doa": [
      {
        "id": 1,
        "arabic": "اُصَلِّي سُنَّةَ الْاِحْرَامِ رَكْعَتَيْنِ لِلّٰهِ تَعَالٰى",
        "translationEn": "I intend to pray two raka'at of sunnah Ihram for the sake of Allah Most High",
        "translationMy": "Sahaja aku solat sunnah Ihram doa rakaat kerana Allah Taala"
      }
    ],
    "categoryKey": [
      "ihram"
    ],
    "audio": "niat_solat_sunat_ihram.mp3"
  },
  {
    "id": 3,
    "titleEn": "Intention For Umrah Ihram",
    "titleMy": "Niat Ihram Umrah",
    "doa": [
      {
        "id": 1,
        "arabic": "نَوَيْتُ العُمْرَةَ وَأَحْرَمْتُ بِهَا لِلّٰهِ تَعَالَى",
        "translationEn": "I intend to perform Umrah and perform ihram for it for the sake of Allah",
        "translationMy": "Sahaja aku menunaikan Umrah dan aku berihram dengannya kerana Allah"
      }
    ],
    "categoryKey": [
      "ihram",
      "umrah"
    ],
    "audio": "niat_ihram_umrah.mp3"
  },
  {
    "id": 4,
    "titleEn": "Intention For Ihram Umrah On Behalf",
    "titleMy": "Niat Umrah Badal",
    "doa": [
      {
        "id": 1,
        "arabic": "نَوَيْتُ العُمرَةَ عَنْ ........... وَأَحْرَمْتُ بِهَا لِلّٰهِ تَعَالَى",
        "translationEn": "I intend to perform Umrah on behalf of ______ and perform ihram for it for the sake of Allah Most High",
        "translationMy": "Sahaja aku menunaikan Umrah bagi ______ dan aku berihram dengannya kerana Allah Ta'ala"
      }
    ],
    "categoryKey": [
      "ihram",
      "umrah"
    ],
    "audio": "niat_umrah_badal.mp3"
  },
  {
    "id": 5,
    "titleEn": "Conditional Intention for Ihram Umrah",
    "titleMy": "Niat Umrah Bersyarat",
    "doa": [
      {
        "id": 1,
        "arabic": "نَوَيْتُ العُمْرَةَ وَأَحْرَمْتُ بِهَا لِلّٰهِ تَعَالَى\nفَإِنْ حَبَسَنِيْ حَابِسٌ فَمَحِلِّيْ حَيْثُ حَبَسْتَنِيْ",
        "translationEn": "I have intended to perform Umrah and performed ihram for it for the sake of Allah Most High, If I am hindered by any obstacle, then I will perform tahallul in that place.",
        "translationMy": "Sahaja aku menunaikan Umrah dan aku berihram dengannya kerana Allah Ta'ala, jika aku terhalang oleh sesuatu, maka aku akan bertahallul di tempat tersebut."
      }
    ],
    "categoryKey": [
      "ihram",
      "umrah"
    ],
    "audio": "niat_umrah_bersyarat.mp3"
  },
  {
    "id": 6,
    "titleEn": "Intention For Haj Ihram",
    "titleMy": "Niat Ihram Haji",
    "doa": [
      {
        "id": 1,
        "arabic": "نَوَيْتُ الْحَجَّ وَأَحْرَمْتُ بِهِ لِلّٰهِ تَعَالَى",
        "translationEn": "I have intended to perform Haj and performed ihram for it for the sake of Allah Most High",
        "translationMy": "Sahaja aku menunaikan Haji dan aku berihram dengannya kerana Allah Ta'ala"
      }
    ],
    "categoryKey": [
      "ihram",
      "haji"
    ],
    "audio": "niat_ihram_haji.mp3"
  },
  {
    "id": 7,
    "titleEn": "Intention For Haj Ihram On Behalf",
    "titleMy": "Niat Haji Badal",
    "doa": [
      {
        "id": 1,
        "arabic": "نَوَيْتُ الْحَجَّ عَنْ ........... وَأَحْرَمْتُ بِهِ لِلّٰهِ تَعَالَى",
        "translationEn": "I have intended to perform Haj on behalf of ______ and performed ihram for it for the sake of Allah Most High",
        "translationMy": "Sahaja aku menunaikan Haji bagi ______ dan aku berihram dengannya kerana Allah Ta'ala"
      }
    ],
    "categoryKey": [
      "ihram",
      "haji"
    ],
    "audio": "niat_haji_badal.mp3"
  },
  {
    "id": 8,
    "titleEn": "Conditional Intention for Ihram Haj",
    "titleMy": "Niat Haji Bersyarat",
    "doa": [
      {
        "id": 1,
        "arabic": "نَوَيْتُ الحَجَّ وَأَحْرَمْتُ بِهِ لِلّٰهِ تَعَالَى\nفَإِنْ حَبَسَنِيْ حَابِسٌ فَمَحِلِّيْ حَيْثُ حَبَسْتَنِيْ",
        "translationEn": "I have intended to perform Haj and performed ihram for it for the sake of Allah Most High, If I am hindered by any obstacle, then I will perform tahallul in that place.",
        "translationMy": "Sahaja aku menunaikan Haji dan aku berihram dengannya kerana Allah Ta'ala, jika aku terhalang oleh sesuatu, maka aku akan bertahallul di tempat tersebut."
      }
    ],
    "categoryKey": [
      "ihram",
      "haji"
    ],
    "audio": "niat_haji_bersyarat.mp3"
  },
  {
    "id": 9,
    "titleEn": "Entering Masjidil Haram",
    "titleMy": "Memasuki Masjidil Haram",
    "doa": [
      {
        "id": 1,
        "arabic": "اَللّٰهُمَّ اغْفِرْلِيْ ذُنُوبِي وَافْتَحْ لِي أَبْوَابَ رَحْمَتِكَ، وَأَدْخِلْنِي فِيْهَا، وَسَهِّلْ لِي أَبْوَابَ رِزْقِكَ اَللّٰهُمَّ هَذَا حَرَمُكَ، وَمَوْضِعُ أَمْنِكَ فَحَرِّمْ لَحْمِي وَبَشَرِي وَعِظَامِي عَلَى النَّارِ\nاَللّٰهُمَّ أَنْتَ السَّلَامُ وَمِنْكَ السَّلَامُ، وَإِلَيْكَ يَعُوْدُ السَّلَامُ فَحَيِّنَا رَبَّنَا بِالسَّلَامِ\nوَأَدْخِلْنَا الْجَنَّةَ دَارَ السَّلَامِ تَبَارَكْتَ رَبَّنَا وَتَعَالَيْتَ يَا ذَا الْجَلَالِ وَالْإِكْرَامِ\nاَللّٰهُمَّ إِنِّي أَسْأَلُكَ أَنْ تَغْفِرَ لِي، وَتَرْحَمَنِي، وَتُقِيلَ عَثَرَتِيْ، وَتَضَعَ وِزْرِي\nبِرَحْمَتِكَ يَا أَرْحَمَ الرَّاحِمِينَ",
        "translationEn": "O Allah, forgive my sins and open for me the doors of Your mercy, and enter me into Your mercy, and make the door of Your Provision easy for me. O Allah, verily this place is Your Sacred Sanctuary and the place of Your Security, so forbid my flesh, my skin and my bones from the fire. O Allah, You are Peace, and from You comes peace, and to You peace returns. So greet us, our Lord, with peace, and admit us into Paradise, the Abode of Peace. Blessed are You, our Lord, and Exalted are You, O Possessor of Majesty and Honour. O Allah, I ask You to forgive me, to have mercy upon me, to pardon my faults, and to relieve me of my burden, by Your mercy, O Most Merciful of those who show mercy.\n",
        "translationMy": "Ya Allah, ampunilah dosaku dan bukakanlah bagiku pintu-pintu rahmatMu, dan masukkanlah aku dalam rahmatMu, dan permudahkanlah bagiku pintu rezekiMu. Ya Allah, sesungguhnya tempat ini adalah tempat suciMu, dan tempat keamanan yang Engkau sediakan. Maka haramkanlah dagingku, kulitku dan tulangku dari api neraka. Ya Allah, Engkaulah keselamatan, daripadaMulah keselamatan dan masukkanlah kami di dalam syurga tempat keselamatan, Maha banyak keberkatanMu, Ya Tuhan yang mempunyai Kebesaran dan Kemuliaan. Ya Allah, aku bermohon kepadaMu agar Engkau mengampuni dosaku dan menghapuskan kesalahanku dan meletakkan beban yang memberatiku dengan rahmatMu. Ya Tuhan yang Maha Penyayang."
      }
    ],
    "categoryKey": [
      "masjidil haram"
    ],
    "audio": "doa_memasuki_masjidil_haram.mp3"
  },
  {
    "id": 10,
    "titleEn": "Intention For I'tikaf",
    "titleMy": "Niat I'tikaf Masjid",
    "doa": [
      {
        "id": 1,
        "arabic": "نَذَرتُ الإِعتِكَافَ فِي هَذَا الْمَسْجِدِ مَا دُمْتُ فِيهِ لِلَّهِ تَعَالَى",
        "translationEn": "I intend to perform I'tikaf in this blessed mosque for the sake of AIIah Most High",
        "translationMy": "Sahaja aku beri'tikaf di masjid ini kerana AIIah Taala"
      }
    ],
    "categoryKey": [
      "masjidil haram"
    ],
    "audio": "doa_iktikaf.mp3"
  },
  {
    "id": 11,
    "titleEn": "Upon Seeing The Ka'abah",
    "titleMy": "Ketika Melihat Ka'abah",
    "doa": [
      {
        "id": 1,
        "arabic": "اَللّٰهُمَّ زِدْ هَذَا الْبَيْتَ تَشْرِيْفًا وَتَعْظِيمًا وَتَكْرِيمًا وَمَهَابَةً، وَزِدْ مَنْ شَرَّفَهُ وَعَظَّمَهُ\nمِمَّنْ حَجَّهُ أَوِ اعْتَمَرَهُ تَشْرِيْفًا، وَتَكرِيمًا، وَتَعْظِيمًا وَبِرًّا",
        "translationEn": "O Allah, increase this House in honour, greatness, nobility, and reverence. And increase those who honour it and revere it, among those who perform haj or umrah to it in honour, nobility, greatness, and righteousness.",
        "translationMy": "Ya Allah, tambahkanlah kemuliaan rumah ini, kebesaran dan kehebatannya. Dan tambahkanlah kemuliaan, kebesaran dan kebaikan kepada orang yang mengunjunginya kerana membuat haji dan umrah."
      }
    ],
    "categoryKey": [
      "masjidil haram"
    ],
    "audio": "doa_ketika_melihat_kaabah.mp3"
  },
  {
    "id": 12,
    "titleEn": "Before Tawaf",
    "titleMy": "Sebelum Memulakan Tawaf",
    "doa": [
      {
        "id": 1,
        "arabic": "اَللّٰهُمَّ إِنِّي أُرِيدُ طَوَافَ بَيتِكَ الحَرَامِ فَيَسِّرهُ لِي وَ تَقَبَّلهُ مِنِّي",
        "translationEn": "O Allah, I am about to perform tawaf around Your holy house, so give me ease and accept it from me.",
        "translationMy": "Ya Allah, sesungguhnya aku hendak mengerjakan tawaf mengelilingi rumahMu yang suci, maka berikanlah aku kemudahan dan terimalah ia daripadaku."
      }
    ],
    "categoryKey": [
      "tawaf"
    ],
    "audio": "doa_sebelum_memulakan_tawaf.mp3"
  },
  {
    "id": 13,
    "titleEn": "Tawaf Qudum Intention",
    "titleMy": "Niat Tawaf Qudum",
    "doa": [
      {
        "id": 1,
        "arabic": "نَوَيْتُ أَن أَطُوفَ طَوَافَ القُدُومِ سَبعَةَ أَشوَاطٍ لِلّٰهِ تَعَالَى",
        "translationEn": "I intend to perform the arrival tawaf, seven rounds for the sake of Allah Most High",
        "translationMy": "Sahaja aku berniat mengerjakan tawaf qudum tujuh pusingan kerana Allah Taala"
      }
    ],
    "categoryKey": [
      "niat",
      "tawaf"
    ],
    "audio": "niat_tawaf_qudum.mp3"
  },
  {
    "id": 14,
    "titleEn": "Tawaf Haj Intention",
    "titleMy": "Niat Tawaf Haji",
    "doa": [
      {
        "id": 1,
        "arabic": "نَوَيْتُ أَن أَطُوفَ طَوَافَ الحَجِّ سَبعَةَ أَشوَاطٍ لِلّٰهِ تَعَالَى",
        "translationEn": "I intend to perform the haj tawaf, seven rounds for the sake of Allah Most High",
        "translationMy": "Sahaja aku berniat mengerjakan tawaf haji tujuh pusingan kerana Allah Taala"
      }
    ],
    "categoryKey": [
      "niat",
      "tawaf"
    ],
    "audio": "niat_tawaf_haji.mp3"
  },
  {
    "id": 15,
    "titleEn": "Tawaf Umrah Intention",
    "titleMy": "Niat Tawaf Umrah",
    "doa": [
      {
        "id": 1,
        "arabic": "نَوَيْتُ أَن أَطُوفَ طَوَافَ العُمرَةِ سَبعَةَ أَشوَاطٍ لِلّٰهِ تَعَالَى",
        "translationEn": "I intend to perform the umrah tawaf, seven rounds for the sake of Allah Most High",
        "translationMy": "Sahaja aku berniat mengerjakan tawaf umrah tujuh pusingan kerana Allah Taala"
      }
    ],
    "categoryKey": [
      "niat",
      "tawaf"
    ],
    "audio": "niat_tawaf_umrah.mp3"
  },
  {
    "id": 16,
    "titleEn": "Tawaf Sunnah Intention ",
    "titleMy": "Niat Tawaf Sunnah",
    "doa": [
      {
        "id": 1,
        "arabic": "نَوَيْتُ أَن أَطُوفَ طَوَافَ السُّنَّةِ سَبعَةَ أَشوَاطٍ لِلّٰهِ تَعَالَى",
        "translationEn": "I intend to perform the sunnah tawaf, seven rounds for the sake of Allah Most High",
        "translationMy": "Sahaja aku berniat mengerjakan tawaf sunnah tujuh pusingan kerana Allah Taala"
      }
    ],
    "categoryKey": [
      "niat",
      "tawaf"
    ],
    "audio": "niat_tawaf_sunnah.mp3"
  },
  {
    "id": 18,
    "titleEn": "(1st) Round Of Tawaf",
    "titleMy": "(Ke-1) Tawaf Pusingan Pertama",
    "doa": [
      {
        "id": 1,
        "arabic": "سُبْحَانَ اللهِ وَالْحَمْدُ لِلَّهِ وَلَا إِلٰهَ إِلَّا اللهُ وَ اللهُ أَكْبَرُ\nوَلَا حَوْلَ وَلَا قُوَّةَ إِلَّا باللهِ الْعَلِيِّ الْعَظِيْمِ\nوَالصَّلَاةُ وَالسَّلاَمُ عَلَى رَسُولِ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ\nاَللَّهُمَّ إِيْمَانًا بِكَ وَتَصدِيْقًا بِكِتَابِكَ وَوَفَاءًا بِعَهدِك وَاتِّبَاعًا لِسُنَّةِ\nنَبِيِّكَ وَ حَبِيبِكَ مُحَمَّدٍ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ\nاَللَّهُمَّ إِنِّي أَسْئَلُكَ الْعَفْوَى وَالْعَافِيَةَ وَالْمُعَافَاةَ الدَّائِمَةَ\nفِي الدِّيْنِ وَالدُّنْيَا وَالْأَخِرَةِ وَالْفَوْزَ بِالْجَنَّةِ وَالنَّجَاةَ مِنَ النَّارِ",
        "translationEn": "Glory be to Allah and all praise be to Him. There is no God but Allah. Allah is Great, and there is no power, except by the permission of Allah the Most High and the Exalted. Peace and blessings be upon the Messenger of Allah s.a.w. O Allah, (I come) believing in You, believing in Your Book, and being faithful to Your Promises, and following the sunnah of Your Prophet, and Your beloved Muhammad s.a.w., I perform this deed. O Allah, I ask for forgiveness, health and well-being in religion, in this world and in the hereafter, to obtain victory and paradise and salvation from the Hellfire.",
        "translationMy": "Maha Suci Allah dan segala puji bagiNya. Tiada Tuhan kecuali Allah. Allah Maha Besar, dan tidak ada suatu kekuatan, kecuali dengan izin Allah Yang Maha Tinggi dan Maha Agung. Selawat dan salam bagi Rasulullah s.a.w. Ya Allah, kerana iman kepadaMu, dan kerana meyakini kitabMu, serta setia kepada janjiMu, dan mengikuti sunnah NabiMu, dan kekasihMu Muhammad s.a.w., aku melakukan amalan ini. Ya Allah sesungguhnya aku mohon keampunan, kesihatan dan kesejahteraan terus menerus di dalam beragama, di dunia dan di akhirat, memperoleh kemenangan dan syurga serta terhindar dari neraka."
      }
    ],
    "categoryKey": [
      "tawaf"
    ],
    "audio": "doa_tawaf_pusingan_pertama.mp3"
  },
  {
    "id": 19,
    "titleEn": "From Rukun Yamani To Hajar Aswad",
    "titleMy": "Dari Rukun Yamani Hingga Hajar Aswad",
    "doa": [
      {
        "id": 1,
        "arabic": "اَللَّهُمَّ رَبَّنَا آتِنَا فِي الدُّنْيَا حَسَنَةً وَفِي الآخِرَةِ حَسَنَةً وَقِنَا عَذَابَ النَّارِ\nوَ أَدخِلنَا الجَنَّةَ مَعَ الأَبرَارِ يَا عَزِيزُ يَا غَفَّارُ يَا رَبَّ العَالَمِينَ",
        "translationEn": "O Allah, O our Lord, give us good in this world and good in the Hereafter, and save us from the punishment of Hell, and admit us into Paradise with those who do righteous deeds. O Almighty, O Most Forgiving, O Lord of the universe.",
        "translationMy": "Ya Allah Ya Tuhan kami, berilah kami kebaikan di dunia dan kebaikan di akhirat, serta selamatkanlah kami dari azab neraka, dan masukkanlah kami ke dalam syurga bersama orang-orang yang berbuat kebajikan. Ya Tuhan yang Maha Mulia Iagi Maha Pengampun, Ya Tuhan alam semesta."
      }
    ],
    "categoryKey": [
      "tawaf"
    ],
    "audio": "doa_dari_rukun_yamani_hingga_hajar_aswad.mp3"
  },
  {
    "id": 20,
    "titleEn": "(2nd) Round Of Tawaf",
    "titleMy": "(Ke-2) Tawaf Pusingan Kedua",
    "doa": [
      {
        "id": 1,
        "arabic": "اَللَّهُمَّ إِنَّ هَذَا الْبَيْتَ بَيْتُكَ وَالْحَرَمَ حَرَمُكَ وَالْأَمْنَ أَمْنُكَ وَالْعَبْدَ عَبْدُكَ\nوَأَنَا عَبْدُكَ وَابْنُ عَبْدِكَ وَهَذَا مَقَامُ العَائِذِ بِكَ مِنَ النَّارِ\nفَحَرِّمْ لُحُومَنَا وَبَشَرَتَنَا عَلَى النَّارِ\nاَللَّهُمَّ حَبِّبْ إِلَيْنَا الْإيْمَانَ وَزَيِّنْهُ فِي قَلُوبِنَا وَكَرِّهْ إِلَيْنَا الْكُفْرَ وَالْفُسُوقَ\nوَالْعِصْيَانَ وَاجْعَلْنَا مِنَ الرَّاشِدِينَ اللَّهُمَّ قِنِي عَذَابَكَ يَوْمَ تَبْعَثُ عِبَادَكَ\nاَللَّهُمَّ ارْزُقْنَا الْجَنَّةَ بِغَيْرِ حِسَابِ",
        "translationEn": "O Allah, this house is Your House, and this sacred precinct is Your Sacred Precinct, this land of peace is Your Land of Peace, this servant is Your servant, and the son of Your Servant, and this place is a place where people take refuge in You from the torment of Hell, so keep our flesh and skin away from the fire of Hell. O Allah, make our hearts lovers of faith, adorn our hearts with it (faith), and make disbelief, wickedness, and disobedience hateful to us and make us among those who are rightly guided. O Allah, protect us from Your punishment on the day You raise up Your servants. O Allah, grant us paradise without reckoning.",
        "translationMy": "Ya Allah, sesungguhnya rumah ini adalah rumahMu, dan tanah haram ini adalah tanah haramMu, negeri aman ini adalah negeriMu, hamba ini adalah hambaMu, dan anak dari hambaMu, dan tempat ini adalah tempat orang berlindung padaMu dari seksa neraka, maka jauhkanlah daging dan kulit kami dari api neraka. Ya Allah, jadikanlah hati kami pencinta keimanan, hiasilah hati kami dengannya (iman), dan jadikanlah kami benci dengan kekafiran, kefasikan dan kemaksiatan, serta jadikanlah kami di antara orang yang mendapat petunjuk. Ya Allah, lindungilah kami dari azabMu pada hari Engkau membangkitkan hamba-hambaMu. Ya Allah, anugerahilah kami syurga tanpa perhitungan."
      }
    ],
    "categoryKey": [
      "tawaf"
    ],
    "audio": "doa_tawaf_pusingan_kedua.mp3"
  },
  {
    "id": 21,
    "titleEn": "From Rukun Yamani To Hajar Aswad",
    "titleMy": "Dari Rukun Yamani Hingga Hajar Aswad",
    "doa": [
      {
        "id": 1,
        "arabic": "اَللَّهُمَّ رَبَّنَا آتِنَا فِي الدُّنْيَا حَسَنَةً وَفِي الآخِرَةِ حَسَنَةً وَقِنَا عَذَابَ النَّارِ\nوَ أَدخِلنَا الجَنَّةَ مَعَ الأَبرَارِ يَا عَزِيزُ يَا غَفَّارُ يَا رَبَّ العَالَمِينََ",
        "translationEn": "O Allah, O our Lord, give us good in this world and good in the Hereafter, and save us from the punishment of Hell, and admit us into Paradise with those who do righteous deeds. O Almighty, O Most Forgiving, O Lord of the universe.",
        "translationMy": "Ya Allah Ya Tuhan kami, berilah kami kebaikan di dunia dan kebaikan di akhirat, serta selamatkanlah kami dari azab neraka, dan masukkanlah kami ke dalam syurga bersama orang-orang yang berbuat kebajikan. Ya Tuhan yang Maha Mulia Iagi Maha Pengampun, Ya Tuhan alam semesta. "
      }
    ],
    "categoryKey": [
      "tawaf"
    ],
    "audio": "doa_dari_rukun_yamani_hingga_hajar_aswad.mp3"
  },
  {
    "id": 22,
    "titleEn": "(3rd) Round Of Tawaf",
    "titleMy": "(Ke-3) Tawaf Pusingan Ketiga",
    "doa": [
      {
        "id": 1,
        "arabic": "اَللّٰهُمَّ إِنِّي أَعُوذُ بِكَ مِن الشَّكِّ وَالشِرْكِ وَالشِّقَاقِ وَالنِّفَاقِ\nوَسُوءِ الأَخْلاَقِ وَسُوءِ المَنْظَرِ وَالمُنقَلَبِ فِي المَالِ وَالأَهْلِ وَالوَلَدِ\nاَللَّهُمَّ إِنِّي أَسْأَلُكَ رِضَاكَ وَالجَنَّةَ وَأَعُوذُبِكَ مِن سَخَطِكَ وَالنَّارِ\nاَللَّهُمَّ إِنِّي أَعُوذُبِكَ مِنْ فِتْنَةِ القَبرِ وَأَعُوذُ بِكَ مِن فِتْنَةِ المَحْيَا وَالمَمَاتِ",
        "translationEn": "O Allah, I take refuge in You from doubt, shirk, division, hypocrisy, bad character, bad outlook, and wrong dealings in wealth, family and children. O Allah, I ask You for Your Pleasure and for Paradise and I seek refuge in You from Your Wrath and from the fire. O Allah, I seek refuge in You from the trials of the grave and I seek refuge in You from the trials of life and death.",
        "translationMy": "Ya Allah, sesungguhnya aku berlindung kepadaMu dari kebimbangan, kesyirikan, perpecahan, kemunafikan, keburukan akhlak, keburukan pandangan, dan kesalahan urusan dalam harta, keluarga dan anak-anak. Ya Allah, aku mohon redaMu dan syurga serta mohon perlindungan terhadap kemarahanMu dan neraka. Ya Allah, aku mohon dilindungi dari fitnah kubur dan mohon dilindungi dari berbagai godaan kehidupan dan kematian."
      }
    ],
    "categoryKey": [
      "tawaf"
    ],
    "audio": "doa_tawaf_pusingan_ketiga.mp3"
  },
  {
    "id": 23,
    "titleEn": "From Rukun Yamani To Hajar Aswad",
    "titleMy": "Dari Rukun Yamani Hingga Hajar Aswad",
    "doa": [
      {
        "id": 1,
        "arabic": "اَللّٰهُمَّ رَبَّنَا آتِنَا فِي الدُّنْيَا حَسَنَةً وَفِي الآخِرَةِ حَسَنَةً وَقِنَا عَذَابَ النَّارِ\nوَ أَدخِلنَا الجَنَّةَ مَعَ الأَبرَارِ يَا عَزِيزُ يَا غَفَّارُ يَا رَبَّ العَالَمِينَ",
        "translationEn": "O Allah, O our Lord, give us good in this world and good in the Hereafter, and save us from the punishment of Hell, and admit us into Paradise with those who do righteous deeds. O Almighty, O Most Forgiving, O Lord of the universe.",
        "translationMy": "Ya Allah Ya Tuhan kami, berilah kami kebaikan di dunia dan kebaikan di akhirat, serta selamatkanlah kami dari azab neraka, dan masukkanlah kami ke dalam syurga bersama orang-orang yang berbuat kebajikan. Ya Tuhan yang Maha Mulia Iagi Maha Pengampun, Ya Tuhan alam semesta. "
      }
    ],
    "categoryKey": [
      "tawaf"
    ],
    "audio": "doa_dari_rukun_yamani_hingga_hajar_aswad.mp3"
  },
  {
    "id": 24,
    "titleEn": "(4th) Round Of Tawaf",
    "titleMy": "(Ke-4) Tawaf Pusingan Keempat",
    "doa": [
      {
        "id": 1,
        "arabic": "اَللّٰهُمَّ اجْعَلْنِي حَجًّا مَبْرُورًا وَسَعْياً مَشْكُورًا وَذَنباً مَغْفُورًا وَعَمَلًا صَالِحًا مَقْبُولًا\nوَتِجَارَةً لَنْ تَبُورَ، يَا عَالِمَ مَا فِي الصُّدُورِ أَخْرِجْنِي  يَا اَللهُ مِنَ الظُّلُمَاتِ\n إِلَى النُّورِ، اَللّٰهُمَّ إِنِّي أَسْأَلُكَ مُوجِبَاتِ رَحْمَتِكَ وَعَزَائِمَ مَغْفِرَتِكَ\nوَالسَّلاَمَةَ مِن كُلِّ إِثْمٍ والغَنِيمَةَ مِن كُلِّ بِرٍّ والفَوْزَ بِالجَنَّةِ وَ النَّجَاةَ مِنَ النَّارِ\nرَبِّي قَنِّعْنِي بِمَا رَزَقتَنِي وَبَارِكْ لِي فِيمَا أَعْطَيْتَنِي\nوَاخْلُفْ عَلَيَّ كُلَّ غَائِبَةٍ لِي مِنْكَ بِخَيْرٍ",
        "translationEn": "O Allah, grant me an accepted haj, an accepted sai'e, sins that are forgiven, righteous deeds that are accepted, and trade that will never perish. O Knower of what is within the hearts, bring me out, O Allah, from darkness into light. O Allah, I ask You for the means that bring about Your mercy and the firm resolve that leads to Your forgiveness, for safety from every sin, to obtain all goodness, success in attaining Paradise, and salvation from the Fire. O my Lord, make me content with what You have provided for me and bless all that You have given me, and replace all that I have lost with goodness from Your side.",
        "translationMy": "Ya Allah, jadikanlah hajiku haji yang mabrur, sai yang diterima, dosa yang terampun, amal soleh yang diterima, serta perniagaan yang tidak merugikan. Wahai Tuhan Yang Maha Mengetahui apa-apa tersimpan di dalam dada, Ya Allah, keluarkanlah aku dari kegelapan kepada cahaya terang. Ya Allah, aku mohon maaf padaMu segala hal yang mendatangkan rahmatMu, semua yang membawa kepada keampunan, terjauh dari segala dosa, memperoleh segala kebaikan, dan berjaya memasuki syurga serta terlepas dari neraka. Ya Tuhanku tenteramkan hatiku dengan rezeki yang Engkau beri dan berkatilah segala yang Engkau telah kurniakan kepadaku, dan gantilah segala yang terluput dariku dengan kebaikan dari sisiMu."
      }
    ],
    "categoryKey": [
      "tawaf"
    ],
    "audio": "doa_tawaf_pusingan_keempat.mp3"
  },
  {
    "id": 25,
    "titleEn": "From Rukun Yamani To Hajar Aswad",
    "titleMy": "Dari Rukun Yamani Hingga Hajar Aswad",
    "doa": [
      {
        "id": 1,
        "arabic": "اَللّٰهُمَّ رَبَّنَا آتِنَا فِي الدُّنْيَا حَسَنَةً وَفِي الآخِرَةِ حَسَنَةً وَقِنَا عَذَابَ النَّارِ\nوَ أَدخِلنَا الجَنَّةَ مَعَ الأَبرَارِ يَا عَزِيزُ يَا غَفَّارُ يَا رَبَّ العَالَمِينََ",
        "translationEn": "O Allah, O our Lord, give us good in this world and good in the Hereafter, and save us from the punishment of Hell, and admit us into Paradise with those who do righteous deeds. O Almighty, O Most Forgiving, O Lord of the universe.",
        "translationMy": "Ya Allah Ya Tuhan kami, berilah kami kebaikan di dunia dan kebaikan di akhirat, serta selamatkanlah kami dari azab neraka, dan masukkanlah kami ke dalam syurga bersama orang-orang yang berbuat kebajikan. Ya Tuhan yang Maha Mulia Iagi Maha Pengampun, Ya Tuhan alam semesta. "
      }
    ],
    "categoryKey": [
      "tawaf"
    ],
    "audio": "doa_dari_rukun_yamani_hingga_hajar_aswad.mp3"
  },
  {
    "id": 26,
    "titleEn": "(5th) Round Of Tawaf",
    "titleMy": "(Ke-5) Tawaf Pusingan Kelima",
    "doa": [
      {
        "id": 1,
        "arabic": "اَللَّهُمَّ أَظِلَّنِي تَحْتَ ظِلِّ عَرْشِكَ يَوْمَ لَا ظِلَّ إِلَّا ظِلُّكَ وَلَا بَاقِيَ إِلَّا وَجْهُكَ\nوَاسْقِنِي مِنْ حَوْضِ نَبِيِّكَ مُحَمَّدٍ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ شَرْبَةً هَنِيئَةً مَرِيئَةً\nلَا أَظمَؤُ بَعْدَهَا أَبَدًا، اَللَّهُمَّ إِنِّي أَسْأَلُكَ مِنْ خَيْرِ مَا سَأَلَكَ مِنهُ\nنَبِيُّكَ مُحَمَّدٌ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ \nوَأَعُوذُبِكَ مِنْ شَرِّ مَا استَعَاذَكَ مِنْهُ نَبِيُّكَ مُحَمَّدٌ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ\nاَللّٰهُمَّ إِنِّي أَسْأَلُكَ الجَنَّةَ وَنَعِيمَهَا وَمَا يُقَرِّبُنِي إِلَيْهَا مِنْ قَوْلٍ أَوْ فِعْلٍ أَوْ عَمَلٍ\nوَأَعُوذُبِكَ مِنَ النَّارِ وَمَا يُقَرِّبُنِي إِلَيْهَا مِنْ قَوْلٍ أَوْ فِعْلٍ أَوْ عَمَلٍ",
        "translationEn": "O Allah, protect me under Your Shade on the day when there is no shade except Your Shade, and there is nothing left but Your Countenance, give me a drink from the well of the Prophet Muhammad s.a.w., a delicious and refreshing drink, after which I will never feel thirst again. O Allah, I ask You for the best that Your Prophet, Muhammad s.a.w. has ever asked for. And I seek refuge in You from the evil of that from which Your Prophet Muhammad s.a.w. sought refuge from. O Allah, I ask You for Paradise with all its pleasures and all that brings me closer to it, whether in word, deed or action. And I ask You for protection from the fire and everything that brings me closer to it, in word, deed or action.",
        "translationMy": "Ya Allah, lindungilah aku di bawah naunganMu pada hari yang tiada naungan kecuali naunganMu, dan tiada yang tinggal kecuali wajahMu, berilah aku minum dari telaga Nabi Muhammad s.a.w., minuman yang lazat yang menyegarkan, yang sesudahnya aku tidak akan pernah haus Iagi. Ya Allah, aku mohon kepadaMu dari apa yang terbaik yang pernah diminta oleh NabiMu, Muhammad s.a.w.  Dan aku berlindung kepadaMu dari kejahatan sebagaimana perlindungan yang dimohon oleh Nabi Muhammad s.a.w. Ya Allah, aku mohon kepadaMu syurga dengan segala kenikmatannya dan segala yang mendekatkan aku kepadanya, baik perkataan, perbuatan ataupun tindakan. Dan aku mohon perlindungan kepadaMu dari neraka dan segala yang mendekatkan aku kepadanya, baik perkataan, perbuatan atau tindakan."
      }
    ],
    "categoryKey": [
      "tawaf"
    ],
    "audio": "doa_tawaf_pusingan_kelima.mp3"
  },
  {
    "id": 27,
    "titleEn": "From Rukun Yamani To Hajar Aswad",
    "titleMy": "Dari Rukun Yamani Hingga Hajar Aswad",
    "doa": [
      {
        "id": 1,
        "arabic": "اَللّٰهُمَّ رَبَّنَا آتِنَا فِي الدُّنْيَا حَسَنَةً وَفِي الآخِرَةِ حَسَنَةً وَقِنَا عَذَابَ النَّارِ\nوَ أَدخِلنَا الجَنَّةَ مَعَ الأَبرَارِ يَا عَزِيزُ يَا غَفَّارُ يَا رَبَّ العَالَمِينََ",
        "translationEn": "O Allah, O our Lord, give us good in this world and good in the Hereafter, and save us from the punishment of Hell, and admit us into Paradise with those who do righteous deeds. O Almighty, O Most Forgiving, O Lord of the universe.",
        "translationMy": "Ya Allah Ya Tuhan kami, berilah kami kebaikan di dunia dan kebaikan di akhirat, serta selamatkanlah kami dari azab neraka, dan masukkanlah kami ke dalam syurga bersama orang-orang yang berbuat kebajikan. Ya Tuhan yang Maha Mulia Iagi Maha Pengampun, Ya Tuhan alam semesta. "
      }
    ],
    "categoryKey": [
      "tawaf"
    ],
    "audio": "doa_dari_rukun_yamani_hingga_hajar_aswad.mp3"
  },
  {
    "id": 28,
    "titleEn": "(6th) Round Of Tawaf",
    "titleMy": "(Ke-6) Tawaf Pusingan Keenam",
    "doa": [
      {
        "id": 1,
        "arabic": "اَللّٰهُمَّ إِنَّ لَكَ عَلَيَّ حُقُوقًا كَثِيرَةً فِيمَا بَيْنِي وَبَيْنَكَ وَحُقُوقًا كَثِيرَةً فِيمَا بَيْنِي\nوَبَيْنَ خَلْقِكَ ، اَللّٰهُمَّ مَا كَانَ لَكَ مِنْهُ فَاغْفِرْهُ لِي وَمَا كَانَ لِخَلْقِكَ\nفَتَحَمَّلهُ عَنِّي وَأَغْنِنِي بِحَلَالِكَ عَنْ حَرَامِكَ وَبِطَاعَتِكَ عنْ مَعْصِيَتِكَ\nوَبِفَضْلِكَ عَمَّنْ سِوَاكَ يَا وَاسِعَ المَغْفِرَةِ، اَللّٰهُمَّ إِنَّ بَيْتَكَ عَظِيم\n وَوَجْهَكَ كَرِيْمٌ، وَأَنْتَ يَا اللَّهُ، حَلِيمٌ كَرِيمٌ عَظِيمٌ تُحِبُّ العَفْوَ فَاعْفُ عَنِّي",
        "translationEn": "O Allah, indeed You have many rights over me in what lies between me and You, and many rights in what lies between me and Your Creation. O Allah, whatever of these rights belongs to You, forgive it for me and whatever belongs to Your Creation, then set me free from it. Satisfy me with the lawful sustenance from You so that I have no need of what is unlawful. Grant me obedience to You and keep me from being disobedient to You. Suffice Your Gifts for me, so that I do not need anything else, O Lord of the Most Abundant Forgiveness. Allah, indeed Your House is magnificent, Your Face is noble, and You, O Allah, are Forbearing, Generous, and Great. You love to pardon so pardon me. ",
        "translationMy": "Ya Allah, hakMu sungguh banyak padaku, begitu juga yang berkaitan antara aku dan makhlukMu. Segala hakMu terhadapku, ampunilah aku tentang itu, dan mana yang termasuk hak hambaMu padaku, maka bebaskanlah aku daripadanya. Cukupkan aku dengan rezeki yang halal yang Engkau berikan, terbebas dari yang haram. Kurniakanlah aku ketaatan padaMu dan jauhkanlah aku dari kederhakaan terhadapMu. Cukupkan bagiku kurniaanMu, sehingga aku tidak memerlukan selain itu, wahai Tuhan Yang Maha Luas keampunanMu. Ya Allah, sesungguhnya rumahMu Agung, wajahMu Mulia, dan Engkau Ya Allah Maha Penyayang, Pemurah dan Maha Bijaksana. Engkau menyukai keampunan, ampunilah aku."
      }
    ],
    "categoryKey": [
      "tawaf"
    ],
    "audio": "doa_tawaf_pusingan_keenam.mp3"
  },
  {
    "id": 29,
    "titleEn": "From Rukun Yamani To Hajar Aswad",
    "titleMy": "Dari Rukun Yamani Hingga Hajar Aswad",
    "doa": [
      {
        "id": 1,
        "arabic": "اَللّٰهُمَّ رَبَّنَا آتِنَا فِي الدُّنْيَا حَسَنَةً وَفِي الآخِرَةِ حَسَنَةً وَقِنَا عَذَابَ النَّارِ\nوَ أَدخِلنَا الجَنَّةَ مَعَ الأَبرَارِ يَا عَزِيزُ يَا غَفَّارُ يَا رَبَّ العَالَمِينََ",
        "translationEn": "O Allah, O our Lord, give us good in this world and good in the Hereafter, and save us from the punishment of Hell, and admit us into Paradise with those who do righteous deeds. O Almighty, O Most Forgiving, O Lord of the universe.",
        "translationMy": "Ya Allah Ya Tuhan kami, berilah kami kebaikan di dunia dan kebaikan di akhirat, serta selamatkanlah kami dari azab neraka, dan masukkanlah kami ke dalam syurga bersama orang-orang yang berbuat kebajikan. Ya Tuhan yang Maha Mulia Iagi Maha Pengampun, Ya Tuhan alam semesta. "
      }
    ],
    "categoryKey": [
      "tawaf"
    ],
    "audio": "doa_dari_rukun_yamani_hingga_hajar_aswad.mp3"
  },
  {
    "id": 30,
    "titleEn": "(7th) Round Of Tawaf",
    "titleMy": "(Ke-7) Tawaf Pusingan Ketujuh",
    "doa": [
      {
        "id": 1,
        "arabic": "اَللَّهُمَّ إِنِّي أَسْأَلُكَ إِيْمَاناً كَامِلًا وَيَقِينًا صَادِقًا وَرِزْقًا وَاسِعًا\nوَقَلْبًا خَاشِعًا ولِسَانًا ذَاكِرًا وَحَلَالًا طَيِّبًا وَتَوْبَةً نَصُوحًا\nوَتَوْبَةً قَبْلَ المَوْتِ وَرَاحَةً عِنْدَ المَوتِ وَمَغْفِرَةً وَرَحْمَةً\nبَعْدَ المَوْتِ وَالْعَفْوَ عِنْدَ الحِساَبِ وَالفَوْزَ بِالْجَنَّةِ وَالنَّجَاةَ مِنَ النَّارِ\nبِرَحْمَتِكَ يَا عَزِيْزُ يَا غَفَّارُ رَبِّ زِدنِي عِلمًا وَ اَلحِقنِي بِاْلصَّالِحِينَ",
        "translationEn": "O Allah, O my Lord, I ask for the blessing of perfect faith, true certainty, abundant provision, a sincere heart, a tongue always in remembrance, lawful and wholesome sustenance, true repentance before death, forgiveness and mercy after death, pardon at the time of reckoning, success in attaining Paradise and salvation from the fire, by Your Mercy, O Almighty, O Most Forgiving, O Lord, increase me in knowledge and place me in the company of the righteous.",
        "translationMy": "Ya Allah Ya Tuhanku, sesungguhnya aku memohon dikurniakan iman yang sempurna, keyakinan yang sebenar-benarnya, rezeki yang Iuas, hati yang khusyuk, Iidah yang sentiasa berziki, dan perkara halal yang baik, taubat yang sebenar sebelum mati, keampunan dan rahmat sesudah mati, kemaafan ketika dihisabkan amalan, kejayaan dengan mendapat syurga dan keselamatan daripada neraka, dengan belas kasihan Engkau Ya Tuhan yang Maha Kuasa Iagi Maha Pengampun, Ya Tuhan, tambahkan ilmu pengetahuan kepadaku dan masukkan daku ke dalam golongan orang-orang yang soleh."
      }
    ],
    "categoryKey": [
      "tawaf"
    ],
    "audio": "doa_tawaf_pusingan_ketujuh.mp3"
  },
  {
    "id": 31,
    "titleEn": "From Rukun Yamani To Hajar Aswad",
    "titleMy": "Dari Rukun Yamani Hingga Hajar Aswad",
    "doa": [
      {
        "id": 1,
        "arabic": "اَللّٰهُمَّ رَبَّنَا آتِنَا فِي الدُّنْيَا حَسَنَةً وَفِي الآخِرَةِ حَسَنَةً وَقِنَا عَذَابَ النَّارِ\nوَ أَدخِلنَا الجَنَّةَ مَعَ الأَبرَارِ يَا عَزِيزُ يَا غَفَّارُ يَا رَبَّ العَالَمِينََ",
        "translationEn": "O Allah, O our Lord, give us good in this world and good in the Hereafter, and save us from the punishment of Hell, and admit us into Paradise with those who do righteous deeds. O Almighty, O Most Forgiving, O Lord of the universe.",
        "translationMy": "Ya Allah Ya Tuhan kami, berilah kami kebaikan di dunia dan kebaikan di akhirat, serta selamatkanlah kami dari azab neraka, dan masukkanlah kami ke dalam syurga bersama orang-orang yang berbuat kebajikan. Ya Tuhan yang Maha Mulia Iagi Maha Pengampun, Ya Tuhan alam semesta. "
      }
    ],
    "categoryKey": [
      "tawaf"
    ],
    "audio": "doa_dari_rukun_yamani_hingga_hajar_aswad.mp3"
  },
  {
    "id": 32,
    "titleEn": "Sunnah Prayer After Tawaf Intention",
    "titleMy": "Niat Solat Sunnah Tawaf",
    "doa": [
      {
        "id": 1,
        "arabic": "اُصَلِّي سُنَّةَ الطَّوَافِ رَكْعَتَيْنِ لِلّٰهِ تَعَالٰى",
        "translationEn": "I intend to pray two raka'at of sunnah Tawaf for the sake of Allah Most High",
        "translationMy": "Sahaja aku solat sunat tawaf dua rakaat kerana Allah Taala"
      }
    ],
    "categoryKey": [
      "tawaf"
    ],
    "audio": "niat_solat_sunnat_tawaf.mp3"
  },
  {
    "id": 33,
    "titleEn": "After Tawaf Prayer",
    "titleMy": "Setelah Solat Sunnah Tawaf",
    "doa": [
      {
        "id": 1,
        "arabic": "اللَّهُمَّ إِنَّ هَذَا بَلَدُكَ الْحَرَامُ، وَمَسْجِدُكَ الْحَرَامُ، وَبَيْتُكَ الْحَرَامُ وَأَنَا عَبْدُكَ\nوَابْنُ عَبْدِكَ وَابْنُ أَمَتِكَ أَتَيْتُكَ بِذُنُوْبٍ كَثِيرَةٍ وَخَطَايَا جَمَّةٍ وَأَعْمَالٍ سَيِّئَةٍ\nوَهَذَا مَقَامُ الْعَائِذِ بِكَ مِنَ النَّارِ، اَللّٰهُمَّ عَافِنَا وَاعْفُ عَنَّا وَاغْفِرْ لَنَا\nإِنَّكَ أَنْتَ الْغَفُوْرُ الرَّحِيمُ، اَللّٰهُمَّ إِنَّكَ دَعَوْتَ عِبَادَكَ إِلَى بَيْتِكَ الْحَرَامِ\nوَقَدْ جِئْتُ طَالِبًا مَرْضَاتِكَ وَأَنْتَ مَنَنْتَ عَلَىَّ فَاغْفِرْ لِي وَارْحَمْنِي\nوَعَافِنِي وَاعْفُ عَنِّي إِنَّكَ عَلَى كُلِّ شَيْءٍ قَدِيرٌ، اَللّٰهُمَّ يَسِّرْلِيَ الْيُسْرَى\nوَجَنِّبْنِيَ الْعُسْرَى، وَاغْفِرْ لِي فِي الْآخِرَةِ وَالأُولَى، اَللّٰهُمَّ اعْصِمْنِي بِأَلطَافِكَ وَاجْعَلْنِي مِمَّنْ يُحِبُّكَ وَيُحِبُّ مَلَائِكَتَكَ وَرُسُلَكَ وَأَنْبِيَائَكَ وَعِبَادَكَ الصَّالِحِيْنَ\nوَأَوْلِيَائَكَ الْمُتَّقِينَ، اَللّٰهُمَّ كَمَا هَدَيْتَنِي لِلْإِسْلَامِ فَثَبِّتنِي عَلَيْهِ \nوَاسْتَعْمِلْنِي فِي طَاعَتِكَ وَطَاعَةِ رَسُوْلِكَ وَأَجِرْنِي مِنْ مُضِلَّاتِ الْفِتَنِ  اَللّٰهُمَّ إِنَّكَ تَعْلَمُ سِرِّي وَعَلَانِيَتِي فَاقْبَلَ مَعْذِرَتِي وَتَعْلَمُ حَاجَتِي \nفَأَعْطِنِي سُؤْلِي وَتَعْلَمُ مَا فِي نَفْسِي فَاغْفِرْ لِي ذَنْبِي\nاَللّٰهُمَّ إِنِّي أَسْأَلُكَ إِيْمَانًا دَائِمًا يُبَاشِرُ قَلْبِي وَأَسْأَلُكَ يَقِيْنًا صَادِقًا \nحَتَّى أَعْلَمَ أَنَّهُ لَنْ يُصِيبَنِي إِلَّا مَا كَتَبْتَهُ عَلَيَّ، وَرَضِّنِي بِمَا قَسَمْتَهُ لِي\nيَا ذَا الْجَلَالِ وَالْإِكْرَامِ، اَللّٰهُمَّ صَلِّ وَسَلَّمْ عَلَى حَبِيْبِكَ سَيِّدِنَا مُحَمَّدٍ\nوَعَلَى جَمِيعِ الْأَنْبِيَاءِ وَالْمُرْسَلِيْنَ، وَ آلِ كُلِّ مِنهُم وَ مَن تَبِعَهُم\nبِإِحسَانٍ إِلَى يَومِ الدِّينِ، يَا أَرحَمَ الرَّاحِمِيْنَ",
        "translationEn": "O Allah, indeed this is Your Sacred Land, Your Sacred Mosque, Your Sacred House, I am Your servant and the son of Your servant, I have come with many sins and many mistakes and bad deeds and this is the place for the servant who takes refuge with You from the fire of Hell. O Allah, grant us wellbeing, pardon us, and forgive us. Indeed, You are the All-Forgiving, the Most Merciful. O Allah, indeed You called Your servants to Your Sacred House, and I have come seeking Your Pleasure. You have shown favour to me, so forgive me, have mercy upon me, grant me well-being, and pardon me. Indeed, You are capable of all things. O Allah, give me ease and keep me from hardship, forgive me in the Hereafter and in this world. O Allah, protect me through Your Subtle Kindness and make me of those who love You, love Your angels, Your messengers, Your prophets, Your righteous servants and Your saints. O Allah, just as You have guided me to Islam, keep me firm upon it, direct me to Your obedience, obedience to Your Messenger and grant me refuge from misleading trials. O Allah, You know my secrets and what I reveal, so accept my excuse. You know my need, so grant me what I ask. You know what is within my soul, so forgive my sins. O Allah, I ask You to grant me continuous faith which enters my heart and genuine certainty until I know that nothing will affect me except what You have ordained for me and grant me contentment with what You have decreed for me, O Possessor of Majesty and Honour. O Allah, peace be upon Your beloved Muhammad and upon all the Prophets and Messengers and the families of each of them and whoever follows them until the Day of Judgement. O Most Merciful of the merciful.",
        "translationMy": "Ya Allah, sesungguhnya ini negeriMu yang suci, masjidMu yang suci, rumahMu yang suci, aku adalah hambaMu dan anak kepada hambaMu, telah datang dengan dosa dan banyak kesalahan dan amalan-amalan yang buruk dan inilah tempatnya bagi hamba yang berlindung denganMu dari api neraka. Ya Allah, selamatkanlah kami, ampunilah kami, kasihaniIah kami, sesungguhnya Engkau Maha Pengampun Iagi Maha Penyayang. Ya Allah, bahawasanya Engkau telah memanggil hamba-hambaMu ke rumah suciMu dan sesungguhnya aku telah datang memohon keredaanMu dan Engkau telah memberi kurnia kepadaku. Maka ampunilah aku, kasihanilah aku, afiatkan aku dan maafkan aku, sesungguhnya Engkau berkuasa atas segala sesuatu. Ya Allah, berikanlah aku kemudahan dan jauhkan aku dari kepayahan, ampunilah aku di akhirat dan di dunia. Ya Allah, peliharalah aku dengan sifat kelembutanMu, dan jadikanlah aku dari golongan mereka yang cintakanMu, cintakan malaikat-malaikatMu, rasul-rasulMu, nabi-nabiMu, hamba-hambaMu yang soleh dan wali-waliMu dan orang-orang yang bertakwa. Ya  Allah, sebagaimana  Engkau telah tunjuki aku kepada Islam, maka tetapkanlah aku di dalamnya, arahkanlah aku kepada ketaatanMu, ketaatan rasulMu, mengetahui perkara yang tersembunyi dan terang dariku, maka terimalah keuzuranku. Engkaulah yang mengetahui hajatku maka berilah keinginanku, dan Engkau mengetahui apa yang di dalam diriku, maka ampunilah dosaku. Ya Allah, aku bermohon mendapat keimanan yang sentiasa hidup dalam hatiku dan keyakinan yang benar hingga aku yakin tidak ada sesuatu yang menimpaku melainkan apa yang telah Engkau tuliskan buatku, maka redakanlah aku dengan apa yang Engkau bahagikan untukku ya Tuhan yang mempunyai Kebesaran dan Kemuliaan. Ya Allah, selawatMu atas kekasihMu Muhammad dan atas sekelian Nabi dan Rasul dan keluarga setiap orang dari mereka dan sesiapa yang mengikutnya hingga ke hari kemudian. Ya Allah, yang Maha Pengasih Iagi Maha Penyayang."
      }
    ],
    "categoryKey": [
      "tawaf"
    ],
    "audio": "doa_setelah_solat_sunat_tawaf.mp3"
  },
  {
    "id": 34,
    "titleEn": "Etiquettes of Drinking Zam-Zam",
    "titleMy": "Cara Minum Air Zam-Zam",
    "doa": [
      {
        "id": 1,
        "arabic": "",
        "translationEn": "To drink with good intentions. This is in accordance with the meaning of the words of the Prophet s.a.w. \"The water of Zamzam is for whatever it is drunk for.\",To face the Ka'abah,Mention the name of Allah,Drink with three sips (breaths),Drink to your fill,Praise Allah,Dua",
        "translationMy": [
          "Berniat dengan niat yang baik. Ini sesuai dengan maksud sabda baginda Rasulullah s.a.w. \"Air zamzam adalah untuk sesuatu yang kita minum kerananya\"",
          "Hadapkan muka ke Kaabah",
          "Menyebut nama Allah",
          "Minum dengan tiga tegok(nafas)",
          "Minum dengan sepuas-puasnya (hingga kenyang)",
          "Bersyukur ke hadrat Allah",
          "Berdoa"
        ]
      }
    ],
    "categoryKey": [
      "zam-zam"
    ],
    "audio": ""
  },
  {
    "id": 35,
    "titleEn": "Dua Before Drinking Zam-Zam",
    "titleMy": "Doa Ketika Minum Air Zam-Zam",
    "doa": [
      {
        "id": 1,
        "arabic": "اَللّٰهُمَّ إِنِّي أَسأَلُكَ عِلْمًا نَافِعًا، وَرِزْقًا وَاسِعًا، وَشِفَاءً مِنْ كُلِّ دَاءٍ",
        "translationEn": "O Allah, verily I ask You for beneficial knowledge, and abundant provision, and healing from every illness.",
        "translationMy": "Ya Allah, sesungguhnya aku bermohon kepada Engkau ilmu yang bermanfaat, dan rezeki yang Iuas (banyak), dan sembuh dari segala penyakit."
      }
    ],
    "categoryKey": [
      "zam-zam"
    ],
    "audio": "doa_ketika_minum_air_zamzam.mp3"
  },
  {
    "id": 36,
    "titleEn": "Haj Sa'i Intention",
    "titleMy": "Niat Sa'i Haji",
    "doa": [
      {
        "id": 1,
        "arabic": "نَوَيْتُ أَنْ أَسْعَى مَا بَيْنَ الصَّفَا وَالْمَرْوَةِ سَعْيَ الْحَجِّ سَبْعَةَ أَشْوَاطٍ لِلّٰهِ تَعَالَى",
        "translationEn": "I intend to perform Sai between Safa and Marwah, the sai of haj, seven rounds for the sake of Allah Most High",
        "translationMy": "Sahaja aku berniat sai antara Safa dan Marwah, sai haji, tujuh perjalanan kerana Allah Taala"
      }
    ],
    "categoryKey": [
      "sa'i"
    ],
    "audio": "niat_sai_haji.mp3"
  },
  {
    "id": 37,
    "titleEn": "Umrah Sa'i Intention",
    "titleMy": "Niat Sa'i Umrah",
    "doa": [
      {
        "id": 1,
        "arabic": "نَوَيْتُ أَنْ أَسْعَى مَا بَيْنَ الصَّفَا وَالْمَرْوَةِ سَعْيَ الْعُمرَةِ سَبْعَةَ أَشْوَاطٍ لِلّٰهِ تَعَالَى",
        "translationEn": "I intend to perform sa'i between Safa and Marwah, the sa'i of umrah, seven rounds for the sake of Allah Most High",
        "translationMy": "Sahaja aku berniat sa'i antara Safa dan Marwah, sa'i umrah, tujuh perjalanan kerana Allah Taala"
      }
    ],
    "categoryKey": [
      "sa'i"
    ],
    "audio": "niat_sai_umrah.mp3"
  },
  {
    "id": 38,
    "titleEn": "On Mount Safa While Facing The Ka'abah",
    "titleMy": "Di Atas Bukit Safa Sambil Menghadap Ka'abah",
    "doa": [
      {
        "id": 1,
        "arabic": "بِسْمِ اللهِ الرَّحْمَنِ الرَّحِيْمِ\nأَبْدَأُ بِمَا بَدَأَ اللَّهُ بِهِ وَرَسُولُهُ. إِنَّ الصَّفَا وَالْمَرْوَةَ مِنْ شَعَائِرِ اللَّهِ فَمَنْ حَجَّ الْبَيْتَ\nأَوِ اعْتَمَرَ فَلَا جُنَاحَ عَلَيْهِ  أَنْ يَطَّوَّفَ بِهِمَا وَمَنْ تَطَوَّعَ خَيْرًا فَإِنَّ اللَّهَ شَاكِرٌ عَلَيْمٌ\nاَللهُ أَكْبَرُ، اَللهُ أَكْبَرُ، اَللهُ أَكْبَرُ لَا إِلٰهَ إِلَّا اللهُ، اَللهُ أَكْبَرُ وَلِلّٰهِ الْحَمْدُ\nاَلْحَمْدُ لِلَّهِ عَلَى مَا هَدَانَا، اَلْحَمْدُ لِلَّهِ عَلَى مَا أَوْلَانَا لَا إِلٰهَ إِلَّا اللَّهُ وَحْدَهُ لَا شَرِيكَ لَهُ\nلَهُ الْمُلْكُ وَلَهُ الْحَمْدُ يُحْيِي وَيُمِيْتُ بِيَدِهِ الْخَيْرُ وَ هُوَ عَلَى كُلِّ شَيْءٍ قَدِيرٌ\n لَا إِلٰهَ إِلَّا اللَّهُ وَحْدَهُ صَدَقَ وَعْدَهُ، وَنَصَرَ عَبْدَهُ وَهَزَمَ الأَحْزَابَ وَحْدَهُ\nلَا إِلٰهَ إِلَّا اللهُ وَلَا نَعْبُدُ إِلَّا إِيَّاهُ مُخْلِصِينَ لَهُ الدِّيْنَ وَلَوْكَرِهَ الْكَافِرُوْنَ",
        "translationEn": "In the name of Allah, the Most Merciful, the Most Compassionate. I begin with what has been begun by Allah and His Messenger. Indeed, Ṣafā and Marwah are among the symbols of Allah. So whoever performs haj to the House or performs umrah, there is no blame upon him to walk between them. And whoever does good voluntarily, then indeed, Allah is All-Appreciative, All-Knowing.\nAllah is the Greatest, Allah is the Greatest, Allah is the Greatest, there is no god but Allah. Allah is the Greatest, and to Allah belongs all praise. All praise is for Allah for what He has guided us to, all praise is for Allah for what He has bestowed upon us. There is no god but Allah alone, without partner. To Him belongs sovereignty and to Him belongs all praise. He is the One who gives life and causes death, in His hand is all goodness, and He has power over all things. There is no god but Him, the One. He fulfils His promise, aids His servants, and destroys His enemies. There is no god but Allah. We worship none but Him alone. We devote our religion sincerely to Him even though the disbelievers dislike it.",
        "translationMy": "Dengan nama Allah yang Maha Pengasih, Maha Penyayang. Aku mulai dengan apa yang telah dimulai Allah dan RasulNya. Sesungguhnya Safa dan Marwah adalah sebahagian dari tanda-tanda kebesaran Allah. Barangsiapa yang menunaikan ibadat haji atau umrah ke Baitullah, maka tiada salahnya berjalan (sai) di antara keduanya (Safa dan Marwah). Dan barangsiapa yang berbuat baik dengan sukarela, maka sesungguhnya Allah maha Menerima dan Maha Mengetahui,\nAllah Maha Besar, Allah Maha Besar, Allah Maha Besar, tiada Tuhan melainkan Allah. Segala puji bagi Allah kerana memberi hidayah kepada kami. Segala puji bagi Allah yang Maha Esa tiada sekutu bagiNya. Kekuasaan juga bagiNya dan segala puji bagiNya. Dia yang menghidupkan dan yang Mematikan. Segala kebaikan dalam genggamanNya. Dan Dia amat berkuasa atas segala sesuatu. Tiada Tuhan melainkan Dia yang Maha Esa. Dia telah menunaikan janjiNya, Dia telah menolong hambaNya dan Dia telah memusnahkan kumpulan-kumpulan jahat itu dengan sendiriNya. Tiada Tuhan melainkan Allah. TidakIah kami menyembah akan sesuatu apa pun juga melainkan hanya akan Dia saja. Kami semua ikhlaskan agama untukNya walaupun orang-orang kafir tidak menyukainya."
      }
    ],
    "categoryKey": [
      "sa'i"
    ],
    "audio": "doa_memulakan_sai.mp3"
  },
  {
    "id": 39,
    "titleEn": "(1st) Sa'i (Safa → Marwah)",
    "titleMy": "(Ke-1) Sa'i Pertama (Safa → Marwah)",
    "doa": [
      {
        "id": 1,
        "arabic": "اَللهُ أَكْبَرُ، اَللهُ أَكْبَرُ، اَللهُ أَكْبَرُ كَبِيرًا، وَالْحَمْدُ لِلَّهِ كَثِيرًا، سُبْحَانَ اللهِ الْعَظِيمِ\nوَبِحَمْدِهِ الْكَرِيمِ بُكْرَةً وَأَصِيلًا، وَمِنَ اللَّيْلِ فَاسْجُدْ لَهُ وَسَبِّحْهُ لَيْلًا طَوِيلًا\nلَا إِلٰهَ إِلَّا اللهُ وَحْدَهُ صَدَقَ وَعْدَهُ، وَنَصَرَ عَبْدَهُ، وَهَزَمَ الْأَحْزَابَ وَحْدَهُ\nلَا شَيْءَ قَبْلَهُ وَلَا بَعْدَهُ، يُحْيِي وَيُمِيتُ، وَهُوَحَيٌّ دَائِمًا لَا يَمُوْتُ\nوَلَا يَفُوْتُ أَبَدًا بِيَدِهِ الْخَيْرُ وَإِلَيْهِ الْمَصِيرُ، وَهُوَ عَلَى كُلِّ شَيْءٍ قَدِيرٌ",
        "translationEn": "Allah is the Greatest, Allah is the Greatest, Allah is the Greatest, Allah is the Greatest with all His greatness. All praise is due to Allah. Glorified is Allah, the Most Exalted, with noble praises every morning and evening. And during the night, prostrate to Him and glorify Him. There is no god except Allah alone. He fulfils His promise, aids His servants, and destroys His enemies. There is nothing before Him and nothing after Him. He gives life and causes death. He is the Ever-Living, never dies, and is eternal forever. In His Hands are all goodness, and to Him is the return. And He has Power over all things. \n",
        "translationMy": "Allah Maha Besar, Allah Maha Besar, Allah Maha Besar, Allah Maha Besar dengan segala kebesaranNya. Segala puji bagi Allah. Maha Suci Allah, yang Maha Agung, dengan puji-pujian yang mulia setiap pagi, petang dan malam. Tiada Tuhan kecuali Allah semata. Dia memenuhi janjiNya, menolong hambaNya serta menghancurkan sendiri musuh-musuhNya. Tiada sesuatu, baik yang mendahuluiNya, mahupun sesudahNya yang Menghidupkan dan Mematikan. Dia yang selalu hidup, tidak mati dan Iuput selama-lamanya. Di tanganNya segala kebajikan dan kepadaNyalah tempat kembali dan Dialah yang Maha Kuasa atas segalanya."
      }
    ],
    "categoryKey": [
      "sa'i"
    ],
    "audio": "doa_sai_pertama.mp3"
  },
  {
    "id": 40,
    "titleEn": "While Brisk Walking Between The Green Lights",
    "titleMy": "Ketika Berlari Anak Diantara Tiang Hijau",
    "doa": [
      {
        "id": 1,
        "arabic": "رَبِّ اغْفِرْ وَارْحَمْ وَاعْفُ وَتَكَرَّمْ، وَتَجَاوَزْ عَمَّا تَعْلَمُ إِنَّكَ تَعْلَمُ مَا لَا نَعْلَمُ إِنَّكَ أَنْتَ اللهُ الْأَعَزُّ الْأَكْرَمُ",
        "translationEn": "My Sustainer, forgive me, show me mercy and pardon that which You know. You know that which we do not know. You are indeed the All Powerful and the Most Generous. ",
        "translationMy": "Ya Allah, ampunilah, sayangilah dan maafkanlah serta hapuskanlah apa-apa yang Engkau ketahui tentang dosa kami sesungguhnya Engkau Maha Mengetahui apa yang tidak kami ketahui. Sesungguhnya Engkau adalah Allah yang Maha Mulia dan Maha Pemurah."
      }
    ],
    "categoryKey": [
      "sa'i"
    ],
    "audio": "doa_antara_tiang_hijau.mp3"
  },
  {
    "id": 41,
    "titleEn": "After Passing The Green Lights ",
    "titleMy": "Setelah Melintasi Tiang Hijau",
    "doa": [
      {
        "id": 1,
        "arabic": "رَبِّ أَجِرْنَا مِنَ النَّارِ سَالِمِينَ، وَأَدْخِلْنَا الْجَنَّةَ غَانِمِيْنَ فَرِحِيْنَ مُسْتَبْشِرِيْنَ\nمَعَ عِبَادِكَ الصَّالِحِيْنَ، مَعَ الَّذِيْنَ أَنْعَمَ اللهُ عَلَيْهِمْ مِنَ النَّبِيِّينَ وَالصِّدِّيقِينَ\nوَالشُّهَدَاءِ وَالصّٰلِحِيْنَ وَحَسُنَ أُولٰئِكَ رَفِيقًا، ذٰلِكَ الْفَضْلُ مِنَ اللَّهِ\nوَكَفَى بِاللَّهِ عَلِيْمًا، لَا إِلٰهَ إِلَّا اللهُ حَقًّا حَقًّا، لَا إِلٰهَ إِلَّا اللهُ تَعَبُّدًا ورِقًّا\nلَا إِلٰهَ إِلَّا اللهُ وَلَا نَعْبُدُ إِلَّا إِيَّاهُ مُخْلِصِينَ لَهُ الدِّينَ وَلَوْكَرِهَ الْكَافِرُوْنَ",
        "translationEn": "My Lord, spare me from the fire and admit me into Paradise such that we attain safety, profit, happiness and rejoicement together with Your pious servants and in the company of those upon whom You have bestowed your blessings from among the Prophets, the truthful ones, the martyrs and the righteous and those who make good company. That is the bounty from Allah and it is sufficient that Allah knows all things. There is no god besides Allah, in truth and there is no god besides Allah to Whom servitude and slavehood is due. There is no god but Him. We devote our religion sincerely to Him, even though the disbelievers dislike it.\n",
        "translationMy": "Ya Tuhan kami, selamatkanlah kami dari api neraka, dan gembirakanlah kami masuk ke syurga bersama-sama hambaMu yang telah Engkau kurniakan nikmat daripada para Nabi, para sidiqqin, para syuhada dan solehin.Dan mereka itulah sebaik-baik teman. ltu semua limpah kurnia dari Allah s.w.t. Sesungguhnya Allah Maha Mengetahui. Tiada Tuhan melainkan Allah dengan sebenar. Tiada Tuhan melainkan Allah, aku menyebutnya tanda pengabdian. Tiada Tuhan melainkan Dia. Kami ikhlaskan agama keranaNya walaupun orang-orang kafir benci."
      }
    ],
    "categoryKey": [
      "sa'i"
    ],
    "audio": "doa_setelah_melintas_tiang_hijau.mp3"
  },
  {
    "id": 42,
    "titleEn": "When Approaching Marwah Hill",
    "titleMy": "Ketika Menaiki Bukit Marwah",
    "doa": [
      {
        "id": 1,
        "arabic": "إِنَّ الصَّفَا وَالْمَرْوَةَ مِنْ شَعَائِرِ اللهِ فَمَنْ حَجَّ البَيتَ اَوِاعْتَمَرَ فَلَا جُنَاحَ عَلَيْهِ أَنْ يَطَّوَّفَ بِهِمَا، وَمَنْ تَطَوَّعَ خَيْرًا فَإِنَّ اللَّهَ شَاكِرٌ عَلَيْمٌ",
        "translationEn": "Indeed, Safa and Marwah are from the symbols of Allah's religion and so there is no sin upon those who perform haj or umrah to go between them and he who does good voluntarily, let him be informed that Allah is All-Appreciative and All-Knowing. ",
        "translationMy": "Sesungguhnya Safa dan Marwah itu adalah sebagai tanda-tanda kebesaran Allah. Barangsiapa yang menunaikan ibadat haji dan umrah ke Baitullah, maka tiada salahnya untuk berjalan di antara keduanya, dan barang siapa yang berbuat baik dengan suka rela, maka sesungguhnya Allah Maha Menerima dan Maha Mengetahui."
      }
    ],
    "categoryKey": [
      "sa'i"
    ],
    "audio": "doa_naik_bukit_safa_marwah.mp3"
  },
  {
    "id": 43,
    "titleEn": "(2nd) Sa'i (Marwah → Safa)",
    "titleMy": "(Ke-2) Sa'i Kedua (Marwah → Safa)",
    "doa": [
      {
        "id": 1,
        "arabic": "اَلله أَكْبَرُ، اَلله أَكْبَرُ، اَلله أَكْبَرُ، وَلِلّٰهِ الْحَمْدُ لَا إِلٰهَ إِلَّا اللهُ الْوَاحِدُ الْفَرْدُ الصَّمَدُ\nالَّذِي لَمْ يَتَّخِذْ صَاحِبَةً وَلَا وَلَدًا، وَلَمْ يَكُنْ لَهُ شَرِيْكٌ فِي الْمُلْكِ، وَلَمْ يَكُنْ لَهُ وَلِيٌّ مِنَ الذُّلِّ\n وَكَبِّرْهُ تَكْبِيرًا، اَللّٰهُمَّ إِنَّكَ قُلْتَ فِي كِتَابِكَ الْمُنزَلِ، أُدْعُونِي أَسْتَجِبْ لَكُمْ، دَعَوْنَاكَ رَبَّنَا \nكَمَا أَمَرْتَنَا، فَاسْتَجِبْ لَنَا كَمَا وَعَدْتَنَا إِنَّكَ لَا تُخْلِفُ الْمِيعَادَ، رَبَّنَا إنَّنَا سَمِعْنَا مُنَادِيًا يُنَادِي لِلْإِيْمَانِ أَنْ آمِنُوا بِرَبِّكُمْ فَآمَنَّا رَبَّنَا فَاغْفِرْ لَنَا ذُنُوبَنَا وَكَفِّرْ عَنَّا سَيِّئَاتِنَا وَتَوَفَّنَا مَعَ الْأَبْرَارِ، رَبَّنَا وَآتِنَا مَا وَعَدْتَنَا عَلَى رُسُلِكَ وَلَا تُخْزِنَا يَوْمَ الْقِيَامَةِ\nإِنَّكَ لَا تُخْلِفُ الْمِيْعَادَ، رَبَّنَا عَلَيْكَ تَوَكَّلْنَا وَإِلَيْكَ أَنَبنَا، وَإِلَيْكَ الْمَصِيرُ\nرَبَّنَا اغْفِرْ لَنَا وَلِإِخْوَانِنَا الَّذِيْنَ سَبَقُونَا بِالْإِيْمَانِ\nوَلَا تَجْعَلْ فِي قُلُوْبِنَا غِلًّا لِلَّذِينَ آمَنُوا رَبَّنَا إنَّكَ رَؤُوفٌ رَحِيمٌ",
        "translationEn": "Allah is the Greatest, Allah is the Greatest, Allah is the Greatest. All praises are due to Allah. There is no God but Allah, the One, the Unique, the Self Sufficient. He does not have a wife nor children. Who has no partner in sovereignty. And who has no protector out of weakness.  Glorified is He with All Greatness. O Allah, You commanded in the Holy Book that You revealed: 'Call upon Me, I will respond to you.' O Lord, we have called upon You, our Lord, as You commanded us, so respond to us as You promised us. Indeed, You never fail in Your promise. Our Lord, indeed we have heard a caller calling to faith, saying: ‘Believe in your Lord’ and we believed. Our Lord, forgive our sins and remove from us our misdeeds and cause us to die among the righteous. O our Lord, grant us what You have promised through Your Messengers. And do not disappoint us on the Day of Judgment. Indeed, You never fail in Your Promises. Our Lord, upon You we have relied, to You we have turned in repentance, and to You is the final return. O our Lord, forgive us and our brothers who have preceded us in faith, and do not place in our hearts any resentment toward those who believe. O our Lord, You are Most Kind and Most Compassionate.",
        "translationMy": "Allah Maha Besar, Allah Maha Besar, Allah Maha Besar. Hanya bagi Allah segala puji. Tiada Tuhan kecuali Allah yang Maha Esa, tempat bergantung segala sesuatu. Yang tiada beristeri dan tidak beranak. Tiada sekutu bagiNya dalam kekuasaan. Tiada bagiNya wakil dari yang hina, dan agunglah Dia dengan segenap kebesaran. Ya Allah, Engkau berfirman dalam Kitab Suci yang Engkau turunkan: “Mohonlah kepadaKu, Aku perkenankan bagimu” Ya Tuhan, kami mohon kepadaMu, sebagaimana Kau perintahkan. Engkau tidak memungkiri janji. Ya Tuhan kami, sesungguhnya kami telah mendengar orang yang menyeru supaya beriman: “Berimanlah kamu dengan Tuhanmu.” Maka kami beriman. Ampunilah dosa-dosa kami dan hapuskanlah kejahatan dari diri kami dan wafatkanlah kami bersama orang-orang yang baik. Ya Tuhan kami, anugerahilah kami dengan apa yang telah Engkau janjikan melalui rasul-rasulMu. Dan janganlah Engkau kecewakan kami pada hari kiamat. Sesungguhnya Engkau tidak mungkir janji. Ya Tuhan kami kepadaMu kami menyerah dan kepadaMu kami kembali dan Engkaulah tumpuan harapan kami. Ya Tuhan kami, ampunilah kami serta saudara-saudara kami yang telah mendahului kami dalam beriman, dan janganlah Engkau jadikan dalam hati kami rasa dengki kepada orang-orang yang beriman. Ya Tuhan kami, Engkau Maha Pengasih dan Maha Penyayang."
      }
    ],
    "categoryKey": [
      "sa'i"
    ],
    "audio": "doa_sai_kedua.mp3"
  },
  {
    "id": 44,
    "titleEn": "While Brisk Walking Between The Green Lights",
    "titleMy": "Ketika Berlari Anak Diantara Tiang Hijau",
    "doa": [
      {
        "id": 1,
        "arabic": "رَبِّ اغْفِرْ وَارْحَمْ وَاعْفُ وَتَكَرَّمْ، وَتَجَاوَزْ عَمَّا تَعْلَمُ إِنَّكَ تَعْلَمُ مَا لَا نَعْلَمُ إِنَّكَ أَنْتَ اللهُ الْأَعَزُّ الْأَكْرَمُ",
        "translationEn": "My Sustainer, forgive me, show me mercy and pardon that which You know. You know that which we do not know. You are indeed the All Powerful and the Most Generous. ",
        "translationMy": "Ya Allah, ampunilah, sayangilah dan maafkanlah serta hapuskanlah apa-apa yang Engkau ketahui tentang dosa kami sesungguhnya Engkau Maha Mengetahui apa yang tidak kami ketahui. Sesungguhnya Engkau adalah Allah yang Maha Mulia dan Maha Pemurah."
      }
    ],
    "categoryKey": [
      "sa'i"
    ],
    "audio": "doa_antara_tiang_hijau.mp3"
  },
  {
    "id": 45,
    "titleEn": "When Approaching Safa Hill",
    "titleMy": "Ketika Menaiki Bukit Safa",
    "doa": [
      {
        "id": 1,
        "arabic": "إِنَّ الصَّفَا وَالْمَرْوَةَ مِنْ شَعَائِرِ اللهِ فَمَنْ حَجَّ البَيتَ اَوِاعْتَمَرَ فَلَا جُنَاحَ عَلَيْهِ\nأَنْ يَطَّوَّفَ بِهِمَا، وَمَنْ تَطَوَّعَ خَيْرًا فَإِنَّ اللَّهَ شَاكِرٌ عَلَيْمٌ",
        "translationEn": "Indeed, Safa and Marwah are from the symbols of Allah's religion and so there is no sin upon those who perform haj or umrah to go between them and he who does good voluntarily, let him be informed that Allah is All-Appreciative and All-Knowing.",
        "translationMy": "Sesungguhnya Safa dan Marwah itu adalah sebagai tanda-tanda kebesaran Allah. Barangsiapa yang menunaikan ibadat haji dan umrah ke Baitullah, maka tiada salahnya untuk berjalan di antara keduanya, dan barang siapa yang berbuat baik dengan suka rela, maka sesungguhnya Allah Maha Menerima dan Maha Mengetahui."
      }
    ],
    "categoryKey": [
      "sa'i"
    ],
    "audio": "doa_naik_bukit_safa_marwah.mp3"
  },
  {
    "id": 46,
    "titleEn": "(3rd) Sa'i (Safa → Marwah)",
    "titleMy": "(Ke-3) Sa'i Ketiga (Safa → Marwah)",
    "doa": [
      {
        "id": 1,
        "arabic": "اَللهُ أَكْبَرُ، اَللهُ أَكْبَرُ، اَللهُ أَكْبَرُ، وَلِلَّهِ الْحَمْدُ، رَبَّنَا أَتْمِمْ نُوْرَنَا وَاغْفِرْلَنَا\nإِنَّكَ عَلَى كُلِّ شَيْءٍ قَدِيرٌ ، اَللّٰهُمَّ إِنِّي أَسْأَلُكَ الْخَيْرَ كُلَّهُ عَاجِلَهُ وَآجِلَهُ\nوَأَسْتَغْفِرُكَ لِذَنبِي، وَأَسْأَلُكَ رَحْمَتَكَ يَا أَرْحَمَ الرَّاحِمِينَ",
        "translationEn": "Allah is the Greatest, Allah is the Greatest, Allah is the Greatest. And to Allah belongs all praise. Our Lord, perfect for us our light and forgive us.  Indeed, You are All-Powerful over all things. O Allah, indeed I ask You for all that is good, both immediate and delayed. And I seek forgiveness for my sins and I ask You for Your mercy, O Most Merciful of those who show mercy.”",
        "translationMy": "Allah Maha Besar, Allah Maha Besar, Allah Maha Besar. Dan Bagi Allah segala pujian. Ya Allah, sempurnakanlah cahaya terang bagi kami dan ampunilah kami. Engkau Maha Kuasa atas segala sesuatu. Ya Allah, sesungguhnya aku mohon kepadaMu kebaikan seluruhnya, yang cepat dan yang lambat. Dan aku mohon kepadaMu ampun atas dosaku, juga aku mohon kepadaMu rahmatMu, wahai Tuhan Yang Maha Pengasih dan Penyayang."
      }
    ],
    "categoryKey": [
      "sa'i"
    ],
    "audio": "doa_sai_ketiga.mp3"
  },
  {
    "id": 47,
    "titleEn": "While Brisk Walking Between The Green Lights",
    "titleMy": "Ketika Berlari Anak Diantara Tiang Hijau",
    "doa": [
      {
        "id": 1,
        "arabic": "رَبِّ اغْفِرْ وَارْحَمْ وَاعْفُ وَتَكَرَّمْ، وَتَجَاوَزْ عَمَّا تَعْلَمُ إِنَّكَ تَعْلَمُ مَا لَا نَعْلَمُ إِنَّكَ أَنْتَ اللهُ الْأَعَزُّ الْأَكْرَمُ",
        "translationEn": "My Sustainer, forgive me, show me mercy and pardon that which You know. You know that which we do not know. You are indeed the All Powerful and the Most Generous. ",
        "translationMy": "Ya Allah, ampunilah, sayangilah dan maafkanlah serta hapuskanlah apa-apa yang Engkau ketahui tentang dosa kami sesungguhnya Engkau Maha Mengetahui apa yang tidak kami ketahui. Sesungguhnya Engkau adalah Allah yang Maha Mulia dan Maha Pemurah."
      }
    ],
    "categoryKey": [
      "sa'i"
    ],
    "audio": "doa_sai_keempat.mp3"
  },
  {
    "id": 48,
    "titleEn": "After Passing The Green Lights ",
    "titleMy": "Setelah Melintasi Tiang Hijau",
    "doa": [
      {
        "id": 1,
        "arabic": "رَبِّ زِدْنِي عِلْمًا وَلَا تُزِغْ قَلْبِي بَعْدَ إِذْ هَدَيْتَنِي، وَهَبْ لِي مِنْ لَدُنْكَ رَحْمَةً إِنَّكَ\nأَنْتَ الْوَهَّابُ، اَللّٰهُمَّ عَافِنِي فِي سَمْعِي وَبَصَرِي، لَا إِلٰهَ إِلَّا أَنْتَ، اَللّٰهُمَّ إِنِّي أَعُوْذُ بِكَ مِنْ\nعَذَابِ الْقَبْرِ، لَا إِلٰهَ إِلَّا أَنْتَ سُبْحٰنَكَ إِنِّي كُنتُ مِنَ الظَّالِمِيْنَ\n،اَللّٰهُمَّ إِنِّي أَعُوْذُ بِكَ مِنَ الْكُفْرِ وَالْفَقْرِ، اَللّٰهُمَّ إِنِّي أَعُوْذُ بِرِضَاكَ مِنْ سَخَطِكَ وَبِمُعَافَاتِكَ مِنْ عُقُوْبَتِكَ\nوَ أَعُوْذُ بِكَ مِنْكَ لَا أُحْصِيْ ثَنَاءً عَلَيْكَ أَنْتَ كَمَا أَثْنَيْتَ عَلَى نَفْسِكَ، فَلَكَ الْحَمْدُ حَتَّى تَرْضَى",
        "translationEn": "O Lord, increase my knowledge, do not turn my heart away after You have guided me, grant me mercy from You, for indeed You are the Bestower. O Allah, bless me in my hearing and my sight, there is no god but You. O Allah, I seek refuge in You from the punishment of the grave, there is no god but You. Glory be to You, indeed I am among the wrongdoers. O Allah, indeed I seek refuge in You from disbelief and poverty, O Allah, I seek refuge in Your pleasure from Your Wrath and in Your Pardon from Your Punishment and I seek refuge in You from You. I cannot praise You, as You praise Yourself, so to You belongs all praise until You are pleased.",
        "translationMy": "Ya Tuhan, tambahkan aku ilmu, jangan palingkan hatiku setelah Engkau beri hidayah kepadaku, berilah aku rahmat dariMu, sesungguhnya Engkau Maha Pemberi. Ya Allah, baikilah keadaan aku dengan pendengaran dan penglihatan aku, tiada Tuhan melainkan Engkau. Ya Allah, aku berlindung denganMu dari seksa kubur, tiada Tuhan melainkan Engkau. Maha Suci Engkau, sesungguhnya aku dari golongan zalim. Ya Allah, sesungguhnya aku berlindung dari kekufuran dan kepapaan, Ya Allah, aku berlindung dengan keredaanMu dari kemurkaanMu, dan dengan kemaafanMu dari azabMu. Aku tidak dapat memuji kepadaMu, seperti pujiMu sendiri kepada diriMu, segala puji bagiMu hingga Engkau redai."
      }
    ],
    "categoryKey": [
      "sa'i"
    ],
    "audio": "doa_setelah_melepasi_tiang_hijau_3.mp3"
  },
  {
    "id": 49,
    "titleEn": "When Approaching Marwah Hill",
    "titleMy": "Ketika Menaiki Bukit Marwah",
    "doa": [
      {
        "id": 1,
        "arabic": "إِنَّ الصَّفَا وَالْمَرْوَةَ مِنْ شَعَائِرِ اللهِ فَمَنْ حَجَّ البَيتَ اَوِاعْتَمَرَ فَلَا جُنَاحَ عَلَيْهِ\nأَنْ يَطَّوَّفَ بِهِمَا، وَمَنْ تَطَوَّعَ خَيْرًا فَإِنَّ اللَّهَ شَاكِرٌ عَلَيْمٌ",
        "translationEn": "Indeed, Safa and Marwah are from the symbols of Allah's religion and so there is no sin upon those who perform haj or umrah to go between them and he who does good voluntarily, let him be informed that Allah is All-Appreciative and All-Knowing.",
        "translationMy": "Sesungguhnya Safa dan Marwah itu adalah sebagai tanda-tanda kebesaran Allah. Barangsiapa yang menunaikan ibadat haji dan umrah ke Baitullah, maka tiada salahnya untuk berjalan di antara keduanya, dan barang siapa yang berbuat baik dengan suka rela, maka sesungguhnya Allah Maha Menerima dan Maha Mengetahui."
      }
    ],
    "categoryKey": [
      "sa'i"
    ],
    "audio": "doa_naik_bukit_safa_marwah.mp3"
  },
  {
    "id": 50,
    "titleEn": "(4th) Sa'i (Marwah → Safa)",
    "titleMy": "(Ke-4) Sa'i Keempat (Marwah → Safa)",
    "doa": [
      {
        "id": 1,
        "arabic": "اَللهُ أَكبَرُ، اَللهُ أَكبَرُ، اَللهُ أَكبَرُ، وَلِلّٰهِ الْحَمْدُ، اَللّٰهُمَّ إِنِّي أَسْأَلُكَ مِنْ خَيْرِ مَا تَعْلَمُ\nوَأَعُوْذُ بِكَ مِنْ شَرِّ مَا تَعْلَمُ إِنَّكَ أَنْتَ عَلاَّمُ الْغُيُوبِ، لَا إِلٰهَ إِلَّا اللهُ الْمَلِكُ الْحَقُّ الْمُبِيْنَ مُحَمَّدٌ رَسُولُ اللَّهُ، الصَّادِقُ الْوَعْدُ الْأَمِيْنِ، اَللّٰهُمَّ إِنِّي أَسْأَلُكَ كَمَا هَدَيْتَنِي لِلْإِسْلَامِ\nأَن لَا تَنزِعَهُ مِنِّي حَتَّى تَتَوَفَّانِي وَأَنَا مُسْلِمٌ، اَللّٰهُمَّ اجْعَلْ فِي قَلْبِي نُورًا\nوَفِي سَمْعِي نُورًا، وَفِي بَصَرِي نُوْرًا، اَللّٰهُمَّ اشْرَحْ لِي صَدْرِي، وَيَسِّرْ لِي أَمْرِي\nوَأَعُوْذُ بِكَ مِنْ شَرِّ وَسَاوِسِ الصَّدْرِ، وَشَتَاتِ الْأَمْرِ وَفِتْنَةِ الْقَبْرِ\nاَللّٰهُمَّ إِنِّي أَعُوْذُ بِكَ مِنْ شَرِّ مَا يَلِجُ فِي اللَّيْلِ وَشَرِّ مَا يَلِجُ فِي النَّهَارِ\nوَمِنْ شَرِّ مَا تَهُبُّ بِهِ الرِّيَاحِ يَا أَرْحَمَ الرَّاحِمِيْنَ\nسُبْحَانَكَ مَا عَبَدْنَاكَ حَقَّ عِبَادَتِكَ يَا اَللهُ\nسُبْحَانَكَ مَا ذَكَرْنَاكَ حَقَّ ذِكْرِكَ يَا اَللهُ",
        "translationEn": "Allah is the Greatest, Allah is the Greatest, Allah is the Greatest. And to Allah belongs all praise. O Allah, I ask You for the good of that which You know, and I seek refuge in You from the evil of that which You know. Indeed, You are the Knower of the unseen. There is no god except Allah, the Sovereign, the Absolute Truth, the Clear Manifest. Muhammad is the Messenger of Allah, truthful in promise, trustworthy. O Allah, just as You have guided me to Islam, do not remove it from me until You take my soul. O Allah, place light in my heart, light in my hearing and light in my sight. O Allah, expand my chest and make my affairs easy, and I seek refuge in You from doubts and confusion in my affairs, and I seek refuge from the torment of the grave. O Allah, I seek refuge in You from the evil that arises in the night and the day, and the evil brought by the wind, O Most Merciful of those who show mercy. Glory be to You, we have not worshipped You as You deserve to be worshipped, O Allah. Glory be to You, we have not remembered You as You deserve to be remembered, O Allah.",
        "translationMy": "Allah Maha Besar, Allah Maha Besar, Allah Maha Besar. Dan bagi Allah segala puji. Ya Allah, sesungguhnya aku mohon kepadaMu sebaik-baik perkara yang Engkau Mengetahuinya, serta mohon perlindunganMu dari seburuk-buruk perkara yang Engkau Mengetahuinya dan aku mohon ampun atas segala yang Engkau tahu, sesungguhnya Engkau Maha Mengetahui yang ghaib. Tiada Tuhan kecuali Allah yang memiliki kebenaran yang nyata. Muhammad Rasulullah yang benar janjinya Iagi dipercayai. Ya Allah, aku mohon kepadaMu, sebagaimana Engkau telah memberi petunjuk kepadaku, sehingga aku meninggal dalam Islam. Ya Allah, berilah cahaya dalam hatiku, telingaku dan penglihatanku. Ya Allah, lapangkanlah dadaku, dan mudahkanlah urusanku, dan aku berlindung kepadaMu daripada was-was dan kucar-kacir urusan dan aku berlindung daripada azab kubur. Ya Allah, aku berlindung kepadaMu dari kejahatan yang timbul pada malam dan siang hari, dan kejahatan yang dibawa oleh angin. Wahai Tuhan yang Maha Pengasih Iagi Maha Penyayang. Ya Allah kami tidak dapat menyembahMu sebagaimana yang sepatutnya dan kami tidak dapat mengingatiMu sebagaimana yang sewajarnya."
      }
    ],
    "categoryKey": [
      "sa'i"
    ],
    "audio": "doa_sai_keempat.mp3"
  },
  {
    "id": 51,
    "titleEn": "While Brisk Walking Between The Green Lights",
    "titleMy": "Ketika Berlari Anak Diantara Tiang Hijau",
    "doa": [
      {
        "id": 1,
        "arabic": "رَبِّ اغْفِرْ وَارْحَمْ وَاعْفُ وَتَكَرَّمْ، وَتَجَاوَزْ عَمَّا تَعْلَمُ إِنَّكَ تَعْلَمُ مَا لَا نَعْلَمُ إِنَّكَ أَنْتَ اللهُ الْأَعَزُّ الْأَكْرَمُ",
        "translationEn": "My Sustainer, forgive me, show me mercy and pardon that which You know. You know that which we do not know. You are indeed the All Powerful and the Most Generous. ",
        "translationMy": "Ya Allah, ampunilah, sayangilah dan maafkanlah serta hapuskanlah apa-apa yang Engkau ketahui tentang dosa kami sesungguhnya Engkau Maha Mengetahui apa yang tidak kami ketahui. Sesungguhnya Engkau adalah Allah yang Maha Mulia dan Maha Pemurah."
      }
    ],
    "categoryKey": [
      "sa'i"
    ],
    "audio": "doa_antara_tiang_hijau.mp3"
  },
  {
    "id": 52,
    "titleEn": "When Approaching Safa Hill",
    "titleMy": "Ketika Menaiki Bukit Safa",
    "doa": [
      {
        "id": 1,
        "arabic": "إِنَّ الصَّفَا وَالْمَرْوَةَ مِنْ شَعَائِرِاللهِ فَمَنْ حَجَّ البَيتَ اَوِاعْتَمَرَ فَلَا جُنَاحَ عَلَيْهِ\nأَنْ يَطَّوَّفَ بِهِمَا، وَمَنْ تَطَوَّعَ خَيْرًا فَإِنَّ اللَّهَ شَاكِرٌ عَلَيْمٌ",
        "translationEn": "Indeed, Safa and Marwah are from the symbols of Allah's religion and so there is no sin upon those who perform haj or umrah to go between them and he who does good voluntarily, let him be informed that Allah is All-Appreciative and All-Knowing.",
        "translationMy": "Sesungguhnya Safa dan Marwah itu adalah sebagai tanda-tanda kebesaran Allah. Barangsiapa yang menunaikan ibadat haji dan umrah ke Baitullah, maka tiada salahnya untuk berjalan di antara keduanya, dan barang siapa yang berbuat baik dengan suka rela, maka sesungguhnya Allah Maha Menerima dan Maha Mengetahui."
      }
    ],
    "categoryKey": [
      "sa'i"
    ],
    "audio": "doa_naik_bukit_safa_marwah.mp3"
  },
  {
    "id": 53,
    "titleEn": "(5th) Sa'i Supplication (Safa → Marwah)",
    "titleMy": "(Ke-5) Doa Sa'i Kelima (Safa → Marwah)",
    "doa": [
      {
        "id": 1,
        "arabic": "اَللهُ أَكبَرُ، اَللهُ أَكبَرُ، اَللهُ أَكبَرُ، اَللهُ أَكبَرُ كَبِيرًا وَالْحَمْدُ لِلَّهِ كَثِيرًا\nاَللَّهُمَّ حَبِّبْ إِلَيَّ الْإِيْمَانَ وَزَيِّنْهُ فِي قَلْبِي، وَكَرِّهْ إِلَىَّ الْكُفْرَ\nوَالْفُسُوْقَ وَالْعِصْيَانَ، وَاجْعَلْنِي مِنَ الرَّاشِدِيْنَ",
        "translationEn": "Allah is the Greatest, Allah is the Greatest, Allah is the Greatest. Allah is the Greatest in all His Greatness, all praise is due to Allah. O Allah, endear faith to me and adorn it in my heart, and make disbelief, wickedness, and disobedience hateful to me and make me among those who are rightly guided.",
        "translationMy": "Allah Maha Besar, Allah Maha Besar, Allah Maha Besar. Allah Maha Besar dengan segala KebesaranNya, segala puji bagi Allah. Ya Allah cintakanlah aku kepada keimanan dan hiaskanlah ia di hati ku. Bencikanlah aku kepada kekafiran, kefasikan dan kedurhakaan. Jadikanlah aku di antara orang-orang yang mendapat petunjuk."
      }
    ],
    "categoryKey": [
      "sa'i"
    ],
    "audio": "doa_sai_kelima.mp3"
  },
  {
    "id": 54,
    "titleEn": "While Brisk Walking Between The Green Lights",
    "titleMy": "Ketika Berlari Anak Diantara Tiang Hijau",
    "doa": [
      {
        "id": 1,
        "arabic": "رَبِّ اغْفِرْ وَارْحَمْ وَاعْفُ وَتَكَرَّمْ، وَتَجَاوَزْ عَمَّا تَعْلَمُ إِنَّكَ تَعْلَمُ مَا لَا نَعْلَمُ إِنَّكَ أَنْتَ اللهُ الْأَعَزُّ الْأَكْرَمُ",
        "translationEn": "My Sustainer, forgive me, show me mercy and pardon that which You know. You know that which we do not know. You are indeed the All Powerful and the Most Generous.",
        "translationMy": "Ya Allah, ampunilah, sayangilah dan maafkanlah serta hapuskanlah apa-apa yang Engkau ketahui tentang dosa kami sesungguhnya Engkau Maha Mengetahui apa yang tidak kami ketahui. Sesungguhnya Engkau adalah Allah yang Maha Mulia dan Maha Pemurah."
      }
    ],
    "categoryKey": [
      "sa'i"
    ],
    "audio": "doa_antara_tiang_hijau.mp3"
  },
  {
    "id": 55,
    "titleEn": "After Passing The Green Lights ",
    "titleMy": "Setelah Melintasi Tiang Hijau",
    "doa": [
      {
        "id": 1,
        "arabic": "،اَللّٰهُمَّ قِنِي عَذَابَكَ يَوْمَ تَبْعَثُ عِبَادَكَ\n،اَللّٰهُمَّ اهْدِنِي بِالْهُدَى وَنَقِّنِي بِالتَّقْوَى وَاغْفِرْ لِي فِي الْآخِرَةِ وَالأُوْلَى \n اَللّٰهُمَّ ابْسُطْ عَلَيْنَا مِنْ بَرَكَاتِكَ وَرَحْمَتِكَ وَفَضْلِكَ وَرِزْقِكَ\nاَللّٰهُمَّ إِنِّي أَسْأَلُكَ النَّعِيمَ الْمُقِيمَ الَّذِي لَا يَحُولُ وَلَا يَزُولُ أَبَدًا\nاَللّٰهُمَّ اجْعَلْ فِي قَلْبِي نُورًا ، وَفِي سَمْعِي نُوْرًا، وَفِي بَصَرِي نُوْرًا، وَفِي لِسَانِي نُوْرًا\nوَعَنْ يَمِينِي نُوْرًا، وَعَنْ شِمَالِي نُورًا وَمِنْ فَوْقِي نُوْرًا وَعَنْ يَمِينِي نُوْرًا، وَعَنْ شِمَالِي نُورًا وَمِنْ فَوْقِي نُوْرًا\n،وَاجْعَلْ فِي نَفْسِي نُورًا وَعَظِّمْ لِي نُورًا\nرَبِّ اشْرَحْ لِي صَدْرِي وَيَسِّرْ لِي أَمْرِي\n\n",
        "translationEn": "O Allah, protect me from Your Punishment on the day You resurrect Your servants. O Allah, guide me with true guidance, purify me with righteousness, and forgive me in this world and in the Hereafter. O Allah, bestow upon me Your Blessings, Your Mercy, Your Grace and Your Provisions. O Allah, I ask for everlasting blessings that do not change nor disappear. O Allah, place light in my heart, light in my hearing, light in my sight, and light upon my tongue and light on my right and light on my left and light above me and place light within my soul, and magnify for me light. O my Lord, expand my chest and ease my affairs.",
        "translationMy": "Ya Allah, selamatkanlah aku dari azabMu, di hari Engkau membangkitkan hamba-hambaMu. Ya Allah, pimpinlah aku dengan hidayat, dan sucikanlah aku dengan takwa, dan ampunilah aku di dunia dan di akhirat. Ya Allah, Iimpahkanlah atas aku berkatMu, rahmatMu, kurniaMu dan rezekiMu. Ya Allah, aku bermohon nikmat yang berkekalan, tidak berpindah dan tidak hilang. Ya Allah, jadikanlah cahaya di dalam hatiku, pendengaranku, penglihatanku, lidahku, di kanan dan di kiriku, di atasku dan di dalam jiwaku. Lapangkanlah dadaku dan mudahkanlah urusanku."
      }
    ],
    "categoryKey": [
      "sa'i"
    ],
    "audio": "doa_setelah_melepasi_tiang_hijau_5.mp3"
  },
  {
    "id": 56,
    "titleEn": "When Approaching Marwah Hill",
    "titleMy": "Ketika Menaiki Bukit Marwah",
    "doa": [
      {
        "id": 1,
        "arabic": "إِنَّ الصَّفَا وَالْمَرْوَةَ مِنْ شَعَائِرِ اللهِ فَمَنْ حَجَّ البَيتَ اَواعْتَمَرَ فَلَا جُنَاحَ عَلَيْهِ أَنْ يَطَّوَّفَ بِهِمَا، وَمَنْ تَطَوَّعَ خَيْرًا فَإِنَّ اللَّهَ شَاكِرٌ عَلَيْمٌ",
        "translationEn": "Indeed, Safa and Marwah are from the symbols of Allah's religion and so there is no sin upon those who perform haj or umrah to go between them and he who does good voluntarily, let him be informed that Allah is All-Appreciative and All-Knowing.",
        "translationMy": "Sesungguhnya Safa dan Marwah itu adalah sebagai tanda-tanda kebesaran Allah. Barangsiapa yang menunaikan ibadat haji dan umrah ke Baitullah, maka tiada salahnya untuk berjalan di antara keduanya, dan barang siapa yang berbuat baik dengan suka rela, maka sesungguhnya Allah Maha Menerima dan Maha Mengetahui."
      }
    ],
    "categoryKey": [
      "sa'i"
    ],
    "audio": "doa_naik_bukit_safa_marwah.mp3"
  },
  {
    "id": 57,
    "titleEn": "(6th) Sa'i (Marwah → Safa)",
    "titleMy": "(Ke-6) Sa'i Keenam (Marwah → Safa)",
    "doa": [
      {
        "id": 1,
        "arabic": "اَللهُ أَكْبَرُ، اَللهُ أَكْبَرُ، اَلله أَكْبَرُ، وَلِلَّهِ الْحَمْدُ، لَا إِلٰهَ إِلَّا اللَّهُ وَحْدَهُ، صَدَقَ وَعْدَهُ\nوَنَصَرَ عَبْدَهُ، وَهَزَمَ الْأَحْزَابَ وَحْدَهُ، لَا إِلٰهَ إِلَّا اللَّهُ، وَلَا نَعْبُدُ إِلَّا إِيَّاهُ مُخْلِصِينَ لَهُ الدِّيْنَ\nوَلَوْ كَرِهَ الْكَافِرُوْنَ، اَللّٰهُمَّ إِنِّي أَسْأَلُكَ الْهُدَى وَالتُّقَى وَالْعَفَافَ وَالْغِنَى،اَللّٰهُمَّ إِنِّي أَسْأَلُكَ \nرِضَاكَ وَالجَنَّةَ، وَأَعُوْذُ بِكَ مِنْ سَخَطِكَ وَالنَّارِ،وَمَا يُقَرِّبُنِي إِلَيْهَا مِنْ قَوْلٍ أَوْ فِعْلٍ أَوْ عَمَلٍ\nاَللّٰهُمَّ بِنُورِكَ اهْتَدَيْنَا وَبِفَضْلِكَ اسْتَغنَيْنَا وَفِي كَنَفِكَ وَإِنْعَامِكَ وَعَطَائِكَ وَإِحْسَانِكَ\nأَصْبَحْنَا وَأَمْسَيْنَا أَنتَ الْأَوّلُ فَلَا قَبْلَكَ شَيْءٌ، وَالْآخِرُ فَلَا بَعْدَكَ شَيْءٌ\nوَالظَّاهِرُ فَلَا شَيْءَ فَوْقَكَ، وَالْبَاطِنُ فَلَا شَيْءَ دُوْنَكَ\nنَعُوْذُبِكَ مِنَ الْعَجْزِ وَالْكَسَلِ وَعَذَابِ الْقَبْرِ وَفِتنَةِ الْغِنَى وَنَسْأَلُكَ الْفَوْزَ بِالْجَنَّةِ",
        "translationEn": "Allah is the Greatest, Allah is the Greatest, Allah is the Greatest. And to Allah belongs all praise. There is no god except Allah the One. His promise is true, He helps His servants, He destroys His enemies. There is no God besides Allah and we do not worship anyone but Him. We devote the religion sincerely to Him, even though the disbelievers dislike it. O Allah, I ask for guidance, piety, purity of heart, and self-sufficiency. O Allah, I seek Your Pleasure and for Paradise and I seek refuge in You from Your displeasure and from the Fire and from anything that brings me closer to it in word, deed, or action. O Allah, by Your Light we have been guided. By Your Grace we have become self-sufficient and within Your Protection, Your favour, Your Gift and Your Kindness we begin our mornings and our evenings. You are the First, nothing existed before You, and You are the Last, nothing exists after You. You are also the Outwardly Manifest, so there is nothing greater than You, You are the One whose Essence is unmatched. We seek Your protection from incapacity, laziness and the torment of the grave and from the trials of wealth. We ask You for success in attaining Paradise.",
        "translationMy": "Allah Maha Besar, Allah Maha Besar, Allah Maha Besar. Dan bagi Allah segala pujian. Tiada Tuhan kecuali Allah Yang Maha Esa. JanjiNya benar, Dia menolong hambaNya, Dia menghancurkan musuh-musuhNya. Tiada Tuhan selain Allah, dan kami tidak menyembah selainNya dengan penuh ikhlas. Dialah yang empunya agama ini walaupun orang-orang kafir tidak merasa senang. Ya Allah, aku bermohon hidayah, takwa, kesucian budi dan kekayaan. Ya Allah, aku mohon keredaanMu dan syurga, dan aku mohon dilindungi dari kemurkaanMu dan neraka, dan segala yang mendekatkan aku kepadanya, baik berupa kata, perbuatan atau pekerjaan. Ya Allah, dengan cahayaMu kami mendapat hidayah. Kami kaya dengan kurniaanMu berserta pertolongan, nikmat ,anugerah dan ihsanMu pagi dan petang. Engkaulah yang awal, tidak ada sesuatupun yang ada sebelumMu dan Engkau pula paling akhir dan tidak ada sesuatupun yang ada di belakang (sesudah)Mu. Engkau pula yang zahir maka tidak ada sesuatupun yang melebihi Engkau, Engkau pula yang batin tidak ada sesuatupun yang menyamaiMu. Kami mohon perlindunganMu dari kemiskinan, kemalasan dan azab kubur, serta ujian kekayaan. Kami mohon kepadaMu kemenangan mencapai syurga."
      }
    ],
    "categoryKey": [
      "sa'i"
    ],
    "audio": "doa_sai_keenam.mp3"
  },
  {
    "id": 58,
    "titleEn": "While Brisk Walking Between The Green Lights",
    "titleMy": "Ketika Berlari Anak Diantara Tiang Hijau",
    "doa": [
      {
        "id": 1,
        "arabic": "رَبِّ اغْفِرْ وَارْحَمْ وَاعْفُ وَتَكَرَّمْ، وَتَجَاوَزْ عَمَّا تَعْلَمُ إِنَّكَ تَعْلَمُ مَا لَا نَعْلَمُ إِنَّكَ أَنْتَ اللهُ الْأَعَزُّ الْأَكْرَمُ",
        "translationEn": "My Sustainer, forgive me, show me mercy and pardon that which You know. You know that which we do not know. You are indeed the All Powerful and the Most Generous.",
        "translationMy": "Ya Allah, ampunilah, sayangilah dan maafkanlah serta hapuskanlah apa-apa yang Engkau ketahui tentang dosa kami sesungguhnya Engkau Maha Mengetahui apa yang tidak kami ketahui. Sesungguhnya Engkau adalah Allah yang Maha Mulia dan Maha Pemurah."
      }
    ],
    "categoryKey": [
      "sa'i"
    ],
    "audio": "doa_antara_tiang_hijau.mp3"
  },
  {
    "id": 59,
    "titleEn": "When Approaching Safa Hill",
    "titleMy": "Ketika Menaiki Bukit Safa",
    "doa": [
      {
        "id": 1,
        "arabic": "إِنَّ الصَّفَا وَالْمَرْوَةَ مِنْ شَعَائِرِ اللهِ فَمَنْ حَجَّ البَيتَ اَواعْتَمَرَ فَلَا جُنَاحَ عَلَيْهِ أَنْ يَطَّوَّفَ بِهِمَا، وَمَنْ تَطَوَّعَ خَيْرًا فَإِنَّ اللَّهَ شَاكِرٌ عَلَيْمٌ",
        "translationEn": "Indeed, Safa and Marwah are from the symbols of Allah's religion and so there is no sin upon those who perform haj or umrah to go between them and he who does good voluntarily, let him be informed that Allah is All-Appreciative and All-Knowing.",
        "translationMy": "Sesungguhnya Safa dan Marwah itu adalah sebagai tanda-tanda kebesaran Allah. Barangsiapa yang menunaikan ibadat haji dan umrah ke Baitullah, maka tiada salahnya untuk berjalan di antara keduanya, dan barang siapa yang berbuat baik dengan suka rela, maka sesungguhnya Allah Maha Menerima dan Maha Mengetahui."
      }
    ],
    "categoryKey": [
      "sa'i"
    ],
    "audio": "doa_naik_bukit_safa_marwah.mp3"
  },
  {
    "id": 60,
    "titleEn": "(7th) Sa'i (Safa → Marwah)",
    "titleMy": "(Ke-7) Sa'i Ketujuh (Safa → Marwah)",
    "doa": [
      {
        "id": 1,
        "arabic": "اَللهُ أَكْبَرُ، اَللهُ أَكْبَرُ، اَللَّهُ أَكْبَرُ، وَلِلَّهِ الْحَمْدُ سُبْحَانَكَ مَا شَكَرْنَاكَ\nحَقَّ شُكْرِكَ يَا اَللَّهُ، سُبْحَانَكَ مَا أَعْلَى شَأْنَكَ يَا اَللَّهُ، اَللّٰهُمَّ حَبِّبْ\nإِلَيْنَا الْإِيْمَانَ وَزَيِّنْهُ فِي قُلُوْبِنَا، وَكَرِّه إلَيْنَا الْكُفْرَ وَالْفُسُوْقَ وَالْعِصْيَانَ\nوَاجْعَلْنَا مِنَ الرَّاشِدِيْنَ",
        "translationEn": "Allah is the Greatest, Allah is the Greatest, Allah is the Greatest. All praise is due to Allah. Glory be to You, O Allah, indeed we have not thanked You as You deserve to be thanked, O Allah. Glory be to You, how exalted is Your rank. O Allah, endear faith to us and adorn it in our hearts and make disbelief, wickedness, and disobedience hateful to us and make us among those who are rightly guided.",
        "translationMy": "Allah Maha Besar, Allah Maha Besar, Allah Maha Besar. Dan bagi Allah segala pujian. Maha Suci Engkau Ya Allah, sesungguhnya kami tidak dapat bersyukur kepada Engkau sebagaimana yang sepatutnya, Ya Allah. Maha Suci Engkau Ya Allah, tidak ada tolok banding sama sekali kemuliaanMu Ya Allah. Ya Allah, cintakanlah kami kepada keimanan dan hiaskanlah ia di dalam hati kami. Bencikanlah kami kepada kekafiran, kefasikan dan kederhakaan dan jadikanlah kami di antara orang-orang yang mendapat petunjuk."
      }
    ],
    "categoryKey": [
      "sa'i"
    ],
    "audio": "doa_sai_ketujuh.mp3"
  },
  {
    "id": 61,
    "titleEn": "While Brisk Walking Between The Green Lights",
    "titleMy": "Ketika Berlari Anak Diantara Tiang Hijau",
    "doa": [
      {
        "id": 1,
        "arabic": "رَبِّ اغْفِرْ وَارْحَمْ وَاعْفُ وَتَكَرَّمْ، وَتَجَاوَزْ عَمَّا تَعْلَمُ إِنَّكَ تَعْلَمُ مَا لَا نَعْلَمُ إِنَّكَ أَنْتَ اللهُ الْأَعَزُّ الْأَكْرَمُ",
        "translationEn": "My Sustainer, forgive me, show me mercy and pardon that which You know. You know that which we do not know. You are indeed the All Powerful and the Most Generous.",
        "translationMy": "Ya Allah, ampunilah, sayangilah dan maafkanlah serta hapuskanlah apa-apa yang Engkau ketahui tentang dosa kami sesungguhnya Engkau Maha Mengetahui apa yang tidak kami ketahui. Sesungguhnya Engkau adalah Allah yang Maha Mulia dan Maha Pemurah."
      }
    ],
    "categoryKey": [
      "sa'i"
    ],
    "audio": "doa_antara_tiang_hijau.mp3"
  },
  {
    "id": 62,
    "titleEn": "After Passing The Green Lights ",
    "titleMy": "Setelah Melintasi Tiang Hijau",
    "doa": [
      {
        "id": 1,
        "arabic": "،اَللّٰهُمَّ اخْتِمْ بِالْخَيْرَاتِ آجَالَنَا، وَحَقِّق بِفَضْلِكَ آمَالَنَا وَسَهِّلْ لِبْلُوْغِ رِضَاكَ سُبُلَنَا \n،وَحَسِّنْ فِي جَمِيعِ الْأَحْوَالِ أَعْمَالَنَا، يَا مُنْقِذَ الْغَرْقَى يَا مُنْجِيَ الْهَلكَى\nيَا شَاهِدَ كُلِّ نَجْوَى، يَا مُنْتَهَى كُلِّ شَكْوَى، يَا قَدِيْمَ الْإِحْسَانِ، يَا دَائِمَ الْمَعرُوْفِ\nاَللّٰهُمَّ إِنِّي عَائِذٌ بِكَ مِنْ شَرِّ مَا أَعْطَيْتَنَا، وَمِنْ شَرِّ مَا مَنَعْتَنَا\nاَللّٰهُمَّ تَوَفَّنَا مُسْلِمِيْنَ، وَأَلحِقْنَا بِالصَّالِحِيْنَ غَيْرَ خَزَايَا وَلَا مَفْتُونِيْنَ\nرَبِّ يَسِّر وَلَا تُعَسِّر، رَبِّ أَتْمِمْ بِالْخَيْرِ\n\n",
        "translationEn": "O Allah, end our lives with good deeds and fulfil our hopes by Your Grace and facilitate our journey to attain Your Pleasure. And beautify our deeds in every way. O Rescuer of the drowning, O Savior of the perishing,\nO Witness of every private supplication, O Final Refuge of every complaint, O Eternal in benevolence, O Everlasting in goodness, O Allah, I seek refuge in You from the evil of what You have given us and from the evil of what You have withheld from us. O Allah, cause us to die as Muslims and join us with the righteous without disgrace and without being led astray. O Allah, make matters easy and do not make them difficult.\nO Allah, bring matters to completion with goodness.",
        "translationMy": "Ya Allah, sudahkanlah hayat kami dengan kebajikan, dan Iaksanakanlah cita-cita kami dengan Iimpah dan kurniaMu, dan mudahkanlah perjalanan kami untuk mencapai keredaanMu. Perbaikilah amalan kami dalam segala hal. Ya Tuhan yang menyelamatkan mereka yang tenggelam, yang menyelamatkan mereka yang terjerumus, yang melihat segala apa yang tersembunyi, yang menjadi tumpuan segala rayuan, yang sentiasa bersifat ihsan, yang sentiasa memberi kebaikan, aku berlindung denganMu, dari kejahatan apa yang telah Engkau beri kepada kami, dan apa yang Engkau tahan dari kami. Ya Allah, matikanlah kami dalam keadaan Islam, dan masukkan kami ke dalam golongan orang yang soleh, hal keadaan tidak kecewa dan terfitnah. Ya Allah, permudahkanlah dan janganlah dipersusahkan,Ya Allah,sudahilah dengan kebaikan."
      }
    ],
    "categoryKey": [
      "sa'i"
    ],
    "audio": "doa_setelah_melepasi_tiang_hijau_7.mp3"
  },
  {
    "id": 63,
    "titleEn": "When Approaching Marwah Hill",
    "titleMy": "Ketika Menaiki Bukit Marwah",
    "doa": [
      {
        "id": 1,
        "arabic": "إِنَّ الصَّفَا وَالْمَرْوَةَ مِنْ شَعَائِرِ اللهِ فَمَنْ حَجَّ البَيتَ اَواعْتَمَرَ فَلَا جُنَاحَ عَلَيْهِ أَنْ يَطَّوَّفَ بِهِمَا، وَمَنْ تَطَوَّعَ خَيْرًا فَإِنَّ اللَّهَ شَاكِرٌ عَلَيْمٌ",
        "translationEn": "Indeed, Safa and Marwah are from the symbols of Allah's religion and so there is no sin upon those who perform haj or umrah to go between them and he who does good voluntarily, let him be informed that Allah is All-Appreciative and All-Knowing.",
        "translationMy": "Sesungguhnya Safa dan Marwah itu adalah sebagai tanda-tanda kebesaran Allah. Barangsiapa yang menunaikan ibadat haji dan umrah ke Baitullah, maka tiada salahnya untuk berjalan di antara keduanya, dan barang siapa yang berbuat baik dengan suka rela, maka sesungguhnya Allah Maha Menerima dan Maha Mengetahui."
      }
    ],
    "categoryKey": [
      "sa'i"
    ],
    "audio": "doa_naik_bukit_safa_marwah.mp3"
  },
  {
    "id": 64,
    "titleEn": "After Completing Sa'i At Marwah",
    "titleMy": "Setelah Selesai Sa'i Di Atas Bukit Marwah",
    "doa": [
      {
        "id": 1,
        "arabic": "رَبَّنَا تَقَبَّلْ مِنَّا وَعَافِنَا وَاعْفُ عَنَّا، وَعَلَى طَاعَتِكَ وَشُكْرِكَ أَعِنَّا، وَعَلَى غَيْرِكَ\nلَا تَكِلْنَا وَعَلَى الْإِيْمَانِ وَالْإِسْلَامِ الْكَامِلِ جَمْعًا تَوَفَّنَا وَأَنْتَ رَاضٍ عَنَّا\nاَللّٰهُمَّ ارْحَمْنِيْ بِتَرْكِ الْمَعَاصِي مَا أَبْقَيْتَنِي، وَارْحَمْنِي أَنْ أَتَكَلَّفَ مَا لَا يَعْنِينِي\nوَارْزُقْنِي حُسْنَ النَّظَرِ فِيْمَا يُرْضِيْكَ عَنِّي، يَا أَرْحَمَ الرَّاحِمِيْنَ",
        "translationEn": "Our Lord, accept from us, grant us well-being, and pardon us. Help us to obey You and to give thanks to You. Do not let us depend on anyone else but You. Cause us all to die upon complete faith and Islam, while You are pleased with us. O Allah, have mercy on me by enabling me to abandon sins for as long as You grant me life and have mercy on me by sparing me from burdening myself with what does not concern me. Grant me sound judgment in that which pleases You regarding me, O Most Merciful of those who show mercy.",
        "translationMy": "Ya Tuhan, kami memohon diterima doa kami. Afiatkanlah dan ampunilah kami. Berilah pertolongan kepada kami untuk taat dan bersyukur kepada Engkau. Janganlah membiarkan kami bergantung kepada yang lain, selain dari Engkau. Matikanlah kami di dalam iman dan Islam yang sempurna, sedang Engkau reda kepada kami. Ya Allah, Ya Tuhan, peliharalah diriku dengan meninggalkan segala kejahatan selama hidupku, dan peliharalah aku supaya tidak membuat perkara yang tidak memberi guna, dan kurniakanlah kepadaku elok pandangan pada perkara-perkara yang membawa keredaan Engkau wahai Tuhan yang bersifat Amat Belas Kasihan."
      }
    ],
    "categoryKey": [
      "sa'i"
    ],
    "audio": "doa_selesai_sai.mp3"
  },
  {
    "id": 65,
    "titleEn": "While Shaving/Shortening",
    "titleMy": "Ketika Bercukur/Bergunting",
    "doa": [
      {
        "id": 1,
        "arabic": "اَللهُ أَكْبَرُ، اَللَّهُ أَكْبَرُ، اَللهُ أَكْبَرُ، اَللّٰهُمَّ هَذِهِ نَاصِيَتِي بِيَدِكَ. فَاجْعَلْ لِي بِكُلِّ شَعْرَةٍ نُوْرًا يَوْمَ الْقِيَامَةِ، وَاغْفِرْلِي ذَنْبِي يَا وَاسِعَ الْمَغْفِرَةِ. آمِين",
        "translationEn": "Allah is the Greatest, Allah is the Greatest, Allah is the Greatest. O Allah, this forelock of mine is in Your Hand. So grant me, for every hair, a light on the Day of Resurrection, and forgive my sins, O Vast in forgiveness. Amin.",
        "translationMy": "Allah Maha Besar, Allah Maha besar, Allah Maha Besar. Ya Allah, ubun-ubun kepalaku ini di dalam kekuasaanMu, maka jadikanlah setiap helai rambut suatu cahaya di hari kiamat. Dan ampunkanlah dosaku Ya Tuhan Yang Maha Luas PengampunanNya. Amin"
      }
    ],
    "categoryKey": [
      "tahalul"
    ],
    "audio": "doa_ketika_bercukur.mp3"
  },
  {
    "id": 66,
    "titleEn": "After Shaving/Shortening",
    "titleMy": "Setelah Bercukur/Bergunting",
    "doa": [
      {
        "id": 1,
        "arabic": "اَلحَمْدُ لِلَّهِ الَّذِي قَضَى عَنِّيْ نُسُكِي، اَللّٰهُمَّ آتِنِي بِكُلِّ شَعْرَةٍ حَسَنَةً \nوَامْحُ عَنِّي بِهَا سَيِّئَةً، وَارْفَعْ لِي بِهَا دَرَجَةً، وَاغْفِرْ لِي وَلِلْمُحَلِّقِيْنَ وَالْمُقَصِّرِينَ \nوَجَمِيعِ الْمُسْلِمِيْنَ، اَللّٰهُمَّ زِدْنَا إِيْمَانًا وَيَقِيْنًا وَتَوْفِيقًا وَعَوْنًا وَاغْفِرْلَنَا\nوَلِآبَائِنَا وَأُمَّهَاتِنَا وَصَلَّى اللهُ عَلَى سَيِّدِنَا مُحَمَّدٍ وَعَلَى آلِهِ وَصَحْبِهِ وَسَلَّمَ",
        "translationEn": "All praise is due to Allah, who has enabled me in fulfilling this worship (Hajj or Umrah). O Allah, grant me for every hair a good deed and erase from me a bad deed with every strand and raise me in rank with every strand and forgive me, those who shave and those who cut their hair and all Muslims. O Allah, increase us in faith, certainty, guidance, and assistance. And forgive us and forgive our fathers and our mothers. And may Allah's blessings be upon our leader Prophet Muhammad s.a.w.  along with his family and companions.",
        "translationMy": "Segala puji bagi Allah, yang telah menolongku menunaikan ibadatku ini (haji atau umrah). Ya Allah berilah aku satu kebaikan dengan setiap helai rambut ini, dan padamkanlah dengannya satu kejahatan. Dan angkatkan aku dengannya satu darjat. Ampunkanlah aku dan sekelian yang bercukur dan yang bergunting dan sekelian muslimin. Ya Allah, tambahkanlah kami dengan keimanan, keyakinan, taufik dan pertolongan. Dan ampunilah kami serta ibu bapa kami, selawat Allah ke atas penghulu kami Nabi Muhammad s.a.w. berserta keluarga dan sahabatnya."
      }
    ],
    "categoryKey": [
      "tahalul"
    ],
    "audio": "doa_setelah_bercukur.mp3"
  },
  {
    "id": 17,
    "titleEn": "Tawaf Wada' Intention",
    "titleMy": "Niat Tawaf Wadak",
    "doa": [
      {
        "id": 1,
        "arabic": "نَوَيْتُ أَن أَطُوفَ طَوَافَ الوَدَاعِ سَبعَةَ أَشوَاطٍ لِلّٰهِ تَعَالَى",
        "translationEn": "I intend to perform tawaf wada', seven rounds for the sake of Allah Most High",
        "translationMy": "Sahaja aku berniat mengerjakan tawaf wadak tujuh pusingan kerana Allah Ta’ala"
      }
    ],
    "categoryKey": [
      "tawaf wadak"
    ],
    "audio": "niat_tawaf_wada.mp3"
  },
  {
    "id": 86,
    "titleEn": "Before Tawaf Wada'",
    "titleMy": "Sebelum Tawaf Wadak",
    "doa": [
      {
        "id": 1,
        "arabic": "اَللّٰهُمَّ إِنِّي أُرِيدُ طَوَافَ بَيتِكَ الحَرَامِ فَيَسِّرهُ لِي وَ تَقَبَّلهُ مِنِّي",
        "translationEn": "O Allah, I am about to perform tawaf around Your holy house, so give me ease and accept it from me.",
        "translationMy": "Ya Allah, sesungguhnya aku hendak mengerjakan tawaf mengelilingi rumahMu yang suci, maka berikanlah aku kemudahan dan terimalah ia daripadaku."
      }
    ],
    "categoryKey": [
      "tawaf wadak"
    ],
    "audio": "doa_sebelum_memulakan_tawaf.mp3"
  },
  {
    "id": 67,
    "titleEn": "At Every Round ",
    "titleMy": "Di Semua Pusingan",
    "doa": [
      {
        "id": 1,
        "arabic": "بِسْمِ اللَّهِ، اَللَّهُ أَكْبَرُ، سُبْحَانَ اللَّهِ وَالْحَمْدُ لِلَّهِ وَلَا إِلٰهَ إِلَّا اللَّهُ، وَاللَّهُ أَكْبَرُ\n وَلَا حَوْلَ وَلَا قُوَّةَ إِلَّا بِاللَّهِ العَلِيِّ الْعَظِيمِ، وَالصَّلَاةُ وَالسَّلَامُ عَلَى رَسُولِ اللَّهِ\nصَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ، اَللَّهُمَّ إِيمَانًا بِكَ وَتَصْدِيْقًا بِكِتَابِكَ، وَوَفَاءً بِعَهْدِكَ\nوَاتِّبَاعًا لِسُنَّةِ نَبِيِّكَ مُحَمَّدٍ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ، إِنَّ الَّذِي فَرَضَ عَلَيْكَ القُرْآنَ\nلَرَآدُّكَ إِلَى مَعَادٍ، يَا مُعِيدُ أَعِدنِي، وَيَا سَمِيعُ اِسْمَعنِي، يَا جَبَّارُ اجْبُرْنِي\nيَا سَتَّارُ اسْتُرْنِي يَا رَحْمَنُ، ارْحَمْنِي يَا رَدَّادُ ارْدُدْنِي إِلَى بَيْتِكَ هَذَا وَارْزُقْنِي الْعَوْدَ\nثُمَّ الْعَوْدَ كَرَّاتٍ بَعْدَ مَرَّاتٍ. تَائِبُونَ عَابِدُونَ سَائِحُونَ لِرَبِّنَا حَامِدُونَ\nصَدَقَ اللَّهُ وَعْدَهُ، وَنَصَرَ عَبْدَهُ وَهَزَمَ الْأَحْزَابَ وَحْدَهُ\n،اللَّهُمَّ احْفَظْنِي عَنْ يَمِينِي وَعَنْ يَسَارِي وَمِنْ قُدَّامِي وَمِنْ وَرَاءِ ظَهْرِي\nوَمِنْ فَوْقِي وَمِنْ تَحْتِي حَتَّى تُوَصِّلَنِي إِلَى أَهْلِي وَبَلَدِي\nاللَّهُمَّ هَوِّنْ عَلَيْنَا السَّفَرَ وَاطْوِ لَنَا الْأَرْضَ اللَّهُمَّ أَصْحِبْنَا فِي سَفَرِنَا\nوَاخْلُفْنَا فِي أَهْلِنَا يَا أَرْحَمَ الرَّاحِمِينَ وَيَا رَبَّ الْعَالَمِينَ",
        "translationEn": "In the name of Allah, Allah is the Greatest. Glory be to Allah and all praise is due to Allah. There is no god except Allah, and Allah is the Greatest. There is no power and no strength except by the permission of Allah, the Most High, the Most Great. And blessings and peace be upon the Messenger of Allah, peace be upon him. O Allah, I come here because of my faith in You and trust in Your book, fulfilling Your Covenant and following the Sunnah of Your Prophet Muhammad, peace be upon him. Indeed, He who imposed the Qur’an upon you will surely return you to a place of return. O the One who brings us back, bring me back again, O All-Hearing, hear me, O The Almighty, strengthen me, O Concealer, cover my faults, O Most Merciful, have mercy on me. O the One who returns, return me to this House of Yours and grant me the chance to return again, then again, time after time, repentant, devoted in worship, journeying in a state of praising You. Allah fulfils His Promises, helps His servants and destroy His enemies, alone. O Allah, protect me on my right and on my left, from before me and from behind me, from above me and from beneath me, until You deliver me safely to my family and my homeland. O Allah, make this journey easy for us, and fold for us this earth. O Allah, accompany us on our journey and look after those we leave behind among our families. O Most Merciful of those who show mercy, O Lord of all the worlds.",
        "translationMy": "Dengan nama Allah, Allah Maha Besar. Allah Maha Suci, dan segala puji bagi Allah. Tiada Tuhan kecuali Allah dan Allah Maha Besar. Tiada upaya dan tiada kekuatan kecuali dengan izin Allah Yang Maha Tinggi dan Maha Agong. Selawat dan salam bagi Rasulullah s.a.w. Ya Allah, aku datang ke sini kerana beriman kepadaMu dan mempercayai kitabMu, memenuhi janjimu dan kerana mengikut sunnah NabiMu, Muhammad s.a.w. Sesungguhnya Tuhan yang menurunkan kepadamu Al-Quran akan mengembalikan ke tempatmu. Ya Tuhan Yang Maha Mengembalikan, kembalikanlah aku. Ya Tuhan Yang Maha Mendengar, dengarkanlah aku. Ya Tuhan Yang Maha Perkasa, kuatkanlah aku. Wahai Tuhan Yang Maha Menutup, tutuplah aibku. Wahai Tuhan Yang Maha Pengasih, kasihilah aku. Wahai Tuhan Yang Maha Mengembalikan, kembalikanlah aku ke KaabahMu ini dan anugerahilah aku kesempatan untuk kembali, dan Kembali berulang-ulang kembali, bertaubat, beribadat, mengembara dalam keadaan memujiMu. Allah Maha Menepati janji dan membantu hambaNya, dan menghancurkan musuh, sendiri sahaja. Ya Allah, peliharalah aku dari kanan, dan kiri, dan dari hadapan, dan dari belakang, dan dari atas, dan dari bawah, sehingga Engkau sampaikan aku kepada keluargaku dan negeriku. Ya Allah, ringankanlah bagi kami perjalanan ini, dan lipatkanlah bagi kami bumi ini. Ya Allah, sertailah kami dalam perjalanan kami, dan peliharalah keluarga kami, wahai Tuhan Yang Maha Penyayang, Ya Tuhan Pemelihara alam semesta.\n"
      }
    ],
    "categoryKey": [
      "tawaf wadak"
    ],
    "audio": "doa_tawaf_wadak.mp3"
  },
  {
    "id": 68,
    "titleEn": "Sunnah Prayer After Tawaf Intention ",
    "titleMy": "Niat Solat Sunnah Tawaf",
    "doa": [
      {
        "id": 1,
        "arabic": "اُصَلِّي سُنَّةَ الطَّوَافِ رَكْعَتَيْنِ لِلّٰهِ تَعَالٰى",
        "translationEn": "I intend to pray two raka’at of sunnah Tawaf for the sake of Allah Most High",
        "translationMy": "Sahaja aku solat sunat tawaf dua rakaat kerana Allah Taala"
      }
    ],
    "categoryKey": [
      "tawaf wadak"
    ],
    "audio": "niat_solat_sunnat_tawaf.mp3"
  },
  {
    "id": 69,
    "titleEn": "After Tawaf Wada' Prayer",
    "titleMy": "Setelah Solat Sunnah Tawaf Wadak",
    "doa": [
      {
        "id": 1,
        "arabic": "اَللَّهُمَّ إِنَّ البَيْتَ بَيْتُكَ وَالْعَبْدَ عَبْدُكَ وَابْنُ عَبْدِكَ وَابْنُ أَمَتِكَ\nحَمَلْتَنِي عَلَى مَا سَخَّرْتَنِيْ لِيْ مِنْ خَلْقِكَ حَتَّى سَيَّرْتَنِيْ فِيْ بِلَادِكَ\nوَبَلَغْتَنِيْ بِنِعْمَتِكَ حَتَّى أَعَنْتَنِيْ عَلَى قَضَاءِ مَنَاسِكِكَ\nفَإِنْ كُنْتَ رَضِيْتَ عَنِّيْ فَازْدَدْ عَنِّيْ رِضَا\nوَإِلَّا فَمُنَّ الْآنَ قَبْلَ تَبَاعُدِيْ عَنْ بَيْتِكَ هٰذَا أَوَانُ انْصِرَافِيْ\nإِنْ أَذِنْتَ لِيْ غَيْرَ مُسْتَبْدِلٍ بِكَ وَلَا بِبَيْتِكَ وَلَا رَاغِبٍ عَنْكَ\nوَلَا عَنْ بَيْتِكَ، اَللّٰهُمَّ أَصْحِبْنِيَ الْعَافِيَةَ فِي بَدَنِيْ وَالْعِصْمَةَ فِيْ دِيْنِيْ\nوَأَحْسِنْ مُنْقَلَبِيْ وَارْزُقْنِيْ طَاعَتَكَ مَا أَبْقَيْتَنِيْ\nوَاجْمَعْ لِيْ خَيْرَيِ الدُّنْيَا وَالْآخِرَةِ، إِنَّكَ عَلَى كُلِّ شَيْءٍ قَدِيرٌ\nاَللّٰهُمَّ لَا تَجْعَلْ هَذَا آخِرَ الْعَهْدِ بِبَيْتِكَ الْحَرَامِ\nوَإِنْ جَعَلْتَهُ آخِرَ عَهْدِيْ فَعَوِّضْنِيْ عَنْهُ الْجَنَّةَ\nبِرَحْمَتِكَ يَا أَرْحَمَ الرَّاحِمِينَ، آمِيْنَ يَا رَبَّ الْعَالَمِيْنَ",
        "translationEn": "O Allah, indeed this house is Your House, and I am Your servant, the child of your male and female servants. You brought me by the means of transportation that You made easy for me, until You brought me to this land of Yours and by Your grace You brought me here, until You aided me in completing Your rites. If You are pleased with me, then increase Your pleasure with me and if not, then bestow Your favour upon me now, before I depart from Your House, for this is the time of my departure. I depart only with Your permission, not preferring anyone over You, nor Your House, nor turning away from You or from Your House. O Allah, grant me well-being in my body, safeguard for me my religion, make my return a good one, and grant me obedience to You for as long as You grant me life. And gather for me the good of this world and the Hereafter. Indeed, You have power over all things. O Allah, do not make this the last of my visits to Your Sacred House and if You decree that it be my last visit, then compensate me for it with Paradise, by Your mercy, O Most Merciful of those who show mercy. Amin, O Lord of all the worlds.",
        "translationMy": "Ya Allah, rumah ini rumahMu, dan hamba Adalah hambaMu, anak hambaMu yang lelaki dan hambaMu yang perempuan, Engkau bawa aku dengan kenderaan yang Engkau mudahkan bagiku, sehingga Engkau jalankan aku di negeriMu ini, dan Engkau sampaikan aku dengan nikmatMu, sehingga Engkau tolong aku untuk melaksanakan ibadah Haji (atau Umrah). Jika Engkau reda kepadaku, maka tambahilah bagiku redaMu. Jika tidak, maka sejak dari sekarang, redakanlah aku sebelum aku jauh dari rumahMu. Sekarang waktuku untuk pulang jika Engkau izinkan bagiku, tanpa menukar sesuatu untuk Engkau dan juga tidak dengan rumahMu, serta tidak benci kepada rumahMu. Ya Allah, dampingilah tubuhku dengan kesihatan, dan bentengi agamaku, dan baikkan kepulanganku. Kurniailah aku ketaatan kepadaMu selama-lamanya. Selama Engkau biarkan aku hidup, maka kumpulkanlah bagiku kebaikan di dunia dan di akhirat. Ya Allah, sesungguhnya Engkau Maha Kuasa atas segala-galanya. Ya Allah, janganlah jadikan ini akhir kesempatan bagiku kebaikan di dunia dan di akhirat. Ya Allah, sesungguhnya Engkau Maha Kuasa atas segala-galanya. Ya Allah, janganlah jadikan ini akhir bagiku di rumahMu yang mulia ini. Bila Engkau jadikan kesempatan yang terakhir bagiku, maka gantilah ia dengan syurga dan rahmatMu, wahai Yang Maha Pengasih dan Penyayang. Perkenankanlah ya Tuhan seru sekelian alam."
      }
    ],
    "categoryKey": [
      "tawaf wadak"
    ],
    "audio": "doa_selepas_selesai_tawaf_wadak.mp3"
  },
  {
    "id": 70,
    "titleEn": "Upon Seeing Madinah",
    "titleMy": "Apabila Kelihatan Kota Madinah",
    "doa": [
      {
        "id": 1,
        "arabic": "اَللّٰهُمَّ إِنَّ هٰذَا حَرَمُ نَبِيِّكَ، وَقَدْ حَرَّمْتَهُ عَلَى لِسَانِهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ\nفَاجْعَلْهُ وِقَايَةً لِيْ مِنَ النَّارِ، وَأَمَانًا مِنْ سُوْءِ الْحِسَابِ",
        "translationEn": "O Allah, these are the sacred precincts of Your Prophet s.a.w., and You have declared it sacred through his words  s.a.w. Therefore, I ask by its honour, make it for me a protection from the fire and a sanctuary against evil reckoning on the Day of Judgment.",
        "translationMy": "Ya Tuhanku, sesungguhnya tanah haram ini tempat Nabi Engkau Muhammad s.a.w., dan Engkau telah menjadikan ia Tanah Haram menerusi kenyataan lisan Nabi Engkau s.a.w. maka aku mohonkan dengan kemuliaannya, jadikanlah ia sebagai perisai bagi diriku daripada api neraka dan keamanan daripada perhitungan yang tidak baik pada hari kiamat."
      }
    ],
    "categoryKey": [
      "madinah"
    ],
    "audio": "doa_ketika_melihat_kota_madinah.mp3"
  },
  {
    "id": 71,
    "titleEn": "Upon Entering Nabawi Mosque",
    "titleMy": "Ketika Masuk Masjid Nabawi",
    "doa": [
      {
        "id": 1,
        "arabic": "بِسْمِ اللَّهِ وَعَلَى مِلَّةِ رَسُوْلِ الله رَبِّ أَدْخِلْنِي مُدْخَلَ صِدْقٍ\nوَأَخْرِجْنِي مُخْرَجَ صِدْقٍ، وَاجْعَلْ لِي مِنْ لَدُنْكَ سُلْطَانًا نَصِيرًا\nاَللّٰهُمَّ صَلِّ وَسَلَّمْ عَلَى سَيِّدِنَا مُحَمَّدٍ وَعَلَى آلِ سَيِّدِنَا مُحَمَّدٍ\nوَاغْفِرْ لِي ذُنُوبِي، وَافْتَحْ لِي أَبْوَابَ رَحْمَتِكَ وَأَدْخِلْنِي فِيْهَا، يَا أَرْحَمَ الرَّاحِمِينَ",
        "translationEn": "In the name of Allah, and upon the religion of the Messenger of Allah. O my Sustainer, let my entry be by the gate of truth and let my exit be by the gate of truth and grant me from Your Presence an authority to aid me. O Allah, send blessings and peace upon our master Prophet Muhammad and his family. And forgive my sins, open for me the doors of Your Mercy, and admit me into them, O Most Merciful of those who show mercy. ",
        "translationMy": "Dengan nama Allah, dan di atas agama Rasulullah. Ya Tuhanku, masukkanlah aku ke dalam pintu kebenaran, dan keluarkanlah aku ke pintu kebenaran. Ya Tuhanku, berikanlah kepadaku dari sisiMu hujah keterangan serta kekuasaan yang menolongku. Ya Allah, Ya Tuhanku selawat dan rahmat ke atas junjungan kami Nabi Muhammad s.a.w. dan keluarganya. Ampunilah dosa-dosaku dan bukakanlah pintu-pintu rahmatMu, dan masukkan daku kedalamnya wahai Tuhan Yang Amat Mengasihani."
      }
    ],
    "categoryKey": [
      "madinah"
    ],
    "audio": "upon_entering_masjid_nabawi.mp3"
  },
  {
    "id": 72,
    "titleEn": "At Raudah",
    "titleMy": "Ketika Di Raudah",
    "doa": [
      {
        "id": 1,
        "arabic": "اَللّٰهُمَّ إِنَّ هَذِهِ رَوْضَةٌ مِنْ رِيَاضِ الْجَنَّةِ شَرَّفْتَهَا وَكَرَّمْتَهَا وَنَوَّرْتَهَا\nبِنُوْرِ نَبِيِّكَ وَحَبِيْبِكَ مُحَمَّدٍ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ\nفَاحْشُرْنِي فِي زُمْرَتِهِ وَأَمِتْنِي عَلَى مَحَبَّتِهِ وَسُنَّتِهِ، وَاسْقِنِي مِنْ حَوْضِهِ\nوَبِيَدِهِ الشَّرِيفَةِ شَرْبَةً هَنِيئَةً لَا أَظْمَأُ بَعْدَهَا أَبَدًا، إِنَّكَ عَلَى كُلِّ شَيْءٍ قَدِيرٌ\nوَصَلَّى اللَّهُ عَلَى سَيِّدِنَا مُحَمَّدٍ وَعَلَى آلِهِ وَصَحْبِهِ وَسَلَّمَ وَالْحَمْدُ للهِ رَبِّ الْعَالَمِينَ",
        "translationEn": "O Allah, indeed this is a garden from the gardens of Paradise. You have honoured it, ennobled it, and illuminated it with the light of Your Prophet and beloved, Muhammad s.a.w. So gather me among his company, cause me to die upon love for him and adherence to his Sunnah, and give me to drink from his Basin, by his noble hand, a satisfying drink after which I will never thirst again. Indeed, You have Power over all things. And may Allah send blessings upon our master Muhammad, and upon his family and his companions, and all praise is for Allah, Lord of all the worlds.",
        "translationMy": "Ya Allah, sesungguhnya inilah satu dari taman-taman syurga yang telah Engkau muliakan dan Engkau terangi dengan cahaya NabiMu dan kekasihMu Muhammad s.a.w. Maka himpunkanlah aku di dalam kumpulannya, dan matikanlah aku atas kecintaannya, kepadanya dan atas sunnahnya. Dan berikanlah aku minum dari telaganya dan dari tangannya yang mulia dengan minuman yang memuaskan, yang tidak akan haus lagi selepasnya. Sesungguhnya Engkau Amat Berkuasa atas segala sesuatu. Selawat Allah ke atas penghulu kami Nabi Muhammad beserta keluarga dan sahabatnya. Dan segala puji bagi Allah semesta alam."
      }
    ],
    "categoryKey": [
      "madinah"
    ],
    "audio": "doa_khas_di_raudah.mp3"
  },
  {
    "id": 73,
    "titleEn": "Salutations Upon Our Beloved Prophet s.a.w.",
    "titleMy": "Salam Kepada Baginda s.a.w.",
    "doa": [
      {
        "id": 1,
        "arabic": "اَلسَّلَامُ عَلَيْكَ أَيُّهَا النَّبِيُّ الْكَرِيمُ، وَالرَّسُوْلُ الْعَظِيمُ، وَالرَّءُوْفُ الرَّحِيمُ\nوَرَحْمَتُ اللَّهِ وَبَرَكَاتُهُ، اَلسَّلَامُ عَلَيْكَ يَا نَبِيَّ اللَّهِ\nاَلسَّلَامُ عَلَيْكَ يَا صَفْوَةَ خَلْقِ اللّٰهِ، اَلسَّلَامُ عَلَيْكَ يَا حَبِيْبَ اللهِ\nأَشْهَدُ أَنْ لَا إِلٰهَ إِلَّا اللهُ وَحْدَهُ لَا شَرِيكَ لَهُ، وَأَنَّكَ عَبْدُهُ وَرَسُوْلُهُ\nوَأَشْهَدُ أَنَّكَ بَلَّغْتَ الرِّسَالَةَ، وَأَدَّيْتَ الْأَمَانَةَ، وَنَصَحْتَ الْأُمَّةَ\nوَجَاهَدْتَ فِي سَبِيلِ اللَّهِ، فَصَلَّى عَلَيْكَ اللهُ، صَلَاةً دَائِمَةً إِلَى يَوْمِ الدِّيْنَ\nاَللّٰهُمَّ آتِهِ الْفَضِيلَةَ وَالدَّرَجَةَ الرَّفِيعَةَ وَابْعَثْهُ مَقَامًا مَحْمُوْدًا الَّذِي وَعَدْتَهُ\nإِنَّكَ لَا تُخْلِفُ الْمِيعَادَ",
        "translationEn": "Peace be upon you, O noble Prophet, exalted messenger, the kind, the compassionate. And may the mercy of Allah and His blessings be upon you. Peace be upon you, O Prophet of Allah. Peace be upon you, O chosen servant of Allah. Peace be upon you, O beloved of Allah. I bear witness that there is no deity worthy of worship except Allah, the One, with no partner, and that you are His servant and His Messenger. And I bear witness that you conveyed the message, fulfilled the trust, sincerely advised the ummah, and strove in the path of Allah. May Allah send blessings upon you, endlessly until the Day of Judgment. O Allah, grant him excellence and the highest rank, and raise him to the Praiseworthy Station which You have promised him. Indeed, You never fail in Your Promise. ",
        "translationMy": "Selamat sejahtera atas engkau wahai junjungan yang mulia, Rasul yang agung, yang pemurah, penyayang. Moga-moga dirahmati dan diberkati Allah atasnya. Selamat sejahtera wahai Nabi Allah. Selamat sejahtera wahai makhluk pilihan Allah. Selamat sejahtera wahai kekasih Allah. Aku bersaksi bahawa tiada Tuhan yang disembah melainkan Allah Yang Tunggal. Tiada sekutu bagiNya, dan sesungguhnya engkau adalah hambaNya dan RasulNya. Aku bersaksi bahawa engkau telah menyampaikan tanggungjawab kerasulan, dan telah menunaikan amanat, dan telah menasihatkan umat, dan telah berjihad ke jalan Allah. Maka Allah memberi selawat (rahmat) ke atasmu, berkekalan sehingga hari kiamat. Ya Allah, kurniakanlah kepada Junjungan akan kemuliaan, pangkat-pangkat dan darjat, serta anugerahkanlah kepadanya tempat yang terpuji yang Engkau telah janjikan. Sesungguhnya Engkau tidak sekali-kali memungkiri janji."
      }
    ],
    "categoryKey": [
      "madinah"
    ],
    "audio": "salam_to_rasulullah.mp3"
  },
  {
    "id": 74,
    "titleEn": "Salutations to Saiyidina Abu Bakar",
    "titleMy": "Salam Kepada Saiyidina Abu Bakar",
    "doa": [
      {
        "id": 1,
        "arabic": "اَلسَّلَامُ عَلَيْكَ يَا خَلِيْفَةَ رَسُوْلِ اللَّهِ\nاَلسَّلَامُ عَلَيْكَ يَا صَاحِبَ رَسُوْلِ اللَّهِ فِي الْغَارِ\nاَلسَّلَامُ عَلَيْكَ يَا أَمِيْنَهُ عَلَى الْأَسْرَارِ\nجَزَاكَ اللهُ عَنَّا أَفْضَلَ مَا جَزَى بِهِ إِمَامًا عَنْ أُمَّةِ نَبِيِّهِ\nفَلَقَدْ خَلَقْتَهُ أَحْسَنَ الْخَلْقِ، وَسَلَكْتَ طَرِيقَهُ وَمِنْهَا جَهُ خَيْرَ سُلُوْكٍ\nوَنَصَرْتَ الْإِسْلَامَ، وَوَصَلْتَ الْأَرْحَامَ، وَلَمْ تَزَلْ قَائِمًا بِالْحَقِّ أَتَاكَ الْيَقِينُ\nوَالسَّلَامُ عَلَيْكَ وَرَحْمَةُ اللهِ وَبَرَكَاتُهُ",
        "translationEn": "Peace be upon you, O Caliph of the Messenger of Allah s.a.w. Peace be upon you, O companion of the Messenger of Allah s.a.w in the cave of Thur. Peace be upon you, O the one entrusted with his secrets. May Allah reward you on our behalf with the best of what He rewards a leader on behalf of the nation of his Prophet. Verily, you have succeeded the Messenger of Allah s.a.w by performing your duties in the best manner, and you have sincerely followed his path, served Islam, and maintained the bonds of kinship and never ceased to stand for the truth until certainty (death) came to you. And may peace, mercy, and blessings from Allah be upon you.",
        "translationMy": "Salam sejahtera kepada tuan, wahai khalifah Rasulullah s.a.w. Salam sejahtera wahai teman Rasulullah s.a.w. di gua Thur. Salam sejahtera ke atas tuan yang setia menyimpan rahsia. Terimalah balasan daripada Tuhan, sebagai balasan ketua yang memimpin umat Nabinya. Bahawasanya tuan telah menggantikan Rasulullah s.a.w. dengan menjalankan tanggungjawab dengan sebaik-baiknya dan tuan telah mengikuti jalannya dengan bersungguh-sungguh, serta berkhidmat kepada agama Islam dan telah menyambungkan silaturrahim sehingga akhir hayat tuan. Maka terimalah balasan, dan selamat sejahtera dan rahmat dari Allah dan berkahNya."
      }
    ],
    "categoryKey": [
      "madinah"
    ],
    "audio": "salam_to_abu_bakar.mp3"
  },
  {
    "id": 75,
    "titleEn": "Salutations to Saiyidina Umar",
    "titleMy": "Salam Kepada Saiyidina Umar",
    "doa": [
      {
        "id": 1,
        "arabic": "اَلسَّلَامُ عَلَيْكَ يَا مُظْهِرَ الْإِسْلَامِ، اَلسَّلَامُ عَلَيْكَ يَا فَارُوْقُ\nاَلسَّلَامُ عَلَيْكَ يَا مَنْ نَطَقَ بِالصَّوَابِ\nكَفَلْتَ الْأَيْتَامَ، وَوَصَلْتَ الْأَرْحَامَ، وَقَوِيَ بِكَ الْإِسْلَامُ\nاَلسَّلَامُ عَلَيْكَ وَرَحْمَةُ اللهِ وَبَرَكَاتُهُ",
        "translationEn": "Peace be upon you, O one through whom Islam was made manifest. Peace be upon you, O al-Fārūq(the one who distinguishes between right and wrong). Peace be upon you, O one who spoke with what is right. You safeguarded the rights of orphans, upheld family ties, and through you Islam was strengthened. And may peace, mercy, and blessings from Allah be upon you.\n",
        "translationMy": "Salam sejahtera kepada tuan, wahai pengembang agama Islam. Salam sejahtera kepada tuan, wahai yang telah diberi gelaran Faruk (yang memutuskan antara yang benar dan yang salah). Salam sejahtera kepada tuan, yang sentiasa bercakap benar, serta memelihara hak anak yatim, dan menghubungkan kasih sayang. Maka dengan tuanlah agama Islam menjadi kuat. Maka terimalah salam sejahtera serta rahmat dari Allah dan berkahNya."
      }
    ],
    "categoryKey": [
      "madinah"
    ],
    "audio": "salam_to_umar.mp3"
  },
  {
    "id": 76,
    "titleEn": "Dua At The Prophet s.a.w's Tomb",
    "titleMy": "Doa Di Makam Nabi s.a.w",
    "doa": [
      {
        "id": 1,
        "arabic": "اَلْحَمْدُ لِلَّهِ رَبِّ الْعَالَمِينَ، اَللّٰهُمَّ صَلِّ وَسَلِّمْ عَلَى سَيِّدِنَا مُحَمَّدٍ\nوَعَلَى آلِهِ وَصَحْبِهِ، اَلسَّلَامُ عَلَيْكَ يَا سَيِّدِي يَا رَسُولَ اللَّهِ\nإِنَّ اللَّهَ أَنْزَلَ إِلَيْكَ كِتَابًا صَادِقًا قَالَ فِيْهِ\nوَلَوْ أَنَّهُمْ إِذْ ظَلَمُوا أَنْفُسَهُمْ جَآءُوكَ فَاسْتَغْفَرُوا اللَّهَ\nوَاسْتَغْفَرَلَهُمُ الرَّسُوْلُ لَوَجَدُوا اللَّهَ تَوَّابًا رَحِيمًا\nوَقَدْ جِئْتُكَ مُسْتَغْفِرًا مِنْ ذَنْبِي مُسْتَشْفِعًا بِكَ إِلَى رَبِّي\nفَاشْفَعْ لِيْ يَا شَفِيْعَ الْأُمَّةِ وَأَجِرْنِي مِنَ النَّارِ يَا نَبِيَّ الرَّحْمَةِ\nاَلصَّلَاةُ وَالسَّلَامُ عَلَيْكَ وَعَلَى سَائِرِ الْأَنْبِيَاءِ وَالْمُرْسَلِيْنَ\nوَالْحَمْدُ لِلَّهِ رَبِّ الْعَالَمِينَ",
        "translationEn": "All praise be to Allah, Lord of all the worlds. O Allah, send blessings and peace upon our master Muhammad, and upon his family and his companions. Peace be upon you, my master, O Messenger of Allah. Indeed, Allah has revealed to you a true Book, in which He has says: \"If only they came to you ˹O Prophet˺ after wronging themselves, seeking Allah’s forgiveness and the Messenger prayed for their forgiveness, they would have certainly found Allah ever Accepting of Repentance, Most Merciful.\". Indeed, I have come to you seeking forgiveness for my sins, seeking intercession through you with Allah, so intercede for me, O intercessor of the ummah, and grant me protection from the fire, O Prophet of mercy. Peace and blessings be upon you and upon all the Prophets and Messengers. And all praise is for Allah, Lord of all the worlds.\n",
        "translationMy": "Segala puji bagi Allah Tuhan semesta alam. Selawat dan salam ke atas junjungan Nabi Muhammad s.a.w. Salam sejahtera ke atasmu, wahai Penghulu, wahai Rasulullah s.a.w. Sesungguhnya Allah telah menurunkan kepadamu sebuah kitab yang benar, yang Dia telah berfirman di dalamnya: ''..dan jika mereka sesudah menzalimi diri mereka datang kepadamu, lalu mereka memohon ampun kepada Allah dan Rasul, juga mintakan ampun bagi mereka, nescaya mereka dapati Allah itu penerima taubat, penyayang...\". Sesungguhnya aku datang memohon ampun dari dosaku, memohon syafaat kepada Allah, dengan berkatmu, berilah syafaat itu untukku wahai Nabi yang memberi syafaat kepada umatnya, dan jauhkanlah aku dari neraka, wahai Nabi yang mempunyai belas kasihan. Selawat dan salam atasmu dan ke atas semua para Nabi dan Rasul. Dan segala puji bagi Allah Tuhan seru sekelian alam."
      }
    ],
    "categoryKey": [
      "madinah"
    ],
    "audio": "doa_di_makam_nabi.mp3"
  },
  {
    "id": 77,
    "titleEn": "Conveying Salutations Upon The Prophet s.a.w.",
    "titleMy": "Menyampaikan Salam Kepada Baginda s.a.w.",
    "doa": [
      {
        "id": 1,
        "arabic": "اَلسَّلَامُ عَلَيْكَ أَيُّهَا النَّبِيُّ وَرَحْمَةُ اللهِ وَبَرَكَاتُهُ، يَا سَيِّدِي يَا رَسُوْلَ اللهِ\nجِئتُكَ نائِبًا وَزَائِرًا عَنْ ......... مُسَلِّمًا عَنْهُ سَائِلًا مِنْكَ الشَّفَاعَةَ لَهُ\nفِي غُفْرَانِ ذُنُوْبِهِ، فَاشْفَعْ لَهُ عِنْدَ اللَّهِ يَا رَسُوْلَ اللهِ",
        "translationEn": "Peace be upon you, O Prophet, and the mercy of Allah and His blessings, O my master, O Messenger of Allah, I have come to greet you on behalf of __________ bin(ti) __________ ,conveying his/her salutations and seeking from you intercession for him/her in the forgiveness of his/her sins. So intercede for him/her before Allah, O Messenger of Allah.",
        "translationMy": "Salam sejahtera atasMu wahai Nabi, serta rahmat Allah dan berkatNya, Ya junjunganku, wahai Rasulullah, saya datang memberi salam kepada tuan daripada __________ bin __________ dia memohon syafaat daripadamu untuk mendapatkan pengampunan bagi dosanya, Berilah syafaat di sisi Allah kepadanya wahai Rasulullah."
      }
    ],
    "categoryKey": [
      "madinah"
    ],
    "audio": "sampaikan_salam.mp3"
  },
  {
    "id": 78,
    "titleEn": "Visiting Al Baqi' Graveyard",
    "titleMy": "Di Perkuburan Baqi'",
    "doa": [
      {
        "id": 1,
        "arabic": "اَلسَّلَامُ عَلَيْكُمْ دَارَ قَوْمٍ مُؤْمِنِيْنَ، وَإِنَّا إِنْ شَاءَ اللهُ بِكُمْ لَاحِقُوْنَ\nأَنْتُمْ سَلَفُنَا وَنَحْنُ بِالْأَثَرِ، يَغْفِرُ اللهُ لَنَا وَلَكُمْ\nوَيَرْحَمُ اللَّهُ الْمُسْتَقْدِمِيْنَ مِنْكُمْ وَالْمُسْتَأْخِرِيْنَ\nاَللّٰهُمَّ لَا تَحْرِمْنَا أَجْرَهُمْ وَلَا تَفْتِنَا بَعْدَهُمْ وَاغْفِرْلَنَا وَلَهُمْ\nاَللّٰهُمَّ اغْفِرْ لِأَهْلِ الْبَقِيْعِ الْغَرْقَدِ",
        "translationEn": "Peace be upon you all, O dwellers of the abode of the believers and we would be joining you with Allah's will. You have gone before us, and we are following in your footsteps. May Allah forgive us as and you. And may Allah bestow His mercy upon the first (to be buried) and the last among you. O Allah, do not deprive us of their rewards and do not put us to trial after them, and forgive us and them. Forgive us our sins and their sins and forgive the people of Baqi Al-Gharkadi.",
        "translationMy": "Salam sejahtera di atas kamu wahai tempat tinggal orang-orang yang beriman. Sesungguhnya kami akan mengikut  kamu. Kamu adalah orang-orang yang terdahulu daripada kami, dan kami adalah pengikut kamu. Mudah-mudahan Allah mengampunkan kami juga kamu, dan mengasihani mereka yang dahulu-dahulu dan mereka yang terkemudian. Ya Allah, janganlah Engkau kecewakan kami daripada mendapat pahala amalan mereka dan janganlah Engkau fitnahkan kami selepas mereka. Ampunilah dosa kami dan dosa mereka serta ampunilah dosa ahli Baqi al-Gharkadi."
      }
    ],
    "categoryKey": [
      "madinah"
    ],
    "audio": "di_baqi.mp3"
  },
  {
    "id": 79,
    "titleEn": "At Historic Mosques Around Madinah",
    "titleMy": "Di Masjid-Masjid Bersejarah Di Sekitar Madinah",
    "doa": [
      {
        "id": 1,
        "arabic": "اَللّٰهُمَّ رَبَّنَا تَقَبَّلْ مِنَّا وَعَافِنَا وَاعْفُ عَنَّا، اَللّٰهُمَّ تَوَفَّنَا مُسْلِمِينَ\nوَأَحْيِنَا مُسْلِمِيْنَ، وَاَلْحِقْنَا بِالصَّالِحِيْنَ، اَللّٰهُمَّ إِنِّي أَوْدَعْتُ هَذَا الْمَحَلَّ الشَّرِيفَ\nمِنْ يَوْمِنَا هَذَا إِلَى يَوْمِ الْقِيَامَةِ خَالِصًا مُخْلِصًا\nأَشْهَدُ أَنْ لَا إِلَهَ إِلَّا اللَّهُ\nوَأَنَّ مُحَمَّدًا عَبْدُهُ وَرَسُوْلُهُ\n(اَلْفَاتِحَة)",
        "translationEn": "O Allah, our Lord, accept from us, grant us wellbeing and pardon us. O Allah, cause us to die as Muslims and let us live as Muslims, and join us with the righteous. O Allah, my Lord, I entrust this sacred place to You from this day until the Day of Judgment, with sincerity and pure devotion. I bear witness that there is no god but Allah, and indeed Muhammad is His servant and Messenger. (AI-Fatihah)",
        "translationMy": "Ya Allah. Ya Tuhan kami. Perkenankanlah doa kami, afiatkanlah kami, maafkanlah kesalahan kami, matikanlah kami di dalam Islam, hidupkanlah kami di dalam Islam, himpunkanlah kami dengan orang-orang yang soleh. Ya Allah. Ya Tuhan aku abadikan tempat yang suci ini daripada hari ini sehingga hari kiamat, dengan ikhlas dan jujur. Aku bersaksi tiada tuhan melainkan Allah dan sesungguhnya Nabi Muhammad hambaNya dan PesuruhNya. (AI-Fatihah)"
      }
    ],
    "categoryKey": [
      "madinah"
    ],
    "audio": "doa_kpd_Rasulullah_saw_ketika_ziarahi_masjid_masjid_d_madinah.mp3"
  },
  {
    "id": 80,
    "titleEn": "Visiting Uhud And the Tombs of the Matyrs",
    "titleMy": "Di Perkuburan Syuhada’ Uhud",
    "doa": [
      {
        "id": 1,
        "arabic": "اَلسَّلَامُ عَلَيْكَ يَا حَمْزَةُ عَمَّ رَسُوْلِ اللَّهِ، اَلسَّلَامُ عَلَيْكَ يَا سَيِّدَ الشُّهَدَاءِ\nاَلسَّلَامُ عَلَيْكَ يَا أَسَدَ اللهِ وَأَسَدَ رَسُوْلِهِ\nاَلسَّلَامُ عَلَيْكَ يَا عَبْدَ اللَّهِ بِنْ جَحْشٍ، اَلسَّلَامُ عَلَيْكَ يَا مُصْعَبَ بْنَ عُمَيْرِ\nاَلسَّلَامُ عَلَيْكُمْ يَا شُهَدَاءَ أَحُدٍ، اَلسَّلَامُ عَلَيْكُمْ بِمَا صَبَرْتُمْ فَنِعْمَ عُقْبَى الدَّارِ\nاَللّٰهُمَّ اجْزِهِمْ عَنِ الْإِسْلَامِ وَأَهْلِهِ أَفْضَلَ الْجَزَاءِ\nوَأَجْزِلْ ثَوَابَهُمْ وَأَكْرِمْ مَقَامَهُمْ وَارْفَعْ دَرَجَاتِهِمْ بِمَنِّكَ وَكَرَمِكَ\nيَا أَكْرَمَ الْأَكْرَمِيْنَ",
        "translationEn": "Peace be upon you, O Saiyidina Hamzah, uncle of the Messenger s.a.w, peace be upon you, O leader of the martyrs, peace be upon you, O Lion of Allah and the Lion of the Messenger of Allah. Peace be upon you, O Saiyidina Abdullah bin Jahsyi, peace be upon you, O Saiyidina Musab bin Umayr, peace be upon you, O matyrs of Uhud, peace be upon you, for your patience in facing the enemy to uphold the truth of Islam, how excellent is the ultimate abode. O Allah, reward them on behalf of Islam and its people with the best of reward. Grant them abundant reward, honour and raise their ranks by Your grace and generosity, O Most Generous of the generous.",
        "translationMy": "Salam sejahtera atas engkau wahai Saiyidina Hamzah, bapa saudara Rasulullah s.a.w., salam sejahtera atas engkau wahai penghulu bagi para syahid, salam sejahtera atas engkau singa Allah dan singa Rasulullah. Salam sejahtera atas engkau wahai Saiyidina Abdullah bin Jahsyi, salam sejahtera atas engkau wahai Saiyidina Musab bin Omair, Salam sejahtera atas kamu wahai orang-orang yang mati di dalam peperangan Uhud, Salam sejahtera atas kamu, atas kesabaran kamu menghadapi musuh untuk menegakkan kebenaran Islam, iaitu sebaik-baik balasan yang akan kamu terima dari Allah. Ya Allah Ya Tuhanku, gandakanlah pahala amalan mereka, yang telah mereka lakukan untuk kesucian agama Islam dan pemeluk-pemeluknya. Tinggikan pangkat dan darjat mereka dengan kemurahan Engkau wahai Tuhan Yang Amat Pemurah."
      }
    ],
    "categoryKey": [
      "madinah"
    ],
    "audio": "salam_dan_doa_d_perkuburan_syuhada_uhud.mp3"
  },
  {
    "id": 81,
    "titleEn": "Farewell Ziarah ",
    "titleMy": "Ziarah Wadak",
    "doa": [
      {
        "id": 2,
        "arabic": "اَللّٰهُمَّ لَا تَجْعَلْهُ آخِرَ الْعَهْدِ مِنْ هَذَا الْمَكَانِ الشَّرِيفِ\nوَارْزُقْنِيْ إِلَيْهِ الْعَوْدَةَ فِي خَيْرٍ وَعَافِيَةٍ وَصِحَّةٍ وَسَلَامَةٍ\nإِنْ عِشْتُ إِنْ شَاءَ اللهُ جِئْتُ، وَإِنْ مُتُّ أَوْدَعْتُ عِنْدَكَ شَهَادَتِيْ\nوَأَمَانَتِيْ وَعَهْدِيْ وَمِيْثَاقِيْ مِنْ يَوْمِنَا هَذَا إِلَى يَوْمِ الْقِيَامَةِ\nوَهِيَ شَهَادَةُ أَنْ لَا إِلٰهَ إِلَّا اللَّهُ وَحْدَهُ لَا شَرِيكَ لَهُ\nوَشَهَادَةُ أَنَّ مُحَمَّدًا عَبْدُهُ وَرَسُوْلُهُ\nسُبْحَانَ رَبِّكَ رَبِّ الْعِزَّةِ عَمَّا يَصِفُوْنَ\nوَسَلَامٌ عَلَى الْمُرْسَلِينَ، وَالْحَمْدُ لِلَّهِ رَبِّ الْعَالَمِينَ",
        "translationEn": "O Allah, do not make this the last of my visits to this noble place. Grant me the opportunity to return to this place in goodness, wellbeing, health and safety. If my life is prolonged, God willing, I shall return. If I die before returning, then I entrust with You my testimony, my trust, my pledge, and my covenant from this day until the Day of Resurrection. And it is the testimony that there is no God but Allah, the One, without partner, and the testimony that Muhammad is His servant and His Messenger. Glory be to the Lord who possesses Majesty and Power, above what they attribute. Peace be upon all the Messengers, and all praise is due to Allah, Lord of all the worlds.\n",
        "translationMy": "Ya Allah, janganlah jadikan ziarah hambaMu di tempat yang mulia ini sebagai ziarah yang penghabisan, kurniakanlah kepada hambaMu peluang untuk menziarahi kembali ke tempat ini dalam keadaan baik, sihat dan selamat. Jika panjang umur hamba, insya Allah, hamba akan datang lagi, jika sampai ajal hamba, maka hamba telah mengabadikan kepadaMu syahadat dan perjanjian hamba dari hari ini sehingga hari kiamat. laitu hamba bersaksi tiada Tuhan melainkan Allah, Tuhan Yang Esa yang tidak ada sekutu bagiNya dan hamba naik saksi bahawa Nabi Muhammad hambaNya dan pesuruhNya. Maha suci Tuhan yang mempunyai Keagungan dan Kekuasaan, dari apa yang mereka sifatkan. Dan salam sejahtera ke atas sekelian Rasul, serta segala puji-pujian tertentu bagi Allah, Tuhan yang memelihara dan mentadbir seluruh alam."
      }
    ],
    "categoryKey": [
      "madinah"
    ],
    "audio": "ziarah_wadak.mp3"
  },
  {
    "id": 83,
    "titleEn": "Upon Embarking A Vehicle",
    "titleMy": "Naik Kenderaan",
    "doa": [
      {
        "id": 1,
        "arabic": "بِسْمِ اللَّهِ مَجْر۪ يهَا وَمُرْسَاهَا، إِنَّ رَبِّي لَغَفُورٌ رَحِيمٌ سُبْحَانَ الَّذِي سَخَّرَ لَنَا هَذَا وَمَا كُنَّا لَهُ مُقْرِنِينَ، وَإِنَّا إِلَى رَبِّنَا لَمُنْقَلِبُونَ، وَلَا حَوْلَ وَلَا قُوَّةَ إِلَّا بِاللَّهِ الْعَلِيِّ الْعَظِيم",
        "translationEn": "In the name of Allah it will sail and cast anchor. Surely my Lord is All-Forgiving, Most Merciful. Glory be to Him who has subjected this to us and we would not have been able to subjugate it to ourselves and we would indeed return to Allah. And there is no power and no strength except with Allah, the Most High, the Most Great.",
        "translationMy": "Dengan nama Allah ketika pelayarannya dan berlabuhnya. Sesungguhnya Tuhanku Maha Pengampun lagi Maha Penyayang. Maha Suci Allah yang memudahkan bagi kami kenderaan ini dan tiadalah kami berkuasa menggunakannya kalau tidak dengan kurniaan Allah. Sesungguhnya kami akan kembali kepada Tuhan kami. Tiada daya dan upaya melainkan dengan Allah yang Maha Besar."
      }
    ],
    "categoryKey": [
      "travel"
    ],
    "audio": "doa_naik_kenderaan.mp3"
  },
  {
    "id": 84,
    "titleEn": "While Travelling",
    "titleMy": "Dalam Perjalanan",
    "doa": [
      {
        "id": 1,
        "arabic": "بِسْمِ اللَّهِ مَا شَآءَ اللَّهُ، لَا قُوَّةَ إِلَّا بِاللَّهِ. حَسْبِيَ اللَّهُ تَوَكَّلْتُ عَلَى اللَّهِ مَا شَاءَ اللَّهُ. لَا يَأْتِي بِالْخَيْرِ إِلَّا اللَّهُ، مَا شَاءَ اللَّهُ. لَا يَصْرِفُ السُّوءَ إِلَّا اللَّه.حَسْبِيَ اللَّهُ وَكَفَى. وَسَمِعَ اللَّهُ لِمَنْ دَعَا لَيْسَ وَرَاءَ اللَّهِ مُنْتَهَى، وَلَا دُونَ اللَّهِ مَلْجَأَ. كَتَبَ اللَّهُ لَأَغْلِبَنَّ أَنَا وَرُسُلِي، إِنَّ اللَّهَ قَوِيٌّ عَزِيزٌ. تَحَصَّنْتُ بِاللَّهِ الْعَظِيمِ، وَاسْتَعَنْتُ بِالْحَيِّ الَّذِي لَا يَمُوتُ. اللَّهُمَّ احْرُسْنَا بِعَيْنِكَ الَّتِي لَا تَنَامُ، وَاكْنُفْنَا بِكَنَفِكَ الَّذِي لَا يُرَامُ. اللَّهُمَّ ارْحَمْنَا بِقُدْرَتِكَ عَلَيْنَا فَلَا نُهْلِكَ، وَأَنْتَ ثِقَتُنَا وَرَجَاؤُنَا. اللَّهُمَّ عَطِّفْ عَلَيْنَا قُلُوبَ عِبَادِكَ وَأَمَّاتِكَ بِرَأْفَةٍ وَرَحْمَةٍ مِنْكَ إِنَّكَ أَنْتَ أَرْحَمَ الرَّاحِمِينَ",
        "translationEn": "In the name of Allah. What Allah wills (comes to pass). There is no power except with Allah. Allah is sufficient for me. I place my trust in Allah. What Allah wills (comes to pass). None brings goodness except Allah. What Allah wills (comes to pass). None repels harm except Allah. Allah is sufficient for me, and Allah hears whoever calls upon Him. There is no ultimate end beyond Allah, and there is no refuge apart from Allah. Allah has decreed: ‘I and My Messengers shall surely prevail.’ Indeed, Allah is Most Strong, Most Mighty. I have sought protection with Allah, the Most Great, and I seek help from the Ever-Living who does not die. O Allah, guard us with Your watchful care that does not sleep, and suffice us with Your Protection that cannot be overcome. O Allah, have mercy upon us by Your power over us, so that we are not destroyed and You are our trust and our hope. O Allah, incline the hearts of Your servants toward us, and complete for us Your Kindness and Mercy from You. Indeed, You are the Most Merciful of those who show mercy.",
        "translationMy": "Dengan nama Allah. Apa yang dikehendaki oleh Allah. Tiada yang gagah kecuali Allah. Telah dicukupkan oleh Allah. Aku berserah kepada Allah. Apa yang dikehendaki oleh Allah. Tiada yang mendatangkan kebaikan kecuali Allah. Apa yang dikehendaki oleh Allah. Tiada yang menghindarkan keburukan melainkan Allah. Cukuplah Allah bagiku. Allah mendengar siapa yang berdoa. Tiada kesudahan bagi Allah. Allah telah memastikan dengan kataNya: “Aku dan RasulKu pasti menang.” Sesungguhnya Allah Maha Kuat lagi Perkasa. Aku berkubu dengan Tuhan yang Besar. Aku memohon pertolongan dari Tuhan Yang Hidup, tidak mati. Ya Allah, jagalah kami dengan pengawasanMu yang tidak dapat ditembusi. Engkaulah harapan kami. Lembutkanlah hati hamba-hambaMu kepada kami dengan kelembutan dariMu. Sesungguhnya Engkaulah Yang Maha Pengasih lagi Maha Penyayang."
      }
    ],
    "categoryKey": [
      "travel"
    ],
    "audio": "doa_dalam_perjalanan.mp3"
  },
  {
    "id": 85,
    "titleEn": "Upon Entering A New Country",
    "titleMy": "Masuk Negeri Baru",
    "doa": [
      {
        "id": 1,
        "arabic": "أَعُوذُ بِكَلِمَاتِ اللَّهِ التَّامَّاتِ الَّتِي لَا يُجَاوِزُهُنَّ بِرٌّ وَلَا فَاجِرٌ مِنْ شَرِّ مَا خَلَقَ اللَّهُمَّ أَعْطِنَا خَيْرَ هَذَا الْمَنْزِلِ وَخَيْرَ مَا فِيهِ وَاكْفِنَا شَرَّهُ وَشَرَّ مَا فِيهِ رَبِّ أَنْزِلْنِي مُنْزَلًا مُبَارَكًا وَأَنْتَ خَيْرُ الْمُنْزِلِينَ",
        "translationEn": "I seek refuge in the perfect Words of Allah, which neither the righteous nor the wicked can surpass, from the evil of all that He has created. O Allah, grant us the good of this place and the good that is within it, and protect us from its evil and the evil that is within it. My Lord, cause me to settle in a blessed place, for You are the Best of those who grant settlement.",
        "translationMy": "Aku berlindung dengan kalimah-kalimah Allah yang sempurna yang tidak dapat dilampaui oleh orang yang baik, mahupun yang jahat dari segala kejahatan yang dijadikannya. Ya Allah, berilah kami kebaikan tempat ini dan kebaikan yang ada di dalamnya, dan selamatkan kami dari keburukannya. Ya Tuhan kami turunkanlah kami dengan keberkatan. Engkaulah sebaik-baik yang menurunkan."
      }
    ],
    "categoryKey": [
      "travel"
    ],
    "audio": "doa_ketika_masuk_negeri_baru.mp3"
  },
  {
    "id": 87,
    "titleEn": "Upon Entering The Sacred Precinct",
    "titleMy": "Masuk Tanah Haram",
    "doa": [
      {
        "id": 1,
        "arabic": "اللَّهُمَّ إِنَّ هَذَا الْحَرَمَ حَرَمُكَ وَالْبَلَدَ بَلَدُكَ وَالْأَمْنَ أَمْنُكَ، فَحَرِّمْنِي عَلَى النَّارِ، وَآمِنِّي مِنْ عَذَابِكَ يَوْمَ تَبْعَثُ عِبَادَكَ.",
        "translationEn": "O Allah, indeed this Sacred Precinct is Your Sacred Precinct, this land is Your land, and this sanctuary is Your sanctuary. So forbid the fire from touching me, and grant me safety from Your punishment on the day You resurrect Your servants.",
        "translationMy": "Ya Allah, tanah haram ini tanah haramMu, dan negeri ini negeriMu, dan tempat keamanan ini tempat keamananMu, maka haramkanlah aku dari api neraka dan amankanlah aku dari azabMu, pada hari Engkau membangkitkan hamba-hambaMu."
      }
    ],
    "categoryKey": [
      "travel"
    ],
    "audio": "masuk_tanah_haram.mp3"
  },
  {
    "id": 88,
    "titleEn": "Upon Seeing The City Of Makkah",
    "titleMy": "Ketika Nampak Kota Makkah",
    "doa": [
      {
        "id": 1,
        "arabic": "اللَّهُمَّ اجْعَلْ لِي بِهَا قَرَارًا وَارْزُقْنِي فِيهَا رِزْقًا حَلَالًا. رَبَّنَا آتِنَا فِي الدُّنْيَا حَسَنَةً وَفِي الْآخِرَةِ حَسَنَةً وَقِنَا عَذَابَ النَّارِ. اللَّهُمَّ إِنَّ الْبَلَدَ بَلَدُكَ وَالْبَيْتَ بَيْتُكَ. جِئْتُ أَطْلُبُ رَحْمَتَكَ وَأَؤُمُّ طَاعَتَكَ، مُتَّبِعًا لِأَمْرِكَ، طَالِبًا لِثَوَابِكَ، رَاضِيًا بِقَدَرِكَ مُسَلِّمًا لِأَمْرِكَ. أَسْأَلُكَ مَسْأَلَةَ الْمُضْطَرِّ إِلَيْكَ الْمُشْفِقِ مِنْ عَذَابِكَ أَنْ تَسْتَقْبِلَنِي بِعَفْوِكَ وَأَنْ تَتَجَاوَزَ عَنِّي بِرَحْمَتِكَ وَأَنْ تُدْخِلَنِي جَنَّتَكَ.",
        "translationEn": "O Allah, make this land a place of tranquillity for me, and grant me lawful provision within it. Our Lord, grant us good in this world and good in the Hereafter, and save us from the punishment of the Fire. O Allah, this land is Your land and this house is Your House. I have come seeking Your Mercy, responding in obedience to You, following Your Command, hoping for Your Pleasure, and submitting to Your Decree. I beseech You with the supplication of one who is distressed and fearful of Your punishment, that You receive me with forgiveness, pardon my sins, and admit me into Your Paradise.",
        "translationMy": "Ya Allah, jadikanlah negeri ini tempat yang tenang buatku, dan kurniakanlah aku rezeki yang halal di dalamnya. Ya Tuhan kami, berilah kebaikan di dunia dan kebaikan di akhirat dan selamatkan kami dari api neraka. Ya Allah, negeri ini negeriMu, dan rumah ini rumahMu, aku datang bermohon rahmatMu, dan mengikuti taatMu, menurut perintahMu, mengharapkan keredaanMu, berserah kepada perintahMu. Aku bermohon sebagai permohonan orang yang terdesak, yang takut dari azabMu, aku harapkan Engkau menerimaku dengan kemaafan, mengampuni dosaku dan memasukkan aku ke dalam syurgaMu."
      }
    ],
    "categoryKey": [
      "travel"
    ],
    "audio": "doa_ketika_nampak_kota_makkah.mp3"
  }
]