[
  {
    "id": 1,
    "titleEn": "Talbiyah",
    "titleMy": "Talbiyah",
    "doa": [{
      "id": 1,
      "arabic": "لَبَّيْكَ اللّٰهُمَّ لَبَّيْكَ، لَبَّيْكَ لَا شَرِيكَ لَكَ لَبَّيْكَ\nإِنَّ الْحَمْدَ، وَالنِّعْمَةَ، لَكَ وَالْمُلْكَ، لَا شَرِيْكَ لَكَ",
      "translationEn": "I answer, O my Lord, I answer Your call. There is no ally for You, I answer the call. All praise and goodness to You, and government also to You, There is no ally for You",
      "translationMy": "Aku menyahut wahai Tuhanku aku menyahut panggilanMu (panggilan Nabi Ibrahim). Tiada sekutu bagiMu, aku menyahut akan panggilan itu. Segala pujian dan kebaikan bagiMu, dan pemerintahan juga bagiMu, Tiada sekutu bagiMu"
    }, {
      "id": 2,
      "arabic": "اَللّٰهُمَّ صَلِّ عَلَى سَيِّدِنَا مُحَمَّدٍ، وَعَلَى آلِ سَيِّدِنَا مُحَمَّدٍ،\nكَمَا صَلَّيْتَ عَلَى سَيِّدِنَا إِبْرَاهِيمَ، وَعَلَى آلِ سَيِّدِنَا إِبْرَاهِيمَ،\nوَبَارِكْ عَلَى سَيِّدِنَا مُحَمَّدٍ، وَعَلَى آلِ سَيِّدِنَا مُحَمَّدٍ،\nكَمَا بَارَكْتَ عَلَى سَيِّدِنَا إِبْرَاهِيمَ، وَعَلَى آلِ سَيِّدِنَا إِبْرَاهِيمَ،\nفِي الْعَالَمِينَ، إِنَّكَ حَمِيدٌ مَجِيدٌ. اَللّٰهُمَّ إِنِّي أَسْئَلُكَ\nرِضَاكَ وَالْجَنَّةَ وَأَعُوْذُبِكَ مِنْ سَخَطِكَ وَالنَّارِ",
      "translationEn": "I answer, O my Lord, I answer Your call. There is no ally for You, I answer the call. All praise and goodness to You, and government also to You, There is no ally for You.\u2028O Allah, grant additional mercy to our lord Prophet Muhammad and to the family of our lord Prophet Muhammad. As You have bestowed blessings on our lord Prophet Abraham and on the family of our lord Prophet Ibrahim. Bless our lord Prophet Muhammad and the family of our lord Prophet Muhammad. As You have bestowed blessings on our lord Prophet Ibrahim and on the family of our lord Prophet Abraham. In all the realms, indeed You are the Most Praiseworthy and Glorious. O Allah, I ask for Your mercy, and Paradise and I pray with You to be kept away from Your wrath and the fire of Hell",
      "translationMy": "Aku menyahut wahai Tuhanku aku menyahut panggilanMu (panggilan Nabi Ibrahim). Tiada sekutu bagiMu, aku menyahut akan panggilan itu. Segala pujian dan kebaikan bagiMu, dan pemerintahan juga bagiMu, Tiada sekutu bagiMu. Ya Allah, kurniakanlah tambahan rahmat kepada junjungan kami Nabi Muhammad dan kepada keluarga junjungan kami Nabi Muhammad. Sebagaimana Engkau telah mengurniakan rahmat ke atas junjungan kami Nabi Ibrahim dan kepada keluarga junjungan kami Nabi Ibrahim. Kurniakanlah keberkatan kepada junjungan kami Nabi Muhammad dan kepada keluarga junjungan kami Nabi Muhammad. Sebagaimana Engkau telah mengurniakan keberkatan kepada junjungan kami Nabi Ibrahim dan kepada keluarga junjungan kami Nabi Ibrahim. Di dalam seluruh alam, sesungguhnya Engkau adalah Maha Terpuji lagi Mulia. Ya Allah, aku memohon keredaanMu, dan syurga dan aku memohon dengan Engkau dijauhkan dari kemarahanMu dan api neraka"
    }],
    "categoryKey": ["talbiyah"],
    "audio": "talbiyah.mp3"
  },
  {
    "id": 2,
    "titleEn": "Intention For Ihram Prayer",
    "titleMy": "Niat Solat Sunat Ihram",
    "doa": [{
      "id": 1,
      "arabic": "اُصَلِّي سُنَّةَ الْاِحْرَامِ رَكْعَتَيْنِ لِلّٰهِ تَعَالٰى",
      "translationEn": "I intend to pray two raka'at of sunnah Ihram for the sake of Allah Most High",
      "translationMy": "Sahaja aku solat sunat Ihram dua rakaat kerana Allah Taala"
    }],
    "categoryKey": ["intention", "niat"],
    "audio": "niat_solat_sunat_ihram.mp3"
  },
  {
    "id": 3,
    "titleEn": "Intention For Umrah Ihram",
    "titleMy": "Niat Ihram Umrah",
    "doa": [{
      "id": 1,
      "arabic": "نَوَيْتُ العُمْرَةَ وَأَحْرَمْتُ بِهَا لِلّٰهِ تَعَالَى",
      "translationEn": "I intend to perform Umrah and perform ihram for it for the sake of Allah",
      "translationMy": "Sahaja aku menunaikan Umrah dan aku berihram dengannya kerana Allah"
    }],
    "categoryKey": ["intention", "niat", "umrah"],
    "audio": "niat_ihram_umrah.mp3"
  },
  {
    "id": 4,
    "titleEn": "Intention For Ihram Umrah On Behalf",
    "titleMy": "Niat Umrah Badal",
    "doa": [{
      "id": 1,
      "arabic": "نَوَيْتُ العُمرَةَ عَنْ ........... وَأَحْرَمْتُ بِهَا لِلّٰهِ تَعَالَى",
      "translationEn": "I intend to perform Umrah on behalf of ______ and perform ihram for it for the sake of Allah Most High",
      "translationMy": "Sahaja aku menunaikan Umrah bagi ______ dan aku berihram dengannya kerana Allah Ta'ala"
    }],
    "categoryKey": ["intention", "niat", "umrah"],
    "audio": "niat_umrah_badal.mp3"
  },
  {
    "id": 5,
    "titleEn": "Intention For Ihram Umrah With Terms",
    "titleMy": "Niat Umrah Bersyarat",
    "doa": [{
      "id": 1,
      "arabic": "نَوَيْتُ العُمْرَةَ وَأَحْرَمْتُ بِهَا لِلّٰهِ تَعَالَى\nفَإِنْ حَبَسَنِيْ حَابِسٌ فَمَحِلِّيْ حَيْثُ حَبَسْتَنِيْ",
      "translationEn": "I have intended to perform Umrah and performed ihram for it for the sake of Allah Most High, If I am hindered by any hitch, then I will perform tahallul in that place.",
      "translationMy": "Sahaja aku menunaikan Umrah dan aku berihram dengannya kerana Allah Ta'ala, jika aku terhalang oleh sesuatu, maka aku akan bertahallul di tempat tersebut."
    }],
    "categoryKey": ["intention", "niat", "umrah"],
    "audio": "niat_umrah_bersyarat.mp3"
  },
  {
    "id": 6,
    "titleEn": "Intention For Haj Ihram",
    "titleMy": "Niat Ihram Haji",
    "doa": [{
      "id": 1,
      "arabic": "نَوَيْتُ الْحَجَّ وَأَحْرَمْتُ بِهِ لِلّٰهِ تَعَالَى",
      "translationEn": "I have intended to perform Haj and performed ihram for it for the sake of Allah Most High",
      "translationMy": "Sahaja aku menunaikan Haji dan aku berihram dengannya kerana Allah Ta'ala"
    }],
    "categoryKey": ["intention", "niat", "haji"],
    "audio": "niat_ihram_haji.mp3"
  },
  {
    "id": 7,
    "titleEn": "Intention For Haj Ihram On Behalf",
    "titleMy": "Niat Haji Badal",
    "doa": [{
      "id": 1,
      "arabic": "نَوَيْتُ الْحَجَّ عَنْ ........... وَأَحْرَمْتُ بِهِ لِلّٰهِ تَعَالَى",
      "translationEn": "I have intended to perform Haj on behalf of ______ and performed ihram for it for the sake of Allah Most High",
      "translationMy": "Sahaja aku menunaikan Haji bagi ______ dan aku berihram dengannya kerana Allah Ta'ala"
    }],
    "categoryKey": ["intention", "niat", "haji"],
    "audio": "niat_haji_badal.mp3"
  },
  {
    "id": 8,
    "titleEn": "Intention For Haj Ihram With Terms",
    "titleMy": "Niat Haji Bersyarat",
    "doa": [{
      "id": 1,
      "arabic": "نَوَيْتُ الحَجَّ وَأَحْرَمْتُ بِهِ لِلّٰهِ تَعَالَى\nفَإِنْ حَبَسَنِيْ حَابِسٌ فَمَحِلِّيْ حَيْثُ حَبَسْتَنِيْ",
      "translationEn": "I have intended to perform Haj and performed ihram for it for the sake of Allah Most High, If I am hindered by any hitch, then I will perform tahallul in that place.",
      "translationMy": "Sahaja aku menunaikan Haji dan aku berihram dengannya kerana Allah Ta'ala, jika aku terhalang oleh sesuatu, maka aku akan bertahallul di tempat tersebut."
    }],
    "categoryKey": ["intention", "niat", "haji"],
    "audio": "niat_haji_bersyarat.mp3"
  },
  {
    "id": 9,
    "titleEn": "Dua When Entering Masjidil Haram",
    "titleMy": "Doa Memasuki Masjidil Haram",
    "doa": [{
      "id": 1,
      "arabic": "اَللّٰهُمَّ اغْفِرْلِيْ ذُنُوبِي وَافْتَحْ لِي أَبْوَابَ رَحْمَتِكَ، وَأَدْخِلْنِي فِيْهَا، وَسَهِّلْ لِي أَبْوَابَ رِزْقِكَ اَللّٰهُمَّ هَذَا حَرَمُكَ، وَمَوْضِعُ أَمْنِكَ فَحَرِّمْ لَحْمِي وَبَشَرِي وَعِظَامِي عَلَى النَّارِ\nاَللّٰهُمَّ أَنْتَ السَّلَامُ وَمِنْكَ السَّلَامُ، وَإِلَيْكَ يَعُوْدُ السَّلَامُ فَحَيِّنَا رَبَّنَا بِالسَّلَامِ\nوَأَدْخِلْنَا الْجَنَّةَ دَارَ السَّلَامِ تَبَارَكْتَ رَبَّنَا وَتَعَالَيْتَ يَا ذَا الْجَلَالِ وَالْإِكْرَامِ\nاَللّٰهُمَّ إِنِّي أَسْأَلُكَ أَنْ تَغْفِرَ لِي، وَتَرْحَمَنِي، وَتُقِيلَ عَثَرَتِيْ، وَتَضَعَ وِزْرِي\nبِرَحْمَتِكَ يَا أَرْحَمَ الرَّاحِمِينَ",
      "translationEn": "O Allah, forgive my sins and open for me the doors of Your mercy, and enter me into Your mercy, and make the door of Your sustenance easy for me. O Allah, verily this place is Your sanctuary, and the place of security that You provide. So forbid my flesh, my skin and my bones from the fire of Hell. O Allah, You are salvation, from You are salvation and enter us in Paradise a place of safety, Your blessings are plentiful, O Lord of Greatness and Glory. O Allah, I beseech Thee to forgive my sins and forgive my faults and lay the burden that burdens me with Thy mercy. O Merciful God.",
      "translationMy": "Ya Allah, ampunilah dosaku dan bukakanlah bagiku pintu-pintu rahmatMu, dan masukkanlah aku dalam rahmatMu, dan permudahkanlah bagiku pintu rezekiMu. Ya Allah, sesungguhnya tempat ini adalah tempat suciMu, dan tempat keamanan yang Engkau sediakan. Maka haramkanlah dagingku, kulitku dan tulangku dari api neraka. Ya Allah, Engkaulah keselamatan, daripadaMulah keselamatan dan masukkanlah kami di dalam syurga tempat keselamatan, Maha banyak keberkatanMu, Ya Tuhan yang mempunyai Kebesaran dan Kemuliaan. Ya Allah, aku bermohon kepadaMu agar Engkau mengampuni dosaku dan menghapuskan kesalahanku dan meletakkan beban yang memberatiku dengan rahmatMu. Ya Tuhan yang Maha Penyayang."
    }],
    "categoryKey": ["masjidil haram"],
    "audio": "doa_memasuki_masjidil_haram.mp3"
  },
  {
    "id": 10,
    "titleEn": "Intention For I'tikaf At Mosque",
    "titleMy": "Niat I'tikaf Masjid",
    "doa": [{
      "id": 1,
      "arabic": "نَذَرتُ الإِعتِكَافَ فِي هَذَا الْمَسْجِدِ مَا دُمْتُ فِيهِ لِلَّهِ تَعَالَى",
      "translationEn": "I intend to iktikaf in this blessed mosque because of AIIah Taala.",
      "translationMy": "Sahaja aku beri'tikaf di masjid ini kerana AIIah Taala."
    }],
    "categoryKey": ["intention", "niat", "masjidil haram", "madinah"],
    "audio": ""
  },
  {
    "id": 11,
    "titleEn": "Dua When Looking At The Ka'abah",
    "titleMy": "Doa Ketika Melihat Ka'abah",
    "doa": [{
      "id": 1,
      "arabic": "اَللّٰهُمَّ زِدْ هَذَا الْبَيْتَ تَشْرِيْفًا وَتَعْظِيمًا وَتَكْرِيمًا وَمَهَابَةً، وَزِدْ مَنْ شَرَّفَهُ وَعَظَّمَهُ\nمِمَّنْ حَجَّهُ أَوِ اعْتَمَرَهُ تَشْرِيْفًا، وَتَكرِيمًا، وَتَعْظِيمًا وَبِرًّا",
      "translationEn": "O Allah, add to the glory of this house, its greatness and greatness. And add glory, greatness and goodness to those who visit it for Hajj and Umrah.",
      "translationMy": "Ya Allah, tambahkanlah kemuliaan rumah ini, kebesaran dan kehebatannya. Dan tambahkanlah kemuliaan, kebesaran dan kebaikan kepada orang yang mengunjunginya kerana membuat haji dan umrah."
    }],
    "categoryKey": ["masjidil haram"],
    "audio": "doa_ketika_melihat_kaabah.mp3"
  },
  {
    "id": 12,
    "titleEn": "Dua before Tawaf",
    "titleMy": "Doa Sebelum Memulakan Tawaf",
    "doa": [{
      "id": 1,
      "arabic": "اَللّٰهُمَّ إِنِّي أُرِيدُ طَوَافَ بَيتِكَ الحَرَامِ فَيَسِّرهُ لِي وَ تَقَبَّلهُ مِنِّي",
      "translationEn": "O Allah, I am about to perform tawaf around Your holy house, so give me ease and accept it from me.",
      "translationMy": "Ya Allah, sesungguhnya aku hendak mengerjakan tawaf mengelilingi rumahMu yang suci, maka berikanlah aku kemudahan dan terimalah ia daripadaku."
    }],
    "categoryKey": ["tawaf"],
    "audio": "doa_sebelum_memulakan_tawaf.mp3"
  },
  {
    "id": 13,
    "titleEn": "Arrival Tawaf",
    "titleMy": "Tawaf Qudum",
    "doa": [{
      "id": 1,
      "arabic": "نَوَيْتُ أَن أَطُوفَ طَوَافَ القُدُومِ سَبعَةَ أَشوَاطٍ لِلّٰهِ تَعَالَى",
      "translationEn": "I intended to perform arrival tawaf, seven rounds for the sake of Allah Most High",
      "translationMy": "Sahaja aku berniat mengerjakan tawaf qudum tujuh pusingan kerana Allah Taala"
    }],
    "categoryKey": ["intention", "niat", "tawaf"],
    "audio": "niat_tawaf_qudum.mp3"
  },
  {
    "id": 14,
    "titleEn": "Tawaf Hajj",
    "titleMy": "Tawaf Haji",
    "doa": [{
      "id": 1,
      "arabic": "نَوَيْتُ أَن أَطُوفَ طَوَافَ الحَجِّ سَبعَةَ أَشوَاطٍ لِلّٰهِ تَعَالَى",
      "translationEn": "I intended to perform haj tawaf, seven rounds for the sake of Allah Most High",
      "translationMy": "Sahaja aku berniat mengerjakan tawaf haji tujuh pusingan kerana Allah Taala"
    }],
    "categoryKey": ["intention", "niat", "tawaf"],
    "audio": "niat_tawaf_haji.mp3"
  },
  {
    "id": 15,
    "titleEn": "Tawaf Umrah",
    "titleMy": "Tawaf Umrah",
    "doa": [{
      "id": 1,
      "arabic": "نَوَيْتُ أَن أَطُوفَ طَوَافَ العُمرَةِ سَبعَةَ أَشوَاطٍ لِلّٰهِ تَعَالَى",
      "translationEn": "I intended to perform umrah tawaf, seven rounds for the sake of Allah Most High",
      "translationMy": "Sahaja aku berniat mengerjakan tawaf umrah tujuh pusingan kerana Allah Taala"
    }],
    "categoryKey": ["intention", "niat", "tawaf"],
    "audio": "niat_tawaf_umrah.mp3"
  },
  {
    "id": 16,
    "titleEn": "Tawaf Sunnah",
    "titleMy": "Tawaf Sunnah",
    "doa": [{
      "id": 1,
      "arabic": "نَوَيْتُ أَن أَطُوفَ طَوَافَ السُّنَّةِ سَبعَةَ أَشوَاطٍ لِلّٰهِ تَعَالَى",
      "translationEn": "I intended to perform sunnah tawaf, seven rounds for the sake of Allah Most High",
      "translationMy": "Sahaja aku berniat mengerjakan tawaf sunnah tujuh pusingan kerana Allah Taala"
    }],
    "categoryKey": ["intention", "niat", "tawaf"],
    "audio": "niat_tawaf_sunnah.mp3"
  },
  {
    "id": 18,
    "titleEn": "1st Round Of Tawaf",
    "titleMy": "Doa Tawaf Pusingan Pertama",
    "doa": [{
      "id": 1,
      "arabic": "سُبْحَانَ اللهِ وَالْحَمْدُ لِلَّهِ وَلَا إِلٰهَ إِلَّا اللهُ وَ اللهُ أَكْبَرُ\nوَلَا حَوْلَ وَلَا قُوَّةَ إِلَّا بِاللهِ الْعَلِيِّ الْعَظِيْمِ\nوَالصَّلَاةُ وَالسَّلاَمُ عَلَى رَسُولِ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ\nاَللَّهُمَّ إِيْمَانًا بِكَ وَتَصدِيْقًا بِكِتَابِكَ وَوَفَاءًا بِعَهدِك وَاتِّبَاعًا لِسُنَّةِ\nنَبِيِّكَ وَ حَبِيبِكَ مُحَمَّدٍ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ\nاَللَّهُمَّ إِنِّي أَسْئَلُكَ الْعَفْوَى وَالْعَافِيَةَ وَ الُمعَافَاةَ الدَّائِمَةَ\nفِي الدِّيْنِ وَالدُّنْيَا وَالْأَخِرَةِ وَالْفَوْزَ بِالْجَنَّةِ وَالنَّجَاةَ مِنَ النَّارِ",
      "translationEn": "Glory be to Allah and all praise be to Him. There is no God but Allah. Allah is Great, and there is no power, except by the permission of Allah the Most High and the Exalted. Peace and blessings be upon the Messenger of Allah s.a.w. O Allah, for believing in You, and for believing in Your Book, and being faithful to Your promises, and following the Sunnah of Your Prophet, and Your beloved Muhammad s.a.w. O Allah, I ask for forgiveness, health and well-being in religion, in this world and in the hereafter, to obtain victory and paradise and to be spared from Hellfire.",
      "translationMy": "Maha Suci Allah dan segala puji bagiNya. Tiada Tuhan kecuali Allah. Allah Maha Besar, dan tidak ada suatu kekuatan, kecuali dengan izin Allah Yang Maha Tinggi dan Maha Agung. Selawat dan salam bagi Rasulullah s.a.w. Ya Allah, kerana iman kepadaMu, dan kerana meyakini kitabMu, serta setia kepada janjiMu, dan mengikuti sunnah NabiMu, dan kekasihMu Muhammad s.a.w. Ya Allah sesungguhnya aku mohon keampunan, kesihatan dan kesejahteraan terus menerus di dalam beragama, di dunia dan di akhirat, memperoleh kemenangan dan syurga serta terhindar dari neraka."
    }],
    "categoryKey": ["tawaf"],
    "audio": "doa_tawaf_pusingan_pertama.mp3"
  },
  {
    "id": 19,
    "titleEn": "Doa From Rukun Yamani To Hajar Aswad",
    "titleMy": "Doa Dari Rukun Yamani Hingga Hajar Aswad",
    "doa": [{
      "id": 1,
      "arabic": "اَللَّهُمَّ رَبَّنَا آتِنَا فِي الدُّنْيَا حَسَنَةً وَفِي الآخِرَةِ حَسَنَةً وَقِنَا عَذَابَ النَّارِ\nوَ أَدخِلنَا الجَنَّةَ مَعَ الأَبرَارِ يَا عَزِيزُ يَا غَفَّارُ يَا رَبَّ العَالَمِينَ",
      "translationEn": "O Allah, O our Lord, give us good in this world and good in the Hereafter, and save us from the punishment of Hell, and admit us to Paradise with those who do righteous deeds. O Lord, the Most Forgiving. Oh the Lord of the universe.",
      "translationMy": "Ya Allah Ya Tuhan kami, berilah kami kebaikan di dunia dan kebaikan di akhirat, serta selamatkanlah kami dari azab neraka, Dan masukkanlah kami ke dalam syurga bersama orang-orang yang berbuat kebajikan. Ya Tuhan yang Maha Mulia Iagi Maha Pengampun. Ya Tuhan alam semesta."
    }],
    "categoryKey": ["tawaf"],
    "audio": "doa_dari_rukun_yamani_hingga_hajar_aswad.mp3"
  },
  {
    "id": 20,
    "titleEn": "2nd Round Of Tawaf",
    "titleMy": "Doa Tawaf Pusingan Kedua",
    "doa": [{
      "id": 1,
      "arabic": "اَللَّهُمَّ إِنَّ هَذَا الْبَيْتَ بَيْتُكَ وَالْحَرَمَ حَرَمُكَ وَالْأَمْنَ أَمْنُكَ وَالْعَبْدَ عَبْدُكَ\nوَأَنَا عَبْدُكَ وَابْنُ عَبْدِكَ وَهَذَا مَقَامُ العَائِذِ بِكَ مِنَ النَّارِ\nفَحَرِّمْ لُحُومَنَا وَبَشَرَتَنَا عَلَى النَّارِ\nاَللَّهُمَّ حَبِّبْ إِلَيْنَا الْإيْمَانَ وَزَيِّنْهُ فِي قَلُوبِنَا وَكَرِّهْ إِلَيْنَا الْكُفْرَ وَالْفُسُوقَ\nوَالْعِصْيَانَ وَاجْعَلْنَا مِنَ الرَّاشِدِينَ اللَّهُمَّ قِنِي عَذَابَكَ يَوْمَ تَبْعَثُ عِبَادَكَ\nاَللَّهُمَّ ارْزُقْنَا الْجَنَّةَ بِغَيْرِ حِسَابٍِ",
      "translationEn": "O Allah, this house is Your house, and this forbidden land is Your forbidden land, this land of peace is Yours, this servant is Your servant, and the son of Your servant, and this place is a place where people take refuge in You from the torment of Hell, so keep our flesh and skin away from the fire of Hell. O Allah, make our hearts lovers of faith, adorn our hearts with it (faith), and make us hate with disbelief, wickedness and disobedience, and make us among those who are guided. O Allah, protect us from Your punishment on the day You raise up Your servants. O Allah, grant us paradise without reckoning",
      "translationMy": "Ya Allah, sesungguhnya rumah ini adalah rumahMu, dan tanah haram ini adalah tanah haramMu, negeri aman ini adalah negeriMu, hamba ini adalah hambaMu, dan anak dari hambaMu, dan tempat ini adalah tempat orang berlindung padaMu dari seksa neraka, maka jauhkanlah daging dan kulit kami dari api neraka. Ya Allah, jadikanlah hati kami pencinta keimanan, hiasilah hati kami dengannya (iman), dan jadikanlah kami benci dengan kekafiran, kefasikan dan kemaksiatan, serta jadikanlah kami di antara orang yang mendapat petunjuk. Ya Allah, lindungilah kami dari azabMu pada hari Engkau membangkitkan hamba-hambaMu. Ya Allah, anugerahilah kami syurga tanpa perhitungan"
    }],
    "categoryKey": ["tawaf"],
    "audio": "doa_tawaf_pusingan_kedua.mp3"
  },
  {
    "id": 21,
    "titleEn": "Doa From Rukun Yamani To Hajar Aswad",
    "titleMy": "Doa Dari Rukun Yamani Hingga Hajar Aswad",
    "doa": [{
      "id": 1,
      "arabic": "اَللَّهُمَّ رَبَّنَا آتِنَا فِي الدُّنْيَا حَسَنَةً وَفِي الآخِرَةِ حَسَنَةً وَقِنَا عَذَابَ النَّارِ\nوَ أَدخِلنَا الجَنَّةَ مَعَ الأَبرَارِ يَا عَزِيزُ يَا غَفَّارُ يَا رَبَّ العَالَمِينََ",
      "translationEn": "O Allah, O our Lord, give us good in this world and good in the Hereafter, and save us from the punishment of Hell, and admit us to Paradise with those who do righteous deeds. O Lord, the Most Forgiving. Oh the Lord of the universe.",
      "translationMy": "Ya Allah Ya Tuhan kami, berilah kami kebaikan di dunia dan kebaikan di akhirat, serta selamatkanlah kami dari azab neraka, Dan masukkanlah kami ke dalam syurga bersama orang-orang yang berbuat kebajikan. Ya Tuhan yang Maha Mulia Iagi Maha Pengampun. Ya Tuhan alam semesta."
    }],
    "categoryKey": ["tawaf"],
    "audio": "doa_dari_rukun_yamani_hingga_hajar_aswad.mp3"
  },
  {
    "id": 22,
    "titleEn": "3rd Round Of Tawaf",
    "titleMy": "Doa Tawaf Pusingan Ketiga",
    "doa": [{
      "id": 1,
      "arabic": "اَللّٰهُمَّ إِنِّي أَعُوذُ بِكَ مِن الشَّكِّ وَالشِرْكِ والشِّقَاقِ والنِّفَاقِ\nوسُوءِ الأَخْلاَقِ وَسُوءِ المَنْظَرِ وَالمُنقَلَبِ فِي المَالِ والأَهْلِ والوَلَدِ\nاَللَّهُمَّ إِنِّي أَسْأَلُكَ رِضَاكَ وَالجَنَّةَ وأَعُوذُبِكَ مِن سَخَطِكَ والنَّارِ\nاَللَّهُمَّ إِنِّي أَعُوذُبِكَ مِنْ فِتْنَةِ القَبرِ وأَعُوذُ بِكَ مِن فِتْنَةِ المَحْيَا وَالمَمَاتِ",
      "translationEn": "O Allah, I take refuge in You from anxiety, shirk, division, hypocrisy, bad morals, bad outlook, and wrong dealings in property, family and children. O Allah, I ask You and Paradise to be pleased and to protect Your wrath and Hell. O Allah, I beg to be protected from the slander of the grave and to be protected from the temptations of life and death.",
      "translationMy": "Ya Allah, sesungguhnya aku berlindung kepadaMu dari kebimbangan, kesyirikan, perpecahan, kemunafikan, keburukan akhlak, keburukan pandangan, dan kesalahan urusan dalam harta, keluarga dan anak-anak. Ya Allah, aku mohon redaMu dan syurga serta mohon perlindungan terhadap kemarahanMu dan neraka. Ya Allah, aku mohon dilindungi dari fitnah kubur dan mohon dilindungi dari berbagai godaan kehidupan dan kematian."
    }],
    "categoryKey": ["tawaf"],
    "audio": "doa_tawaf_pusingan_ketiga.mp3"
  },
  {
    "id": 23,
    "titleEn": "Doa From Rukun Yamani To Hajar Aswad",
    "titleMy": "Doa Dari Rukun Yamani Hingga Hajar Aswad",
    "doa": [{
      "id": 1,
      "arabic": "اَللّٰهُمَّ رَبَّنَا آتِنَا فِي الدُّنْيَا حَسَنَةً وَفِي الآخِرَةِ حَسَنَةً وَقِنَا عَذَابَ النَّارِ\nوَ أَدخِلنَا الجَنَّةَ مَعَ الأَبرَارِ يَا عَزِيزُ يَا غَفَّارُ يَا رَبَّ العَالَمِينَ",
      "translationEn": "O Allah, O our Lord, give us good in this world and good in the Hereafter, and save us from the punishment of Hell, and admit us to Paradise with those who do righteous deeds. O Lord, the Most Forgiving. Oh the Lord of the universe.",
      "translationMy": "Ya Allah Ya Tuhan kami, berilah kami kebaikan di dunia dan kebaikan di akhirat, serta selamatkanlah kami dari azab neraka, Dan masukkanlah kami ke dalam  syurga bersama orang-orang yang berbuat kebajikan. Ya Tuhan yang Maha Mulia Iagi Maha Pengampun. Ya Tuhan alam semesta."
    }],
    "categoryKey": ["tawaf"],
    "audio": "doa_dari_rukun_yamani_hingga_hajar_aswad.mp3"
  },
  {
    "id": 24,
    "titleEn": "4th Round Of Tawaf",
    "titleMy": "Doa Tawaf Pusingan Keempat",
    "doa": [{
      "id": 1,
      "arabic": "اَللّٰهُمَّ اجْعَلْنِي حَجًّا مَبْرُورًا وَسَعْياً مَشْكُورًا وَذَنباً مَغْفُورًا وَعَمَلًا صَالِحًا مَقْبُولًا\nوَتِجَارَةً لَنْ تَبُورَ، يَا عَالِمَ مَا فِي الصُّدُورِ أَخْرِجْنِي  يَا اَللهُ مِنَ الظُّلُمَاتِ\n إِلَى النُّورِ، اَللّٰهُمَّ إِنِّي أَسْأَلُكَ مُوجِبَاتِ رَحْمَتِكَ وَعَزَائِمَ مَغْفِرَتِكَ\nوَالسَّلاَمَةَ مِن كُلِّ إِثْمٍ والغَنِيمَةَ مِن كُلِّ بِرٍّ والفَوْزَ بِالجَنَّةِ وَ النَّجَاةَ مِنَ النَّارِ\nرَبِّي قَنِّعْنِي بِمَا رَزَقتَنِي وَبَارِكْ لِي فِيمَا أَعْطَيْتَنِي\nوَاخْلُفْ عَلَيَّ كُلَّ غَائِبَةٍ لِي مِنْكَ بِخَيْرٍ",
      "translationEn": "O Allah, make my Hajj a mabrur, a blessing that is accepted, sins that are forgiven, righteous deeds that are accepted, and merchandise that is not harmful. O God Almighty, there is nothing stored in the chest. O Allah, bring me out of darkness into a bright light. O Allah, I beg forgiveness from You all that brings Your mercy, all that leads to forgiveness, the farthest from all sins, to obtain all goodness, and to enter Paradise and escape from Hell. O my Lord, comfort my heart with the sustenance You have given me and bless all that You have given me, and replace all that I have lost with goodness from Your side.",
      "translationMy": "Ya Allah, jadikanlah hajiku haji yang mabrur, sai yang diterima, dosa yang terampun, amal soleh yang diterima, serta perniagaan yang tidak merugikan. Wahai Tuhan Yang Maha Mengetahui apa-apa tersimpan di dalam dada. Ya Allah, keluarkanlah aku dari kegelapan kepada cahaya terang. Ya Allah, aku mohon maaf padaMu segala hal yang mendatangkan rahmatMu, semua yang membawa kepada keampunan, terjauh dari segala dosa, memperoleh segala kebaikan, dan berjaya memasuki syurga serta terlepas dari neraka. Ya Tuhanku tenteramkan hatiku dengan rezeki yang Engkau beri dan berkatilah segala yang Engkau telah kurniakan kepadaku, dan gantilah segala yang terluput dariku dengan kebaikan dari sisiMu"
    }],
    "categoryKey": ["tawaf"],
    "audio": "doa_tawaf_pusingan_keempat.mp3"
  },
  {
    "id": 25,
    "titleEn": "Doa From Rukun Yamani To Hajar Aswad",
    "titleMy": "Doa Dari Rukun Yamani Hingga Hajar Aswad",
    "doa": [{
      "id": 1,
      "arabic": "اَللّٰهُمَّ رَبَّنَا آتِنَا فِي الدُّنْيَا حَسَنَةً وَفِي الآخِرَةِ حَسَنَةً وَقِنَا عَذَابَ النَّارِ\nوَ أَدخِلنَا الجَنَّةَ مَعَ الأَبرَارِ يَا عَزِيزُ يَا غَفَّارُ يَا رَبَّ العَالَمِينََ",
      "translationEn": "O Allah, O our Lord, give us good in this world and good in the Hereafter, and save us from the punishment of Hell, and admit us to Paradise with those who do righteous deeds. O Lord, the Most Forgiving. Oh the Lord of the universe.",
      "translationMy": "Ya Allah Ya Tuhan kami, berilah kami kebaikan di dunia dan kebaikan di akhirat, serta selamatkanlah kami dari azab neraka, Dan masukkanlah kami ke dalam syurga bersama orang-orang yang berbuat kebajikan. Ya Tuhan yang Maha Mulia Iagi Maha Pengampun. Ya Tuhan alam semesta."
    }],
    "categoryKey": ["tawaf"],
    "audio": "doa_dari_rukun_yamani_hingga_hajar_aswad.mp3"
  },
  {
    "id": 26,
    "titleEn": "5th Round Of Tawaf",
    "titleMy": "Doa Tawaf Pusingan Kelima",
    "doa": [{
      "id": 1,
      "arabic": "اَللَّهُمَّ أَظِلَّنِي تَحْتَ ظِلِّ عَرْشِكَ يَوْمَ لَا ظِلَّ إِلَّا ظِلُّكَ وَلَا بَاقِيَ إِلَّا وَجْهُكَ\nوَاسْقِنِي مِنْ حَوْضِ نَبِيِّكَ مُحَمَّدٍ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ شَرْبَةً هَنِيئَةً مَرِيئَةً\nلَا أَظمَؤُ بَعْدَهَا أَبَدًا، اَللَّهُمَّ إِنِّي أَسْأَلُكَ مِنْ خَيْرِ مَا سَأَلَكَ مِنهُ\nنَبِيُّكَ مُحَمَّدٌ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ \nوَأَعُوذُبِكَ مِنْ شَرِّ مَا استَعَاذَكَ مِنْهُ نَبِيُّكَ مُحَمَّدٌ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ\nاَللّٰهُمَّ إِنِّي أَسْأَلُكَ الجَنَّةَ وَنَعِيمَهَا وَمَا يُقَرِّبُنِي إِلَيْهَا مِنْ قَوْلٍ أَوْ فِعْلٍ أَوْ عَمَلٍ\nوَأَعُوذُبِكَ مِنَ النَّارِ وَمَا يُقَرِّبُنِي إِلَيْهَا مِنْ قَوْلٍ أَوْ فِعْلٍ أَوْ عَمَلٍ",
      "translationEn": "O Allah, protect me under Your shade on a day when there is no shade except Your shade, and there is nothing left but Your face, Give me a drink from the well of the Prophet Muhammad s.a.w., a delicious and refreshing drink, after which I will never thirst Iagi. O Allah, I ask You for the best that Your Prophet, Muhammad s.a.w. has ever asked for. And I take refuge in You from evil as the protection requested by the Prophet Muhammad s.a.w. O Allah, I ask You for Paradise with all its pleasures and all that brings me closer to it, whether in word, deed or deed. And I ask You for protection from Hell and everything that brings me closer to it, both in word, deed and deed.",
      "translationMy": "Ya Allah, lindungilah aku di bawah naunganMu pada hari yang tiada naungan, kecuali naunganMu, dan tiada yang tinggal kecuali wajahMu, Berilah aku minum dari telaga Nabi Muhammad s.a.w., minuman yang lazat yang menyegarkan, yang sesudahnya aku tidak akan pernah haus Iagi. Ya Allah, aku mohon kepadaMu dari apa yang terbaik yang pernah diminta oleh NabiMu, Muhammad s.a.w.  Dan aku berlindung kepadaMu dari kejahatan sebagaimana perlindungan yang di mohon oleh Nabi Muhammad s.a.w. Ya Allah, aku mohon kepadaMu syurga dengan segala kenikmatannya dan segala yang mendekatkan aku kepadanya, baik perkataan, perbuatan ataupun tindakan. Dan aku mohon perlindungan kepadaMu dari neraka dan segala yang mendekatkan aku kepadanya, baik perkataan, perbuatan dan tindakan."
    }],
    "categoryKey": ["tawaf"],
    "audio": "doa_tawaf_pusingan_kelima.mp3"
  },
  {
    "id": 27,
    "titleEn": "Doa From Rukun Yamani To Hajar Aswad",
    "titleMy": "Doa Dari Rukun Yamani Hingga Hajar Aswad",
    "doa": [{
      "id": 1,
      "arabic": "اَللّٰهُمَّ رَبَّنَا آتِنَا فِي الدُّنْيَا حَسَنَةً وَفِي الآخِرَةِ حَسَنَةً وَقِنَا عَذَابَ النَّارِ\nوَ أَدخِلنَا الجَنَّةَ مَعَ الأَبرَارِ يَا عَزِيزُ يَا غَفَّارُ يَا رَبَّ العَالَمِينََ",
      "translationEn": "O Allah, O our Lord, give us good in this world and good in the Hereafter, and save us from the punishment of Hell, and admit us to Paradise with those who do righteous deeds. O Lord, the Most Forgiving. Oh the Lord of the universe.",
      "translationMy": "Ya Allah Ya Tuhan kami, berilah kami kebaikan di dunia dan kebaikan di akhirat, serta selamatkanlah kami dari azab neraka, Dan masukkanlah kami ke dalam syurga bersama orang-orang yang berbuat kebajikan. Ya Tuhan yang Maha Mulia Iagi Maha Pengampun. Ya Tuhan alam semesta."
    }],
    "categoryKey": ["tawaf"],
    "audio": "doa_dari_rukun_yamani_hingga_hajar_aswad.mp3"
  },
  {
    "id": 28,
    "titleEn": "6th Round Of Tawaf",
    "titleMy": "Doa Tawaf Pusingan Keenam",
    "doa": [{
      "id": 1,
      "arabic": "اَللّٰهُمَّ إِنَّ لَكَ عَلَيَّ حُقُوقًا كَثِيرَةً فِيمَا بَيْنِي وَبَيْنَكَ وَحُقُوقًا كَثِيرَةً فِيمَا بَيْنِي\nوَبَيْنَ خَلْقِكَ ، اَللّٰهُمَّ مَا كَانَ لَكَ مِنْهُ فَاغْفِرْهُ لِي وَمَا كَانَ لِخَلْقِكَ\nفَتَحَمَّلهُ عَنِّي وَأَغْنِنِي بِحَلَالِكَ عَنْ حَرَامِكَ وَبِطَاعَتِكَ عنْ مَعْصِيَتِكَ\n\nوَبِفَضْلِكَ عَمَّنْ سِوَاكَ يَا وَاسِعَ المَغْفِرَةِ، اَللّٰهُمَّ إِنَّ بَيْتَكَ عَظِيمٌ\n وَوَجْهَكَ كَرِيْمٌ، وَأَنْتَ يَا اللَّهُ، حَلِيمٌ كَرِيمٌ عَظِيمٌ تُحِبُّ العَفْوَ فَاعْفُ عَنِّي",
      "translationEn": "O Allah, Your rights are great for me, as well as those related to me and Your creatures. All your rights against me, forgive me about them, and what belongs to your servant to me, then set me free from it. Satisfy me with the lawful sustenance that You give, free from what is haram. Give me obedience to You and keep me from being disobedient to You. Suffice Your gift for me, so that I do not need anything else, O Lord of the Most Abundant Your forgiveness. O Allah, verily Thy house is great, Thy face is noble, and You, O Allah, are Most Merciful, Most Merciful, and Most Wise. You love forgiveness, forgive me.",
      "translationMy": "Ya Allah, hakMu sungguh banyak padaku, begitu juga yang berkaitan antara aku dan makhlukMu. Segala hakMu terhadapku, ampunilah aku tentang itu, dan mana yang termasuk hak hambaMu padaku, maka bebaskanlah aku daripadanya. Cukupkan aku dengan rezeki yang halal yang Engkau berikan, terbebas dari yang haram. Kurniakanlah aku ketaatan padaMu dan jauhkanlah aku dari kederhakaan terhadapMu. Cukupkan bagiku kurniaanMu, sehingga aku tidak memerlukan selain itu, wahai Tuhan Yang Maha Luas keampunanMu. Ya Allah, sesungguhnya rumahMu Agung, wajahMu Mulia, dan Engkau Ya Allah Maha Penyayang, Pemurah dan Maha Bijaksana. Engkau menyukai keampunan, ampunilah aku."
    }],
    "categoryKey": ["tawaf"],
    "audio": "doa_tawaf_pusingan_keenam.mp3"
  },
  {
    "id": 29,
    "titleEn": "Doa From Rukun Yamani To Hajar Aswad",
    "titleMy": "Doa Dari Rukun Yamani Hingga Hajar Aswad",
    "doa": [{
      "id": 1,
      "arabic": "اَللّٰهُمَّ رَبَّنَا آتِنَا فِي الدُّنْيَا حَسَنَةً وَفِي الآخِرَةِ حَسَنَةً وَقِنَا عَذَابَ النَّارِ\nوَ أَدخِلنَا الجَنَّةَ مَعَ الأَبرَارِ يَا عَزِيزُ يَا غَفَّارُ يَا رَبَّ العَالَمِينََ",
      "translationEn": "O Allah, O our Lord, give us good in this world and good in the Hereafter, and save us from the punishment of Hell, and admit us to Paradise with those who do righteous deeds. O Lord, the Most Forgiving. Oh the Lord of the universe.",
      "translationMy": "Ya Allah Ya Tuhan kami, berilah kami kebaikan di dunia dan kebaikan di akhirat, serta selamatkanlah kami dari azab neraka, Dan masukkanlah kami ke dalam syurga bersama orang-orang yang berbuat kebajikan. Ya Tuhan yang Maha Mulia Iagi Maha Pengampun. Ya Tuhan alam semesta."
    }],
    "categoryKey": ["tawaf"],
    "audio": "doa_dari_rukun_yamani_hingga_hajar_aswad.mp3"
  },
  {
    "id": 30,
    "titleEn": "7th Round Of Tawaf",
    "titleMy": "Doa Tawaf Pusingan Ketujuh",
    "doa": [{
      "id": 1,
      "arabic": "اَللَّهُمَّ إِنِّي أَسْأَلُكَ إِيْمَاناً كَامِلًا وَيَقِينًا صَادِقًا وَرِزْقًا وَاسِعًا\nوَقَلْبًا خَاشِعًا ولِسَانًا ذَاكِرًا وَحَلَالًا طَيِّبًا وَتَوْبَةً نَصُوحًا\nوَتَوْبَةً قَبْلَ المَوْتِ وَرَاحَةً عِنْدَ المَوتِ وَمَغْفِرَةً وَرَحْمَةً\nبَعْدَ المَوْتِ وَالْعَفْوَ عِنْدَ الحِساَبِ وَالفَوْزَ بِالْجَنَّةِ وَالنَّجَاةَ مِنَ النَّارِ\nبِرَحْمَتِكَ يَا عَزِيْزُ يَا غَفَّارُ رَبِّ زِدنِي عِلمًا وَ اَلحِقنِي بِاْلصَّالِحِينَ",
      "translationEn": "O Allah, O my Lord, I ask for the blessing of perfect faith, true confidence, sustenance, a sincere heart, a tongue who always recite zikr, halal good things provided by you, true repentance before death, forgiveness and mercy after death forgiveness when deceived by practice, success in obtaining Paradise and salvation from Hell, with the mercy of You, O Lord Almighty, the Most Forgiving, O Lord, add knowledge to me and put me in the company of the righteous.",
      "translationMy": "Ya Allah ya Tuhanku, sesungguhnya aku memohon dikurniakan iman yang sempurna, keyakinan yang sebenar-benarnya, rezeki yang Iuas, hati yang khusyuk, Iidah yang sentiasa berziki, dan perkara halal yang baik, taubat yang sebenar sebelum mati keampunan dan rahmat sesudah mati kemaafan ketika dihisabkan amalan, kejayaan  dengan mendapat syurga dan keselamatan daripada neraka, dengan belas kasihan Engkau ya Tuhan yang Maha Kuasa Iagi Maha Pengampun, ya Tuhan, tambahkan ilmu pengetahuan kepadaku dan masukkan daku ke dalam golongan orang-orang yang soleh."
    }],
    "categoryKey": ["tawaf"],
    "audio": "doa_tawaf_pusingan_ketujuh.mp3"
  },
  {
    "id": 31,
    "titleEn": "Doa From Rukun Yamani To Hajar Aswad",
    "titleMy": "Doa Dari Rukun Yamani Hingga Hajar Aswad",
    "doa": [{
      "id": 1,
      "arabic": "اَللّٰهُمَّ رَبَّنَا آتِنَا فِي الدُّنْيَا حَسَنَةً وَفِي الآخِرَةِ حَسَنَةً وَقِنَا عَذَابَ النَّارِ\nوَ أَدخِلنَا الجَنَّةَ مَعَ الأَبرَارِ يَا عَزِيزُ يَا غَفَّارُ يَا رَبَّ العَالَمِينََ",
      "translationEn": "O Allah, O our Lord, give us good in this world and good in the Hereafter, and save us from the punishment of Hell, and admit us to Paradise with those who do righteous deeds. O Lord, the Most Forgiving. Oh the Lord of the universe.",
      "translationMy": "Ya Allah Ya Tuhan kami, berilah kami kebaikan di dunia dan kebaikan di akhirat, serta selamatkanlah kami dari azab neraka, Dan masukkanlah kami ke dalam syurga bersama orang-orang yang berbuat kebajikan. Ya Tuhan yang Maha Mulia Iagi Maha Pengampun. Ya Tuhan alam semesta."
    }],
    "categoryKey": ["tawaf"],
    "audio": "doa_dari_rukun_yamani_hingga_hajar_aswad.mp3"
  },
  {
    "id": 32,
    "titleEn": "Sunnah Prayer Intention After Tawaf",
    "titleMy": "Niat Solat Sunnah Tawaf",
    "doa": [{
      "id": 1,
      "arabic": "اُصَلِّي سُنَّةَ الطَّوَافِ رَكْعَتَيْنِ لِلّٰهِ تَعَالٰى",
      "translationEn": "I intended to pray two raka'at of sunnah Tawaf for the sake of Allah Most High",
      "translationMy": "Sahaja aku solat Tawaf dua rakaat kerana Allah Taala"
    }],
    "categoryKey": ["tawaf", "intention", "niat"],
    "audio": "niat_solat_sunnat_tawaf.mp3"
  },
  {
    "id": 33,
    "titleEn": "Dua After Tawaf Prayer",
    "titleMy": "Doa Setelah Solat Sunat Tawaf",
    "doa": [{
      "id": 1,
      "arabic": "وَابْنُ عَبْدِكَ وَابْنُ أَمَتِكَ أَتَيْتُكَ بِذُنُوْبٍ كَثِيرَةٍ وَخَطَايَا جَمَّةٍ وَأَعْمَالٍ سَيِّئَةٍ\nوَهَذَا مَقَامُ الْعَائِذِ بِكَ مِنَ النَّارِ، اَللّٰهُمَّ عَافِنَا وَاعْفُ عَنَّا وَاغْفِرْ لَنَا\nإِنَّكَ أَنْتَ الْغَفُوْرُ الرَّحِيمُ، اَللّٰهُمَّ إِنَّكَ دَعَوْتَ عِبَادَكَ إِلَى بَيْتِكَ الْحَرَامِ\nوَقَدْ جِئْتُ طَالِبًا مَرْضَاتِكَ وَأَنْتَ مَنَنْتَ عَلَىَّ فَاغْفِرْ لِي وَارْحَمْنِي\nوَعَافِنِي وَاعْفُ عَنِّي إِنَّكَ عَلَى كُلِّ شَيْءٍ قَدِيرٌ، اَللّٰهُمَّ يَسِّرْلِيَ الْيُسْرَى\nوَجَنِّبْنِيَ الْعُسْرَى، وَاغْفِرْ لِي فِي الْآخِرَةِ وَالأُولَى، اَللّٰهُمَّ اعْصِمْنِي بِأَلطَافِكَ وَاجْعَلْنِي مِمَّنْ يُحِبُّكَ وَيُحِبُّ مَلَائِكَتَكَ وَرُسُلَكَ وَأَنْبِيَائَكَ وَعِبَادَكَ الصَّالِحِيْنَ\nوَأَوْلِيَائَكَ الْمُتَّقِينَ، اَللّٰهُمَّ كَمَا هَدَيْتَنِي لِلْإِسْلَامِ فَثَبِّتنِي عَلَيْهِ \nوَاسْتَعْمِلْنِي فِي طَاعَتِكَ وَطَاعَةِ رَسُوْلِكَ وَأَجِرْنِي مِنْ مُضِلَّاتِ الْفِتَنِ  اَللّٰهُمَّ إِنَّكَ تَعْلَمُ سِرِّي وَعَلَانِيَتِي فَاقْبَلَ مَعْذِرَتِي وَتَعْلَمُ حَاجَتِي \nفَأَعْطِنِي سُؤْلِي وَتَعْلَمُ مَا فِي نَفْسِي فَاغْفِرْ لِي ذَنْبِي\nاَللّٰهُمَّ إِنِّي أَسْأَلُكَ إِيْمَانًا دَائِمًا يُبَاشِرُ قَلْبِي وَأَسْأَلُكَ يَقِيْنًا صَادِقًا \nحَتَّى أَعْلَمَ أَنَّهُ لَنْ يُصِيبَنِي إِلَّا مَا كَتَبْتَهُ عَلَيَّ، وَرَضِّنِي بِمَا قَسَمْتَهُ لِي\nيَا ذَا الْجَلَالِ وَالْإِكْرَامِ، اَللّٰهُمَّ صَلِّ وَسَلَّمْ عَلَى حَبِيْبِكَ سَيِّدِنَا مُحَمَّدٍ\nوَعَلَى جَمِيعِ الْأَنْبِيَاءِ وَالْمُرْسَلِيْنَ، وَ آلِ كُلِّ مِنهُم وَ مَن تَبِعَهُم\nبِإِحسَانٍ إِلَى يَومِ الدِّينِ، يَا أَرحَمَ الرَّاحِمِينََ",
      "translationEn": "O Allah, this is Your holy land, Your holy mosque, Your holy house, I am Your servant and the son of Your servant, I have come with sins and many mistakes and bad deeds and this is the place for the servant who takes refuge with You from the fire of Hell. O Allah, save us, forgive us our mercy, for You are Forgiving and Merciful. O Allah, Thou hast called Thy servant to Thy holy house, and indeed I have come to ask for Thy favor, and Thou hast given me gifts. So forgive me, have mercy on me, forgive me, and forgive me, for you are in power over all things. O Allah, give me ease and keep me from poverty, forgive me in the Hereafter and in this world. O Allah, preserve me with Your meekness, and make me of those who love You, love Your angels, Your apostles, Your prophets, Your righteous servants, and Your saints. O Allah, as You have shown me to Islam, so establish me in it, direct me to Your obedience, the obedience of Your Messenger, to know what is hidden and clear from me, so accept my obedience. You know my desire, so grant me my desire, and you know what is in me, so forgive my sins. O Allah, I ask for a faith that is always alive in my heart and a true conviction until I am sure that nothing has happened to me except what You have written for me, so please me with what You have shared for me, O Lord of Greatness and Glory. O Allah, peace be upon Your beloved Muhammad and upon all the Prophets and Messengers and the families of each of them and whoever follows them until the next day. Oh Allah, who He is the Most Merciful.",
      "translationMy": "Ya Allah, sesungguhnya ini negeriMu yang suci, masjidMu yang suci rumahMu yang suci, aku adalah hambaMu dan anak kepada hambaMu, telah datang dengan dosa dan banyak kesalahan dan amalan-amalan yang buruk dan inilah tempatnya bagi hamba yang berlindung denganMu dari api neraka. Ya Allah, selamatkanlah kami, ampunilah kami kasihaniIah kami, sesungguhnya Engkau Maha Pengampun Iagi Maha Penyayang. Ya Allah, bahawasanya Engkau telah memanggil hamba-hambaMu ke rumah suciMu dan sesungguhnya aku telah datang memohon keredaanMu, dan Engkau telah memberi kurnia kepadaku. Maka ampunilah aku, kasihanilah aku, afiatkan aku dan maafkan aku, sesungguhnya Engkau berkuasa atas segala sesuatu. Ya Allah, berikanlah aku kemudahan dan jauhkan aku dari kepayahan, ampunilah aku di akhirat dan di dunia. Ya Allah, peliharalah aku dengan sifat kelembutanMu, dan jadikanlah aku dari golongan mereka yang cintakanMu, cintakan malaikat-malaikatMu, rasul-rasulMu, nabi-nabiMu, hamba-hambaMu yang soleh dan wali-waliMu dan orang-orang yang bertakwa. Ya  Allah, sebagaimana  Engkau telah tunjuki aku kepada Islam, maka tetapkanlah aku di dalamnya, arahkanlah aku kepada ketaatanMu, ketaatan rasulMu, mengetahui perkara yang tersembunyi dan terang dariku, maka terimalah keuzuranku. Engkaulah yang mengetahui hajatku maka berilah keinginanku, dan Engkau mengetahui apa yang di dalam diriku, maka ampunilah dosaku. Ya Allah, aku bermohon mendapat keimanan yang sentiasa hidup dalam hatiku dan keyakinan yang benar hingga aku yakin tidak ada sesuatu yang menimpaku melainkan apa yang telah Engkau tuliskan buatku, maka redakanlah aku dengan apa yang Engkau bahagikan untukku ya Tuhan yang mempunyai Kebesaran dan Kemuliaan. Ya Allah, selawatMu atas kekasihMu Muhammad dan atas sekelian Nabi dan Rasul dan keluarga setiap orang dari mereka dan sesiapa yang mengikutnya hingga ke hari kemudian. Ya Allah, yang Maha Pengasih Iagi Maha Penyayang."
    }],
    "categoryKey": ["tawaf"],
    "audio": "doa_setelah_solat_sunat_tawaf.mp3"
  },
  {
    "id": 34,
    "titleEn": "Drinking Zam-Zam",
    "titleMy": "Cara Minum Air Zam-Zam",
    "doa": [{
      "id": 1,
      "arabic": "",
      "translationEn": ["To drink with good intentions. This is in accordance with the meaning of the words of the Prophet s.a.w. \"Zam-zam water is for something that we drink because of it", "To faced the Kaaba", "Mention the name of Allah", "Drink with three sips (breaths)", "Drink until you've had enough", "Praise Allah", "Doa"],
      "translationMy": ["Berniat dengan niat yang baik. Ini sesuai dengan maksud sabda baginda Rasulullah s.a.w. \"Air zamzam adalah untuk sesuatu yang kita minum kerananya\"", "Hadapkan muka ke Kaabah", "Menyebut nama Allah", "Minum dengan tiga tegok(nafas)", "Minum dengan sepuas-puasnya (hingga kenyang)", "Bersyukur ke hadrat Allah", "Berdoa"]
    }],
    "categoryKey": ["zam-zam"],
    "audio": ""
  },
  {
    "id": 35,
    "titleEn": "Doa Before Drinking Zam-Zam",
    "titleMy": "Doa Ketika Minum Air Zam-Zam",
    "doa": [{
      "id": 1,
      "arabic": "اَللّٰهُمَّ إِنِّي أَسأَلُكَ عِلْمًا نَافِعًا، وَرِزْقًا وَاسِعًا، وَشِفَاءً مِنْ كُلِّ دَاءٍ",
      "translationEn": "O Allah, verily I ask You for useful knowledge, and abundant sustenance, and healing from all diseases.",
      "translationMy": "Ya Allah, sesungguhnya aku bermohon kepada Engkau ilmu yang bermanfaat, dan rezeki yang Iuas (banyak), dan sembuh dari segala penyakit."
    }],
    "categoryKey": ["zam-zam"],
    "audio": "doa_ketika_minum_air_zamzam.mp3"
  },
  {
    "id": 36,
    "titleEn": "Haj Sa'i Intention",
    "titleMy": "Niat Sa'i Haji",
    "doa": [{
      "id": 1,
      "arabic": "نَوَيْتُ أَنْ أَسْعَى مَا بَيْنَ الصَّفَا وَالْمَرْوَةِ سَعْيَ الْحَجِّ سَبْعَةَ أَشْوَاطٍ لِلّٰهِ تَعَالَى",
      "translationEn": "I intend to perform Sai between Safa and Marwah, the Sai of Hajj in seven rounds for Allah the Almighty.",
      "translationMy": "Sahaja aku berniat sai antara Safa dan Marwah, Sai Haji tujuh perjalanan kerana Allah Taala."
    }],
    "categoryKey": ["sa'i"],
    "audio": "niat_sai_haji.mp3"
  },
  {
    "id": 37,
    "titleEn": "Umrah Sa'i Intention",
    "titleMy": "Niat Sa'i Umrah",
    "doa": [{
      "id": 1,
      "arabic": "نَوَيْتُ أَنْ أَسْعَى مَا بَيْنَ الصَّفَا وَالْمَرْوَةِ سَعْيَ الْعُمرَةِ سَبْعَةَ أَشْوَاطٍ لِلّٰهِ تَعَالَى",
      "translationEn": "I intend to perform sa'i between Safa and Marwah, the sa'i of Umrah in seven rounds for Allah the Almighty.",
      "translationMy": "Sahaja aku berniat sa'i antara Safa dan Marwah, sa'i Umrah tujuh perjalanan kerana Allah Taala."
    }],
    "categoryKey": ["tawaf", "intention", "niat"],
    "audio": "niat_sai_umrah.mp3"
  },
  {
    "id": 38,
    "titleEn": "To begin Sa'i, go to Mount Safa and climb to the top, while facing the qibla, recite the following du'a.",
    "titleMy": "Untuk memulakan Sa'i, pergilah ke Bukit Safa dan naik ke atasnya, sambil menghadap qiblat, bacalah doa berikut.",
    "doa": [{
      "id": 1,
      "arabic": "بِسْمِ اللهِ الرَّحْمَنِ الرَّحِيْمِ\nأَبْدَأُ بِمَا بَدَأَ اللَّهُ بِهِ وَرَسُولُهُ. إِنَّ الصَّفَا وَالْمَرْوَةَ مِنْ شَعَائِرِ اللَّهِ فَمَنْ حَجَّ الْبَيْتَ\nأَوِ اعْتَمَرَ فَلَا جُنَاحَ عَلَيْهِ  أَنْ يَطَّوَّفَ بِهِمَا وَمَنْ تَطَوَّعَ خَيْرًا فَإِنَّ اللَّهَ شَاكِرٌ عَلَيْمٌ\nاَللهُ أَكْبَرُ، اَللهُ أَكْبَرُ، اَللهُ أَكْبَرُ لَا إِلٰهَ إِلَّا اللهُ، اَللهُ أَكْبَرُ وَلِلّٰهِ الْحَمْدُ\nاَلْحَمْدُ لِلَّهِ عَلَى مَا هَدَانَا، اَلْحَمْدُ لِلَّهِ عَلَى مَا أَوْلَانَا لَا إِلٰهَ إِلَّا اللَّهُ وَحْدَهُ لَا شَرِيكَ لَهُ\nلَهُ الْمُلْكُ وَلَهُ الْحَمْدُ يُحْيِي وَيُمِيْتُ بِيَدِهِ الْخَيْرُ وَ هُوَ عَلَى كُلِّ شَيْءٍ قَدِيرٌ\n لَا إِلٰهَ إِلَّا اللَّهُ وَحْدَهُ صَدَقَ وَعْدَهُ، وَنَصَرَ عَبْدَهُ وَهَزَمَ الأَحْزَابَ وَحْدَهُ\nلَا إِلٰهَ إِلَّا اللهُ وَلَا نَعْبُدُ إِلَّا إِيَّاهُ مُخْلِصِينَ لَهُ الدِّيْنَ وَلَوْكَرِهَ الْكَافِرُوْنَ",
      "translationEn": "In the name of Allah, the Most Gracious, the Most Merciful. I begin with what has been begun by Allah and His Messenger. Indeed, Safa and Marwah are among the signs of Allah's greatness. It is no sin for anyone who performs Hajj or Umrah at the House of Allah to walk (sa'i) between the two (Safa and Marwah). And whoever does good voluntarily, then indeed, Allah accepts it and He is All-Knowing.\nAllah is the Greatest (x3)  there is no god but Allah. All praise is due to Allah for guiding us. All praise is for Allah, the One, who has no partner. Power belongs to Him and all praise is due to Him. He is the One who gives life and causes death. All goodness is in His grip. And He is Most Powerful over all things. There is no god but Him, the One. He has fulfilled His promise. He has helped His servant and He has destroyed those evil groups by Himself. There is no god but Allah. We do not worship anything except Him alone. We all devote our religion to Him even though the disbelievers do not like it.",
      "translationMy": "Dengan nama Allah yang Maha Pengasih, Maha Penyayang. Aku mulai dengan apa yang telah dimulai Allah dan Rasulnya. Sesungguhnya Safa dan Marwah adalah sebahagian dari tanda-tanda kebesaran Allah. Barangsiapa yang menunaikan ibadat haji atau umrah ke Baitullah, maka tiada salahnya berjalan (sai) di antara keduanya (Safa dan Marwah). Dan barangsiapa yang berbuat baik dengan sukarela, maka sesungguhnya Allah maha menerima dan Maha Mengetahui,\nAllah yang Maha Besar (x3) tiada Tuhan melainkan Allah. Segala puji bagi Allah kerana memberi hidayah kepada kami. Segala puji bagi Allah yang Maha Esa tiada sekutu bagiNya. Kekuasaan juga bagiNya dan segala puji bagiNya. Dia yang menghidupkan dan yang mematikan. Segala kebaikan dalam genggamanNya. Dan Dia amat berkuasa atas segala sesuatu. Tiada Tuhan melainkan Dia yang Maha Esa. Dia telah menunaikan janjiNya. Dia telah menolong hambaNya dan Dia telah memusnahkan kumpulan-kumpulan jahat itu dengan sendiriNya. Tiada Tuhan melainkan Allah. TidakIah kami menyembah akan sesuatu apa pun juga melainkan hanya akan Dia saja. Kami semua ikhlaskan agama untukNya walaupun orang-orang kafir tidak menyukainya."
    }],
    "categoryKey": ["sa'i"],
    "audio": "doa_memulakan_sai.mp3"
  },
  {
    "id": 39,
    "titleEn": "1st Sa'i Supplication (Safa → Marwah)",
    "titleMy": "Doa Sa'i Pertama (Safa → Marwah)",
    "doa": [{
      "id": 1,
      "arabic": "اَللهُ أَكْبَرُ، اَللهُ أَكْبَرُ، اَللهُ أَكْبَرُ كَبِيرًا، وَالْحَمْدُ لِلَّهِ كَثِيرًا، سُبْحَانَ اللهِ الْعَظِيمِ\nوَبِحَمْدِهِ الْكَرِيمِ بُكْرَةً وَأَصِيلًا، وَمِنَ اللَّيْلِ فَاسْجُدْ لَهُ وَسَبِّحْهُ لَيْلًا طَوِيلًا\nلَا إِلٰهَ إِلَّا اللهُ وَحْدَهُ صَدَقَ وَعْدَهُ، وَنَصَرَ عَبْدَهُ، وَهَزَمَ الْأَحْزَابَ وَحْدَهُ\nلَا شَيْءَ قَبْلَهُ وَلَا بَعْدَهُ، يُحْيِي وَيُمِيتُ، وَهُوَحَيٌّ دَائِمًا لَا يَمُوْتُ\nوَلَا يَفُوْتُ أَبَدًا بِيَدِهِ الْخَيْرُ وَإِلَيْهِ الْمَصِيرُ، وَهُوَ عَلَى كُلِّ شَيْءٍ قَدِيرٌ",
      "translationEn": "Allah is the Greatest, Allah is the Greatest, Allah is the Greatest, Allah is the Greatest with all His greatness. All praise is due to Allah. Glorified is Allah, the Most Exalted, with noble praises every morning, evening, and night. There is no deity except Allah alone. He fulfills His promise, aids His servant, and destroys His enemies. Nothing, whether it precedes Him or comes after Him, gives life or causes death. He is the Ever-Living, never dies, and is eternal forever. In His hands are all good deeds, and to Him is the return, and He is the Almighty over all things.",
      "translationMy": "Allah Maha Besar Allah Maha Besar Allah Maha Besar Allah Maha Besar dengan segala kebesaranNya. Segala puji bagi Allah. Maha Suci Allah, yang Maha Agung, dengan puji-pujian yang mulia setiap pagi, petang dan malam. Tiada Tuhan kecuali Allah semata. Dia memenuhi janjiNya, menolong hambaNya serta menghancurkan sendiri musuh-musuhNya. Tiada sesuatu, baik yang mendahuluiNya, mahupun sesudahNya menghidupkan dan mematikan. Dia yang selalu hidup, tidak mati dan Iuput selama-lamanya. Di tanganNya segala kebajikan dan kepadaNyalah tempat kembali dan Dialah yang Maha Kuasa atas segalanya."
    }],
    "categoryKey": ["sa'i"],
    "audio": "doa_sai_pertama.mp3"
  },
  {
    "id": 40,
    "titleEn": "Dua while brisk walking between the green lights",
    "titleMy": "Doa ketika berlari anak diantara tiang hijau",
    "doa": [{
      "id": 1,
      "arabic": "رَبِّ اغْفِرْ وَارْحَمْ وَاعْفُ وَتَكَرَّمْ، وَتَجَاوَزْ عَمَّا تَعْلَمُ إِنَّكَ تَعْلَمُ مَا لَا نَعْلَمُ إِنَّكَ أَنْتَ اللهُ الْأَعَزُّ الْأَكْرَمُ",
      "translationEn": "O Allah, forgive, love, and pardon us, and erase what You know about our sins; indeed, You are All-Knowing of what we do not know. Indeed, You are Allah, the Most Glorious and Most Gracious.",
      "translationMy": "Ya Allah, ampunilah, sayangilah dan maafkanlah serta hapuskanlah apa-apa yang Engkau ketahui tentang dosa kami sesungguhnya Engkau Maha Mengetahui apa yang tidak kami ketahui. Sesungguhnya Engkau adalah Allah yang Maha Mulia dan Maha Pemurah."
    }],
    "categoryKey": ["sa'i"],
    "audio": "doa_antara_tiang_hijau.mp3"
  },
  {
    "id": 41,
    "titleEn": "After passing the green lights, recite the following du'a",
    "titleMy": "Setelah melintasi tiang hijau, baca do'a berikut",
    "doa": [{
      "id": 1,
      "arabic": "رَبِّ أَجِرْنَا مِنَ النَّارِ سَالِمِينَ، وَأَدْخِلْنَا الْجَنَّةَ غَانِمِيْنَ فَرِحِيْنَ مُسْتَبْشِرِيْنَ\nمَعَ عِبَادِكَ الصَّالِحِيْنَ، مَعَ الَّذِيْنَ أَنْعَمَ اللهُ عَلَيْهِمْ مِنَ النَّبِيِّينَ وَالصِّدِّيقِينَ\nوَالشُّهَدَاءِ وَالصّٰلِحِيْنَ وَحَسُنَ أُولٰئِكَ رَفِيقًا، ذٰلِكَ الْفَضْلُ مِنَ اللَّهِ\nوَكَفَى بِاللَّهِ عَلِيْمًا، لَا إِلٰهَ إِلَّا اللهُ حَقًّا حَقًّا، لَا إِلٰهَ إِلَّا اللهُ تَعَبُّدًا ورِقًّا\nلَا إِلٰهَ إِلَّا اللهُ وَلَا نَعْبُدُ إِلَّا إِيَّاهُ مُخْلِصِينَ لَهُ الدِّينَ وَلَوْكَرِهَ الْكَافِرُوْنَ",
      "translationEn": "O our Lord, save us from the fire of hell, and let us enter paradise together with Your servants whom You have granted blessings among the prophets, the truthful, the martyrs, and the righteous. And they are the best of companions. All of this is a shower of grace from Allah s.w.t. Indeed, Allah is All-Knowing. There is no god but Allah truly. There is no god but Allah, I declare it as a sign of servitude. There is no god but He. We dedicate our religion sincerely for Him, even though the disbelievers hate it.",
      "translationMy": "Ya Tuhan kami, selamatkanlah kami dari api neraka, dan gembirakanlah kami masuk ke syurga bersama-sama hambaMu yang telah Engkau kurniakan nikmat daripada para Nabi, para sidiqqin, para syuhada dan solehin.Dan mereka itulah sebaik-baik teman. ltu semua limpah kurnia dari Allah s.w.t. Sesungguhnya Allah Maha Mengetahui. Tiada Tuhan melainkan Allah dengan sebenar. Tiada Tuhan melainkan Allah, aku menyebutnya tanda pengabdian. Tiada Tuhan melainkan Dia. Kami ikhlaskan agama keranaNya walaupun orang-orang kafir benci."
    }],
    "categoryKey": ["sa'i"],
    "audio": "doa_setelah_melintas_tiang_hijau.mp3"
  },
  {
    "id": 42,
    "titleEn": "Doa when approaching Safa or Marwah hill",
    "titleMy": "Doa setiap kali menaiki bukit Safa atau Marwah",
    "doa": [{
      "id": 1,
      "arabic": "إِنَّ الصَّفَا وَالْمَرْوَةَ مِنْ شَعَائِرِ اللهِ فَمَنْ حَجَّ البَيتَ اَوِاعْتَمَرَ فَلَا جُنَاحَ عَلَيْهِ أَنْ يَطَّوَّفَ بِهِمَا، وَمَنْ تَطَوَّعَ خَيْرًا فَإِنَّ اللَّهَ شَاكِرٌ عَلَيْمٌ",
      "translationEn": "Indeed, Safa and Marwah are among the signs of Allah's greatness. Whoever performs the pilgrimage (hajj) and umrah to the House of Allah, there is no sin for him to walk between the two, and whoever does good willingly, indeed Allah is Most Accepting and Most Knowing.",
      "translationMy": "Sesungguhnya Safa dan Marwah itu adalah sebagai tanda-tanda kebesaran Allah. Barangsiapa yang menunaikan ibadat haji dan umrah ke Baitullah, maka tiada salahnya untuk berjalan di antara keduanya, dan barang siapa yang berbuat baik dengan suka rela, maka sesungguhnya Allah Maha Menerima dan Maha Mengetahui."
    }],
    "categoryKey": ["sa'i"],
    "audio": "doa_naik_bukit_safa_marwah.mp3"
  },
  {
    "id": 43,
    "titleEn": "2nd Sa'i Supplication (Marwah → Safa)",
    "titleMy": "Doa Sa'i Kedua (Marwah → Safa)",
    "doa": [{
      "id": 1,
      "arabic": "اَلله أَكْبَرُ، اَلله أَكْبَرُ، اَلله أَكْبَرُ، وَلِلّٰهِ الْحَمْدُ لَا إِلٰهَ إِلَّا اللهُ الْوَاحِدُ الْفَرْدُ الصَّمَدُ\nالَّذِي لَمْ يَتَّخِذْ صَاحِبَةً وَلَا وَلَدًا، وَلَمْ يَكُنْ لَهُ شَرِيْكٌ فِي الْمُلْكِ، وَلَمْ يَكُنْ لَهُ وَلِيٌّ مِنَ الذُّلِّ\n وَكَبِّرْهُ تَكْبِيرًا، اَللّٰهُمَّ إِنَّكَ قُلْتَ فِي كِتَابِكَ الْمُنزَلِ، أُدْعُونِي أَسْتَجِبْ لَكُمْ، دَعَوْنَاكَ رَبَّنَا \nكَمَا أَمَرْتَنَا، فَاسْتَجِبْ لَنَا كَمَا وَعَدْتَنَا إِنَّكَ لَا تُخْلِفُ الْمِيعَادَ، رَبَّنَا إنَّنَا سَمِعْنَا مُنَادِيًا يُنَادِي لِلْإِيْمَانِ أَنْ آمِنُوا بِرَبِّكُمْ فَآمَنَّا رَبَّنَا فَاغْفِرْ لَنَا ذُنُوبَنَا وَكَفِّرْ عَنَّا سَيِّئَاتِنَا\nوَتَوَفَّنَا مَعَ الْأَبْرَارِ، رَبَّنَا وَآتِنَا مَا وَعَدْتَنَا عَلَى رُسُلِكَ وَلَا تُخْزِنَا يَوْمَ الْقِيَامَةِ\nإِنَّكَ لَا تُخْلِفُ الْمِيْعَادَ، رَبَّنَا عَلَيْكَ تَوَكَّلْنَا وَإِلَيْكَ أَنَبنَا، وَإِلَيْكَ الْمَصِيرُ\nرَبَّنَا اغْفِرْ لَنَا وَلِإِخْوَانِنَا الَّذِيْنَ سَبَقُونَا بِالْإِيْمَانِ\nوَلَا تَجْعَلْ فِي قُلُوْبِنَا غِلًّا لِلَّذِينَ آمَنُوا رَبَّنَا إنَّكَ رَؤُوفٌ رَحِيمٌ",
      "translationEn": "Allah is the Greatest, Allah is the Greatest, Allah is the Greatest. All praises are due to Allah. There is no God but Allah, the One, the refuge of all things. He does not have a wife nor children. There is no partner for Him in power. No representative for Him from the lowly, and glorified is He with all greatness. O Allah, You commanded in the Holy Book that You revealed: 'Ask of Me, I will grant you.' O Lord, we ask of You, as You have commanded. You do not break promises. O our Lord, indeed we have heard the one who called to believe: 'Believe in your Lord.' So, we believe. Forgive our sins and remove evil from ourselves and let us die with the good ones. O our Lord, grant us what You have promised through Your messengers. And do not disappoint us on the Day of Judgment. Indeed, You do not break promises. O our Lord, we surrender to You and to You we return, and You are our focal point of hope. O our Lord, forgive us and our brothers who have preceded us in faith, and do not let there be in our hearts any envy towards those who believe. O our Lord, You are the Most Merciful and Most Compassionate.",
      "translationMy": "Allah Maha Besar, Allah Maha Besar, Allah Maha Besar. Hanya bagi Allah segala puji. Tiada Tuhan kecuali Allah yang Maha Esa, tempat bergantung segala sesuatu. Yang tiada beristeri dan tiada beranak. Tiada sekutu bagiNya dalam kekuasaan. Tiada bagiNya wakil dari yang hina, dan agunglah Dia dengan segenap kebesaran. Ya Allah, Engkau berfirman dalam Kitab Suci yang Engkau turunkan: “Mohonlah kepadaKu, Aku perkenankan bagimu” Ya Tuhan, kami mohon kepadaMu, sebagaimana Kau perintahkan. Engkau tidak memungkiri janji. Ya Tuhan kami, sesungguhnya kami telah mendengar orang yang menyeru supaya beriman: “Berimanlah kamu dengan Tuhanmu.” Maka kami beriman. Ampunilah dosa-dosa kami dan hapuskanlah kejahatan dari diri kami dan wafatkanlah kami bersama orang-orang yang baik. Ya Tuhan kami, anugerahilah kami dengan apa yang telah Engkau janjikan melalui rasul-rasulMu. Dan janganlah Engkau kecewakan kami pada hari kiamat. Sesungguhnya Engkau tidak mungkir janji. Ya Tuhan kami kepadaMu kami menyerah dan kepadaMu kami kembali dan Engkaulah tumpuan harapan kami. Ya Tuhan kami, ampunilah kami serta saudara-saudara kami yang telah mendahului kami dalam beriman, dan janganlah Engkau jadikan dalam hati kami rasa dengki kepada orang-orang yang beriman. Ya Tuhan kami, Engkau Maha Pengasih dan Maha Penyayang."
    }],
    "categoryKey": ["sa'i"],
    "audio": "doa_sai_kedua.mp3"
  },
  {
    "id": 44,
    "titleEn": "Dua while brisk walking between the green lights",
    "titleMy": "Doa ketika berlari anak diantara tiang hijau",
    "doa": [{
      "id": 1,
      "arabic": "رَبِّ اغْفِرْ وَارْحَمْ وَاعْفُ وَتَكَرَّمْ، وَتَجَاوَزْ عَمَّا تَعْلَمُ إِنَّكَ تَعْلَمُ مَا لَا نَعْلَمُ إِنَّكَ أَنْتَ اللهُ الْأَعَزُّ الْأَكْرَمُ",
      "translationEn": "O Allah, forgive, love, and pardon us, and erase what You know about our sins; indeed, You are All-Knowing of what we do not know. Indeed, You are Allah, the Most Glorious and Most Gracious.",
      "translationMy": "Ya Allah, ampunilah, sayangilah dan maafkanlah serta hapuskanlah apa-apa yang Engkau ketahui tentang dosa kami sesungguhnya Engkau Maha Mengetahui apa yang tidak kami ketahui. Sesungguhnya Engkau adalah Allah yang Maha Mulia dan Maha Pemurah."
    }],
    "categoryKey": ["sa'i"],
    "audio": "doa_antara_tiang_hijau.mp3"
  },
  {
    "id": 45,
    "titleEn": "Doa when approaching Safa or Marwah hill",
    "titleMy": "Doa setiap kali menaiki bukit Safa atau Marwah",
    "doa": [{
      "id": 1,
      "arabic": "إِنَّ الصَّفَا وَالْمَرْوَةَ مِنْ شَعَائِرِ اللهِ فَمَنْ حَجَّ البَيتَ اَوِاعْتَمَرَ فَلَا جُنَاحَ عَلَيْهِ\nأَنْ يَطَّوَّفَ بِهِمَا، وَمَنْ تَطَوَّعَ خَيْرًا فَإِنَّ اللَّهَ شَاكِرٌ عَلَيْمٌ",
      "translationEn": "Indeed, Safa and Marwah are among the signs of Allah's greatness. Whoever performs the pilgrimage (hajj) and umrah to the House of Allah, there is no sin for him to walk between the two, and whoever does good willingly, indeed Allah is Most Accepting and Most Knowing.",
      "translationMy": "Sesungguhnya Safa dan Marwah itu adalah sebagai tanda-tanda kebesaran Allah. Barangsiapa yang menunaikan ibadat haji dan umrah ke Baitullah, maka tiada salahnya untuk berjalan di antara keduanya, dan barang siapa yang berbuat baik dengan suka rela, maka sesungguhnya Allah Maha Menerima dan Maha Mengetahui."
    }],
    "categoryKey": ["sa'i"],
    "audio": "doa_naik_bukit_safa_marwah.mp3"
  },
  {
    "id": 46,
    "titleEn": "3rd Sa'i Supplication (Safa → Marwah)",
    "titleMy": "Doa Sa'i Ketiga (Safa → Marwah)",
    "doa": [{
      "id": 1,
      "arabic": "اَللهُ أَكْبَرُ اَللهُ أَكْبَرُ اَللهُ أَكْبَرُ، وَلِلَّهِ الْحَمْدُ، رَبَّنَا أَتْمِمْ نُوْرَنَا وَاغْفِرْلَنَا\nإِنَّكَ عَلَى كُلِّ شَيْءٍ قَدِيرٌ ، اَللّٰهُمَّ إِنِّي أَسْأَلُكَ الْخَيْرَ كُلَّهُ عَاجِلَهُ وَآجِلَهُ\nوَأَسْتَغْفِرُكَ لِذَنبِي، وَأَسْأَلُكَ رَحْمَتَكَ يَا أَرْحَمَ الرَّاحِمِينَ",
      "translationEn": "Allah is the Greatest, Allah is the Greatest, Allah is the Greatest. All praise is due to Allah. O Allah, perfect the bright light for us and forgive us. You are All-Powerful over all things. O Allah, indeed I ask You for all that is good, both immediate and delayed. And I ask You for forgiveness for my sins, and I also seek Your mercy, O Lord of All Compassion and Mercy.",
      "translationMy": "Allah Maha Besar, Allah Maha Besar, Allah Maha Besar. Bagi Allah segala pujian. Ya Allah, sempurnakanlah cahaya terang bagi kami dan ampunilah kami. Engkau Maha Kuasa atas segala sesuatu. Ya Allah, Sesungguhnya aku mohon kepadaMu kebaikan seluruhnya, yang cepat dan yang lambat. Dan aku mohon kepadaMu ampun atas dosaku, juga aku mohon kepadaMu rahmatMu, wahai Tuhan Yang Maha Pengasih dan Penyayang."
    }],
    "categoryKey": ["sa'i"],
    "audio": "doa_sai_ketiga.mp3"
  },
  {
    "id": 47,
    "titleEn": "Dua while brisk walking between the green lights",
    "titleMy": "Doa ketika berlari anak diantara tiang hijau",
    "doa": [{
      "id": 1,
      "arabic": "رَبِّ اغْفِرْ وَارْحَمْ وَاعْفُ وَتَكَرَّمْ، وَتَجَاوَزْ عَمَّا تَعْلَمُ إِنَّكَ تَعْلَمُ مَا لَا نَعْلَمُ إِنَّكَ أَنْتَ اللهُ الْأَعَزُّ الْأَكْرَمُ",
      "translationEn": "O Allah, forgive, love, and pardon us, and erase what You know about our sins; indeed, You are All-Knowing of what we do not know. Indeed, You are Allah, the Most Glorious and Most Gracious.",
      "translationMy": "Ya Allah, ampunilah, sayangilah dan maafkanlah serta hapuskanlah apa-apa yang Engkau ketahui tentang dosa kami sesungguhnya Engkau Maha Mengetahui apa yang tidak kami ketahui. Sesungguhnya Engkau adalah Allah yang Maha Mulia dan Maha Pemurah."
    }],
    "categoryKey": ["sa'i"],
    "audio": "doa_sai_keempat.mp3"
  },
  {
    "id": 48,
    "titleEn": "After passing the green lights, recite the following du'a",
    "titleMy": "Setelah melintasi tiang hijau, baca do'a berikut",
    "doa": [{
      "id": 1,
      "arabic": "رَبِّ أَجِرْنَا مِنَ النَّارِ سَالِمِينَ، وَأَدْخِلْنَا الْجَنَّةَ غَانِمِيْنَ فَرِحِيْنَ مُسْتَبْشِرِيْنَ\nمَعَ عِبَادِكَ الصَّالِحِيْنَ، مَعَ الَّذِيْنَ أَنْعَمَ اللهُ عَلَيْهِمْ مِنَ النَّبِيِّينَ وَالصِّدِّيقِينَ\nوَالشُّهَدَاءِ وَالصّٰلِحِيْنَ وَحَسُنَ أُولٰئِكَ رَفِيقًا، ذٰلِكَ الْفَضْلُ مِنَ اللَّهِ\nوَكَفَى بِاللَّهِ عَلِيْمًا، لَا إِلٰهَ إِلَّا اللهُ حَقًّا حَقًّا، لَا إِلٰهَ إِلَّا اللهُ تَعَبُّدًا ورِقًّا\nلَا إِلٰهَ إِلَّا اللهُ وَلَا نَعْبُدُ إِلَّا إِيَّاهُ مُخْلِصِينَ لَهُ الدِّينَ وَلَوْكَرِهَ الْكَافِرُوْنَ",
      "translationEn": "O Lord, increase my knowledge, do not turn my heart away after You have guided me, grant me mercy from You, for indeed You are the Most Generous. O Allah, bless me with my hearing and my sight, there is no God but You. O Allah, I seek refuge with You from the punishment of the grave, there is no God but You. Glory be to You, indeed I am among the wrongdoers. O Allah, indeed I seek refuge from disbelief and poverty, O Allah, I seek refuge with Your pleasure from Your wrath, and with Your forgiveness from Your punishment. I cannot praise You, as You praise Yourself, all praise is Yours until You are pleased.",
      "translationMy": "Ya Tuhan, tambahkan aku ilmu, jangan palingkan hatiku setelah Engkau beri hidayah kepadaku, berilah aku rahmat dariMu, sesungguhnya Engkau Maha Pemberi. Ya Allah, baikilah keadaan aku dengan pendengaran dan penglihatan aku, tiada Tuhan melainkan Engkau. Ya Allah, aku berlindung denganMu dari seksa kubur, tiada Tuhan melainkan Engkau. Maha Suci Engkau, sesungguhnya aku dari golongan zalim. Ya Allah, sesungguhnya aku berlindung dari kekufuran dan kepapaan, Ya Allah, aku berlindung dengan keredaanMu dari kemurkaanMu, dan dengan kemaafanMu dari azabMu. Aku tidak dapat memuji kepadaMu, seperti pujiMu sendiri kepada diriMu, segala puji bagiMu hingga Engkau redhai."
    }],
    "categoryKey": ["sa'i"],
    "audio": "doa_setelah_melintas_tiang_hijau.mp3"
  },
  {
    "id": 49,
    "titleEn": "Doa when approaching Safa or Marwah hill",
    "titleMy": "Doa setiap kali menaiki bukit Safa atau Marwah",
    "doa": [{
      "id": 1,
      "arabic": "إِنَّ الصَّفَا وَالْمَرْوَةَ مِنْ شَعَائِرِ اللهِ فَمَنْ حَجَّ البَيتَ اَوِاعْتَمَرَ فَلَا جُنَاحَ عَلَيْهِ\nأَنْ يَطَّوَّفَ بِهِمَا، وَمَنْ تَطَوَّعَ خَيْرًا فَإِنَّ اللَّهَ شَاكِرٌ عَلَيْمٌ",
      "translationEn": "Indeed, Safa and Marwah are among the signs of Allah's greatness. Whoever performs the pilgrimage (hajj) and umrah to the House of Allah, there is no sin for him to walk between the two, and whoever does good willingly, indeed Allah is Most Accepting and Most Knowing.",
      "translationMy": "Sesungguhnya Safa dan Marwah itu adalah sebagai tanda-tanda kebesaran Allah. Barangsiapa yang menunaikan ibadat haji dan umrah ke Baitullah, maka tiada salahnya untuk berjalan di antara keduanya, dan barang siapa yang berbuat baik dengan suka rela, maka sesungguhnya Allah Maha Menerima dan Maha Mengetahui."
    }],
    "categoryKey": ["sa'i"],
    "audio": "doa_naik_bukit_safa_marwah.mp3"
  },
  {
    "id": 50,
    "titleEn": "4th Sa'i Supplication (Marwah → Safa)",
    "titleMy": "Doa Sa'i Keempat (Marwah → Safa)",
    "doa": [{
      "id": 1,
      "arabic": "اَللهُ أَكبَرُ، اَللهُ أَكبَرُ، اَللهُ أَكبَرُ، وَلِلّٰهِ الْحَمْدُ، اَللّٰهُمَّ إِنِّي أَسْأَلُكَ مِنْ خَيْرِ مَا تَعْلَمُ\nوَأَعُوْذُ بِكَ مِنْ شَرِّ مَا تَعْلَمُ إِنَّكَ أَنْتَ عَلاَّمُ الْغُيُوبِ، لَا إِلٰهَ إِلَّا اللهُ الْمَلِكُ الْحَقُّ الْمُبِيْنَ مُحَمَّدٌ رَسُولُ اللَّهُ، الصَّادِقُ الْوَعْدُ الْأَمِيْنِ، اَللّٰهُمَّ إِنِّي أَسْأَلُكَ كَمَا هَدَيْتَنِي لِلْإِسْلَامِ\nأَن لَا تَنزِعَهُ مِنِّي حَتَّى تَتَوَفَّانِي وَأَنَا مُسْلِمٌ، اَللّٰهُمَّ اجْعَلْ فِي قَلْبِي نُورًا\nوَفِي سَمْعِي نُورًا، وَفِي بَصَرِي نُوْرًا، اَللّٰهُمَّ اشْرَحْ لِي صَدْرِي، وَيَسِّرْ لِي أَمْرِي\nوَأَعُوْذُ بِكَ مِنْ شَرِّ وَسَاوِسِ الصَّدْرِ، وَشَتَاتِ الْأَمْرِ وَفِتْنَةِ الْقَبْرِ\nاَللّٰهُمَّ إِنِّي أَعُوْذُ بِكَ مِنْ شَرِّ مَا يَلِجُ فِي اللَّيْلِ وَشَرِّ مَا يَلِجُ فِي النَّهَارِ\nوَمِنْ شَرِّ مَا تَهُبُّ بِهِ الرِّيَاحِ يَا أَرْحَمَ الرَّاحِمِيْنَ\nسُبْحَانَكَ مَا عَبَدْنَاكَ حَقَّ عِبَادَتِكَ يَا اَللهُ\nسُبْحَانَكَ مَا ذَكَرْنَاكَ حَقَّ ذِكْرِكَ يَا اَللهُ",
      "translationEn": "Allah is the Greatest, Allah is the Greatest, Allah is the Greatest. And to Allah belongs all praise. O Allah, indeed I ask of You the best of matters that You know, and I seek Your protection from the worst of matters that You know, and I ask for forgiveness for all that You know, indeed You are All-Knowing of the unseen. There is no god except Allah, who possesses the evident truth. Muhammad is the Messenger of Allah, whose promise is true and is trusted. O Allah, I ask of You, just as You have guided me, that I die in Islam. O Allah, grant light in my heart, my ears, and my sight. O Allah, expand my chest, and make my affairs easy, and I seek refuge in You from doubts and confusion in my affairs, and I seek refuge from the torment of the grave. O Allah, I seek refuge in You from the evil that arises in the night and the day, and the evil brought by the wind. O Lord, the Most Merciful and Most Compassionate. O Allah, we cannot worship You as we should and we cannot remember You as we ought to.",
      "translationMy": "Allah Maha Besar, Allah Maha Besar, Allah Maha Besar. Dan bagi Allah segala puji. Ya Allah, sesungguhnya aku pohon kepadaMu sebaik-baik perkara yang Engkau mengetahuinya, serta mohon perlindunganMu dari seburuk-buruk perkara yang Engkau mengetahuinya dan aku mohon ampun atas segala yang Engkau tahu, sesungguhnya Engkau Maha Mengetahui yang ghaib. Tiada Tuhan kecuali Allah yang memiliki kebenaran yang nyata. Muhammad Rasulullah yang benar janjinya Iagi dipercayai. Ya Allah, aku mohon kepadaMu, sebagaimana Engkau telah memberi petunjuk kepadaku, sehingga aku meninggal dalam Islam. Ya Allah, berilah cahaya dalam hatiku, telingaku dan penglihatanku. Ya Allah, lapangkanlah dadaku, dan mudahkanlah urusanku, dan aku berlindung kepadaMu daripada was-was dan kucar-kacir urusan dan aku berlindung daripada azab kubur. Ya Allah, aku berlindung kepadaMu dari kejahatan yang timbul pada malam dan siang hari, dan kejahatan yang dibawa oleh angin. Wahai Tuhan yang Maha Pengasih Iagi Maha Penyayang. Ya Allah kami tidak dapat menyembahMu sebagaimana yang sepatutnya dan kami tidak dapat mengingatiMu sebagaimana yang sewajarnya."
    }],
    "categoryKey": ["sa'i"],
    "audio": "doa_sai_keempat.mp3"
  },
  {
    "id": 51,
    "titleEn": "Dua while brisk walking between the green lights",
    "titleMy": "Doa ketika berlari anak diantara tiang hijau",
    "doa": [{
      "id": 1,
      "arabic": "رَبِّ اغْفِرْ وَارْحَمْ وَاعْفُ وَتَكَرَّمْ، وَتَجَاوَزْ عَمَّا تَعْلَمُ إِنَّكَ تَعْلَمُ مَا لَا نَعْلَمُ إِنَّكَ أَنْتَ اللهُ الْأَعَزُّ الْأَكْرَمُ",
      "translationEn": "Ya Allah, ampunilah, sayangilah dan maafkanlah serta hapuskanlah apa-apa yang Engkau ketahui tentang dosa kami sesungguhnya Engkau Maha Mengetahui apa yang tidak kami ketahui. Sesungguhnya Engkau adalah Allah yang Maha Mulia dan Maha Pemurah.",
      "translationMy": "O Allah, forgive, love, and pardon us, and erase what You know about our sins; indeed, You are All-Knowing of what we do not know. Indeed, You are Allah, the Most Glorious and Most Gracious."
    }],
    "categoryKey": ["sa'i"],
    "audio": "doa_antara_tiang_hijau.mp3"
  },
  {
    "id": 52,
    "titleEn": "Doa when approaching Safa or Marwah hill",
    "titleMy": "Doa setiap kali menaiki bukit Safa atau Marwah",
    "doa": [{
      "id": 1,
      "arabic": "إِنَّ الصَّفَا وَالْمَرْوَةَ مِنْ شَعَائِرِاللهِ فَمَنْ حَجَّ البَيتَ اَوِاعْتَمَرَ فَلَا جُنَاحَ عَلَيْهِ\nأَنْ يَطَّوَّفَ بِهِمَا، وَمَنْ تَطَوَّعَ خَيْرًا فَإِنَّ اللَّهَ شَاكِرٌ عَلَيْمٌ",
      "translationEn": "Indeed, Safa and Marwah are among the signs of Allah's greatness. Whoever performs the pilgrimage (hajj) and umrah to the House of Allah, there is no sin for him to walk between the two, and whoever does good willingly, indeed Allah is Most Accepting and Most Knowing.",
      "translationMy": "Sesungguhnya Safa dan Marwah itu adalah sebagai tanda-tanda kebesaran Allah. Barangsiapa yang menunaikan ibadat haji dan umrah ke Baitullah, maka tiada salahnya untuk berjalan di antara keduanya, dan barang siapa yang berbuat baik dengan suka rela, maka sesungguhnya Allah Maha Menerima dan Maha Mengetahui."
    }],
    "categoryKey": ["sa'i"],
    "audio": "doa_naik_bukit_safa_marwah.mp3"
  },
  {
    "id": 53,
    "titleEn": "5th Sa'i Supplication (Safa → Marwah)",
    "titleMy": "Doa Sa'i Kelima (Safa → Marwah)",
    "doa": [{
      "id": 1,
      "arabic": "اَللهُ أَكبَرُ، اَللهُ أَكبَرُ، اَللهُ أَكبَرُ، اَللهُ أَكبَرُ كَبِيرًا وَالْحَمْدُ لِلَّهِ كَثِيرًا\nاَللَّهُمَّ حَبِّبْ إِلَيَّ الْإِيْمَانَ وَزَيِّنْهُ فِي قَلْبِي، وَكَرِّهْ إِلَىَّ الْكُفْرَ\nوَالْفُسُوْقَ وَالْعِصْيَانَ، وَاجْعَلْنِي مِنَ الرَّاشِدِيْنَ",
      "translationEn": "Allah is the Greatest, Allah is the Greatest, Allah is the Greatest. Allah is the Greatest in all His Greatness, all praise is due to Allah. O Allah, make me love faith and adorn it in my heart. Make me hate disbelief, wickedness, and disobedience. Make me among those who are guided.",
      "translationMy": "Allah Maha Besar, Allah Maha Besar, Allah Maha Besar. Allah Maha Besar dengan segala KebesaranNya, segala puji bagi Allah. Ya Allah cintakanlah aku kepada keimanan dan hiaskanlah ia di hati ku. Bencikanlah aku kepada kekafiran, kefasikan dan kedurhakaan. Jadikanlah aku di antara orang-orang yang mendapat petunjuk."
    }],
    "categoryKey": ["sa'i"],
    "audio": "doa_sai_kelima.mp3"
  },
  {
    "id": 54,
    "titleEn": "Dua while brisk walking between the green lights",
    "titleMy": "Doa ketika berlari anak diantara tiang hijau",
    "doa": [{
      "id": 1,
      "arabic": "رَبِّ اغْفِرْ وَارْحَمْ وَاعْفُ وَتَكَرَّمْ، وَتَجَاوَزْ عَمَّا تَعْلَمُ إِنَّكَ تَعْلَمُ مَا لَا نَعْلَمُ إِنَّكَ أَنْتَ اللهُ الْأَعَزُّ الْأَكْرَمُ",
      "translationEn": "O Allah, forgive, love, and pardon us, and erase what You know about our sins; indeed, You are All-Knowing of what we do not know. Indeed, You are Allah, the Most Glorious and Most Gracious.",
      "translationMy": "Ya Allah, ampunilah, sayangilah dan maafkanlah serta hapuskanlah apa-apa yang Engkau ketahui tentang dosa kami sesungguhnya Engkau Maha Mengetahui apa yang tidak kami ketahui. Sesungguhnya Engkau adalah Allah yang Maha Mulia dan Maha Pemurah."
    }],
    "categoryKey": ["sa'i"],
    "audio": "doa_antara_tiang_hijau.mp3"
  },
  {
    "id": 55,
    "titleEn": "After passing the green lights, recite the following du'a",
    "titleMy": "Setelah melintasi tiang hijau, baca do'a berikut",
    "doa": [{
      "id": 1,
      "arabic": "اَللّٰهُمَّ إِنِّي أَعُوْذُ بِكَ مِنَ الْكُفْرِ وَالْفَقْرِ، اَللّٰهُمَّ إِنِّي أَعُوْذُ بِرِضَاكَ مِنْ سَخَطِكَ\nوَبِمُعَافَاتِكَ مِنْ عُقُوْبَتِكَ، وَ أَعُوْذُ بِكَ مِنْكَ لَا أُحْصِيْ ثَنَاءً عَلَيْكَ\nأَنْتَ كَمَا أَثْنَيْتَ عَلَى نفْسِكَ، فَلَكَ الْحَمْدُ حَتَّى تَرْضَى",
      "translationEn": "O Allah, save me from Your punishment, on the day You resurrect Your servants. O Allah, guide me with Your guidance, purify me with righteousness, and forgive me in this world and in the hereafter. O Allah, bestow upon me Your blessings, mercy, grace and sustenance. O Allah, I ask for everlasting blessings that do not change and do not disappear. O Allah, make light in my heart, my hearing, my sight, my tongue, on my right and on my left, above me and within my soul. Expand my chest and ease my affairs.",
      "translationMy": "Ya Allah, selamatkanlah aku dari azabMu, dihari Engkau membangkitkan hamba-hambaMu. Ya Allah, pimpinlah aku dengan hidayat, dan sucikanlah aku dengan takwa, dan ampunilah aku di dunia dan di akhirat. Ya Allah, Iimpahkanlah atas aku berkatMu, rahmatMu, kurniaMu dan rezekiMu.Ya Allah, aku bermohon nikmat yang berkekalan, tidak berpindah dan tidak hilang. Ya Allah, jadikanlah cahaya di dalam hatiku, pendengaranku, penglihatanku, lidahku, di kanan dan di kiriku, di atasku dan di dalam jiwaku. Lapangkanlah dadaku dan mudahkanlah urusanku"
    }],
    "categoryKey": ["sa'i"],
    "audio": "doa_setelah_melintas_tiang_hijau"
  },
  {
    "id": 56,
    "titleEn": "Doa when approaching Safa or Marwah hill",
    "titleMy": "Doa setiap kali menaiki bukit Safa atau Marwah",
    "doa": [{
      "id": 1,
      "arabic": "إِنَّ الصَّفَا وَالْمَرْوَةَ مِنْ شَعَائِرِ اللهِ فَمَنْ حَجَّ البَيتَ اَواعْتَمَرَ فَلَا جُنَاحَ عَلَيْهِ أَنْ يَطَّوَّفَ بِهِمَا، وَمَنْ تَطَوَّعَ خَيْرًا فَإِنَّ اللَّهَ شَاكِرٌ عَلَيْمٌ",
      "translationEn": "Indeed, Safa and Marwah are among the signs of Allah's greatness. Whoever performs the pilgrimage (hajj) and umrah to the House of Allah, there is no sin for him to walk between the two, and whoever does good willingly, indeed Allah is Most Accepting and Most Knowing.",
      "translationMy": "Sesungguhnya Safa dan Marwah itu adalah sebagai tanda-tanda kebesaran Allah. Barangsiapa yang menunaikan ibadat haji dan umrah ke Baitullah, maka tiada salahnya untuk berjalan di antara keduanya, dan barang siapa yang berbuat baik dengan suka rela, maka sesungguhnya Allah Maha Menerima dan Maha Mengetahui."
    }],
    "categoryKey": ["sa'i"],
    "audio": "doa_naik_bukit_safa_marwah.mp3"
  },
  {
    "id": 57,
    "titleEn": "6th Sa'i Supplication (Marwah → Safa)",
    "titleMy": "Doa Sa'i Keenam (Marwah → Safa)",
    "doa": [{
      "id": 1,
      "arabic": "اَللهُ أَكْبَرُ، اَللهُ أَكْبَرُ، اَلله أَكْبَرُ، وَلِلَّهِ الْحَمْدُ، لَا إِلٰهَ إِلَّا اللَّهُ وَحْدَهُ، صَدَقَ وَعْدَهُ\nوَنَصَرَ عَبْدَهُ، وَهَزَمَ الْأَحْزَابَ وَحْدَهُ، لَا إِلٰهَ إِلَّا اللَّهُ، وَلَا نَعْبُدُ إِلَّا إِيَّاهُ مُخْلِصِينَ لَهُ الدِّيْنَ\nوَلَوْ كَرِهَ الْكَافِرُوْنَ، اَللّٰهُمَّ إِنِّي أَسْأَلُكَ الْهُدَى وَالتُّقَى وَالْعَفَافَ وَالْغِنَى،اَللّٰهُمَّ إِنِّي أَسْأَلُكَ \nرِضَاكَ وَالجَنَّةَ، وَأَعُوْذُ بِكَ مِنْ سَخَطِكَ وَالنَّارِ،وَمَا يُقَرِّبُنِي إِلَيْهَا مِنْ قَوْلٍ أَوْ فِعْلٍ أَوْ عَمَلٍ\nاَللّٰهُمَّ بِنُورِكَ اهْتَدَيْنَا وَبِفَضْلِكَ اسْتَغنَيْنَا وَفِي كَنَفِكَ وَإِنْعَامِكَ وَعَطَائِكَ وَإِحْسَانِكَ\nأَصْبَحْنَا وَأَمْسَيْنَا أَنتَ الْأَوّلُ فَلَا قَبْلَكَ شَيْءٌ، وَالْآخِرُ فَلَا بَعْدَكَ شَيْءٌ\nوَالظَّاهِرُ فَلَا شَيْءَ فَوْقَكَ، وَالْبَاطِنُ فَلَا شَيْءَ دُوْنَكَ\nنَعُوْذُبِكَ مِنَ الْعَجْزِ وَالْكَسَلِ وَعَذَابِ الْقَبْرِ وَفِتنَةِ الْغِنَى وَنَسْأَلُكَ الْفَوْزَ بِالْجَنَّةِ",
      "translationEn": "Allah Maha Besar, Allah Maha Besar, Allah Maha Besar. Dan segala puji bagi Allah. Tiada Tuhan kecuali Allah Yang Maha Esa. JanjiNya benar, Dia menolong hambaNya, Dia menghancurkan musuh-musuhNya. Tiada Tuhan selain Allah, dan kami tidak menyembah selainNya dengan penuh ikhlas. Dialah yang empunya agama ini walaupun orang-orang kafir tidak merasa senang. Ya Allah, aku bermohon hidayah, takwa, kesucian budi dan kekayaan. Ya Allah, aku mohon keredhaanMu dan syurga, dan aku mohon dilindungi dari kemurkaanMu dan neraka, dan segala yang mendekatkan aku kepadanya, baik berupa kata, perbuatan atau pekerjaan. Ya Allah, dengan cahayaMu kami mendapat hidayah. Kami kaya dengan kurniaanMu berserta pertolongan, nikmat ,anugerah dan ihsanMu pagi dan petang. Engkaulah yang awal,tidak ada sesuatupun yang ada sebelumMu dan Engkau pula paling akhir dan tidak ada sesuatupun yang ada di belakang (sesudah)Mu. Engkau pula yang zahir maka tidak ada sesuatupun yang melebihi Engkau, Engkau pula yang batin tidak ada sesuatupun yang menyamaiMu. Kami mohon perlindunganMu dari kemiskinan, kemalasan dan azab kubur, serta ujian kekayaan. Kami mohon kepadaMu kemenangan mencapai syurga.",
      "translationMy": "Allah is the Greatest, Allah is the Greatest, Allah is the Greatest. And all praise is for Allah. There is no God except Allah the One. His promise is true, He helps His servant, He destroys His enemies. There is no God besides Allah, and we do not worship anyone but Him sincerely. He is the owner of this religion even though the disbelievers do not feel comfortable. O Allah, I ask for guidance, piety, purity of heart, and wealth.O Allah, I seek Your pleasure and paradise, and I seek protection from Your wrath and hell, and everything that brings me closer to it, whether in words, deeds, or actions. O Allah, with Your light we receive guidance. We are rich with Your blessings along with help, grace, bounties, and favors both morning and evening. You are the First, nothing existed before You, and You are the Last, nothing exists after You. You are also the Outwardly Manifest, so there is nothing greater than You, You are the one whose essence is unmatched. We seek Your protection from poverty, laziness, and the torment of the grave, as well as the trials of wealth. We ask You for the victory to attain paradise."
    }],
    "categoryKey": ["sa'i"],
    "audio": "doa_sai_keenam.mp3"
  },
  {
    "id": 58,
    "titleEn": "Dua while brisk walking between the green lights",
    "titleMy": "Doa ketika berlari anak diantara tiang hijau",
    "doa": [{
      "id": 1,
      "arabic": "رَبِّ اغْفِرْ وَارْحَمْ وَاعْفُ وَتَكَرَّمْ، وَتَجَاوَزْ عَمَّا تَعْلَمُ إِنَّكَ تَعْلَمُ مَا لَا نَعْلَمُ إِنَّكَ أَنْتَ اللهُ الْأَعَزُّ الْأَكْرَمُ",
      "translationEn": "O Allah, forgive, love, and pardon us, and erase what You know about our sins; indeed, You are All-Knowing of what we do not know. Indeed, You are Allah, the Most Glorious and Most Gracious.",
      "translationMy": "Ya Allah, ampunilah, sayangilah dan maafkanlah serta hapuskanlah apa-apa yang Engkau ketahui tentang dosa kami sesungguhnya Engkau Maha Mengetahui apa yang tidak kami ketahui. Sesungguhnya Engkau adalah Allah yang Maha Mulia dan Maha Pemurah."
    }],
    "categoryKey": ["sa'i"],
    "audio": "doa_antara_tiang_hijau.mp3"
  },
  {
    "id": 59,
    "titleEn": "Doa when approaching Safa or Marwah hill",
    "titleMy": "Doa setiap kali menaiki bukit Safa atau Marwah",
    "doa": [{
      "id": 1,
      "arabic": "إِنَّ الصَّفَا وَالْمَرْوَةَ مِنْ شَعَائِرِ اللهِ فَمَنْ حَجَّ البَيتَ اَواعْتَمَرَ فَلَا جُنَاحَ عَلَيْهِ أَنْ يَطَّوَّفَ بِهِمَا، وَمَنْ تَطَوَّعَ خَيْرًا فَإِنَّ اللَّهَ شَاكِرٌ عَلَيْمٌ",
      "translationEn": "Indeed, Safa and Marwah are among the signs of Allah's greatness. Whoever performs the pilgrimage (hajj) and umrah to the House of Allah, there is no sin for him to walk between the two, and whoever does good willingly, indeed Allah is Most Accepting and Most Knowing.",
      "translationMy": "Sesungguhnya Safa dan Marwah itu adalah sebagai tanda-tanda kebesaran Allah. Barangsiapa yang menunaikan ibadat haji dan umrah ke Baitullah, maka tiada salahnya untuk berjalan di antara keduanya, dan barang siapa yang berbuat baik dengan suka rela, maka sesungguhnya Allah Maha Menerima dan Maha Mengetahui."
    }],
    "categoryKey": ["sa'i"],
    "audio": "doa_naik_bukit_safa_marwah.mp3"
  },
  {
    "id": 60,
    "titleEn": "7th Sa'i Supplication Doa (Safa → Marwah)",
    "titleMy": "Sa'i Ketujuh (Safa → Marwah)",
    "doa": [{
      "id": 1,
      "arabic": "اَللهُ أَكْبَرُ، اَللهُ أَكْبَرُ، اَللَّهُ أَكْبَرُ، وَلِلَّهِ الْحَمْدُ سُبْحَانَكَ مَا شَكَرْنَاكَ\nحَقَّ شُكْرِكَ يَا اَللَّهُ، سُبْحَانَكَ مَا أَعْلَى شَأْنَكَ يَا اَللَّهُ، اَللّٰهُمَّ حَبِّبْ\nإِلَيْنَا الْإِيْمَانَ وَزَيِّنْهُ فِي قُلُوْبِنَا، وَكَرِّه إلَيْنَا الْكُفْرَ وَالْفُسُوْقَ وَالْعِصْيَانَ\nوَاجْعَلْنَا مِنَ الرَّاشِدِيْنَ",
      "translationEn": "Allah is the Greatest, Allah is the Greatest, Allah is the Greatest. All praise is due to Allah. Glory be to You, O Allah, indeed we cannot thank You as You deserve, O Allah. Glory be to You, O Allah, there is no comparison at all to Your glory, O Allah, make us love faith and adorn it in our hearts. Make us hate disbelief, wickedness, and disobedience, and make us among those who are guided.",
      "translationMy": "Allah Maha Besar, Allah Maha Besar, Allah Maha Besar. Segala puji bagi Allah. Maha Suci Engkau Ya Allah, sesungguhnya kami tidak dapat bersyukur kepada Engkau sebagaimana yang sepatutnya, Ya Allah. Maha Suci Engkau Ya Allah, tidak ada tolok banding sama sekali kemuliaanMu Ya Allah. Ya Allah, cintakanlah kami kepada keimanan dan hiaskanlah ia di dalam hati kami. Bencikanlah kami kepada kekafiran, kefasikan dan kederhakaan dan jadikanlah kami di antara orang-orang yang mendapat petunjuk."
    }],
    "categoryKey": ["sa'i"],
    "audio": "doa_sai_ketujuh.mp3"
  },
  {
    "id": 61,
    "titleEn": "Dua while brisk walking between the green lights",
    "titleMy": "Doa ketika berlari anak diantara tiang hijau",
    "doa": [{
      "id": 1,
      "arabic": "رَبِّ اغْفِرْ وَارْحَمْ وَاعْفُ وَتَكَرَّمْ، وَتَجَاوَزْ عَمَّا تَعْلَمُ إِنَّكَ تَعْلَمُ مَا لَا نَعْلَمُ إِنَّكَ أَنْتَ اللهُ الْأَعَزُّ الْأَكْرَمُ",
      "translationEn": "O Allah, forgive, love, and pardon us, and erase what You know about our sins; indeed, You are All-Knowing of what we do not know. Indeed, You are Allah, the Most Glorious and Most Gracious.",
      "translationMy": "Ya Allah, ampunilah, sayangilah dan maafkanlah serta hapuskanlah apa-apa yang Engkau ketahui tentang dosa kami sesungguhnya Engkau Maha Mengetahui apa yang tidak kami ketahui. Sesungguhnya Engkau adalah Allah yang Maha Mulia dan Maha Pemurah."
    }],
    "categoryKey": ["sa'i"],
    "audio": "doa_antara_tiang_hijau.mp3"
  },
  {
    "id": 62,
    "titleEn": "After passing the green lights, recite the following du'a",
    "titleMy": "Setelah melintasi tiang hijau, baca do'a berikut",
    "doa": [{
      "id": 1,
      "arabic": "اَللّٰهُمَّ قِنِي عَذَابَكَ يَوْمَ تَبْعَثُ عِبَادَكَ، اَللّٰهُمَّ اهْدِنِي بِالْهُدَى وَنَقِّنِي بِالتَّقْوَى وَاغْفِرْ لِي فِي الْآخِرَةِ وَالأُوْلَى، اَللّٰهُمَّ ابْسُطْ عَلَيْنَا مِنْ بَرَكَاتِكَ وَرَحْمَتِكَ وَفَضْلِكَ وَرِزْقِكَ\nاَللّٰهُمَّ إِنِّي أَسْأَلُكَ النَّعِيمَ الْمُقِيمَ الَّذِي لَا يَحُولُ وَلَا يَزُولُ أَبَدًا\nاَللّٰهُمَّ اجْعَلْ فِي قَلْبِي نُورًا ، وَفِي سَمْعِي نُوْرًا، وَفِي بَصَرِي نُوْرًا، وَفِي لِسَانِي نُوْرًا\nوَعَنْ يَمِينِي نُوْرًا، وَعَنْ شِمَالِي نُورًا وَمِنْ فَوْقِيَ نُوْرًا وَعَنْ يَمِينِي نُوْرًا، وَعَنْ شِمَالِي نُورًا وَمِنْ فَوْقِيَ نُوْرًا، وَاجْعَلْ فِي نَفْسِي نُورًا وَعَظِّمْ لِي نُورًا \nرَبِّ اشْرَحْ لِي صَدْرِي وَيَسِّرْ لِي أَمْرِي",
      "translationEn": "O Allah, save me from Your punishment, on the day You resurrect Your servants. O Allah, guide me with Your guidance, purify me with righteousness, and forgive me in this world and in the hereafter. O Allah, bestow upon me Your blessings, mercy, grace and sustenance. O Allah, I ask for everlasting blessings that do not change and do not disappear. O Allah, make light in my heart, my hearing, my sight, my tongue, on my right and on my left, above me and within my soul. Expand my chest and ease my affairs.",
      "translationMy": "Ya Allah, selamatkanlah aku dari azabMu, dihari Engkau membangkitkan hamba-hambaMu. Ya Allah, pimpinlah aku dengan hidayat, dan sucikanlah aku dengan takwa, dan ampunilah aku di dunia dan di akhirat. Ya Allah, Iimpahkanlah atas aku berkatMu, rahmatMu, kurniaMu dan rezekiMu.Ya Allah, aku bermohon nikmat yang berkekalan, tidak berpindah dan tidak hilang. Ya Allah, jadikanlah cahaya di dalam hatiku, pendengaranku, penglihatanku, lidahku, di kanan dan di kiriku, di atasku dan di dalam jiwaku. Lapangkanlah dadaku dan mudahkanlah urusanku"
    }],
    "categoryKey": ["sa'i"],
    "audio": "doa_setelah_melintas_tiang_hijau"
  },
  {
    "id": 63,
    "titleEn": "Doa when approaching Safa or Marwah hill",
    "titleMy": "Doa setiap kali menaiki bukit Safa atau Marwah",
    "doa": [{
      "id": 1,
      "arabic": "إِنَّ الصَّفَا وَالْمَرْوَةَ مِنْ شَعَائِرِ اللهِ فَمَنْ حَجَّ البَيتَ اَواعْتَمَرَ فَلَا جُنَاحَ عَلَيْهِ أَنْ يَطَّوَّفَ بِهِمَا، وَمَنْ تَطَوَّعَ خَيْرًا فَإِنَّ اللَّهَ شَاكِرٌ عَلَيْمٌ",
      "translationEn": "Indeed, Safa and Marwah are among the signs of Allah's greatness. Whoever performs the pilgrimage (hajj) and umrah to the House of Allah, there is no sin for him to walk between the two, and whoever does good willingly, indeed Allah is Most Accepting and Most Knowing.",
      "translationMy": "Sesungguhnya Safa dan Marwah itu adalah sebagai tanda-tanda kebesaran Allah. Barangsiapa yang menunaikan ibadat haji dan umrah ke Baitullah, maka tiada salahnya untuk berjalan di antara keduanya, dan barang siapa yang berbuat baik dengan suka rela, maka sesungguhnya Allah Maha Menerima dan Maha Mengetahui."
    }],
    "categoryKey": ["sa'i"],
    "audio": "doa_naik_bukit_safa_marwah.mp3"
  },
  {
    "id": 64,
    "titleEn": "Supplication after completing Sa'i at Marwah",
    "titleMy": "Doa setelah selesai Sa'i di atas bukit Marwah",
    "doa": [{
      "id": 1,
      "arabic": "رَبَّنَا تَقَبَّلْ مِنَّا وَعَافِنَا وَاعْفُ عَنَّا، وَعَلَى طَاعَتِكَ وَشُكْرِكَ أَعِنَّا، وَعَلَى غَيْرِكَ\nلَا تَكِلْنَا وَعَلَى الْإِيْمَانِ وَالْإِسْلَامِ الْكَامِلِ جَمْعًا تَوَفَّنَا وَأَنْتَ رَاضٍ عَنَّا\nاَللّٰهُمَّ ارْحَمْنِيْ بِتَرْكِ الْمَعَاصِي مَا أَبْقَيْتَنِي، وَارْحَمْنِي أَنْ أَتَكَلَّفَ مَا لَا يَعْنِينِي\nوَارْزُقْنِي حُسْنَ النَّظَرِ فِيْمَا يُرْضِيْكَ عَنِّي، يَا أَرْحَمَ الرَّاحِمِيْنَ",
      "translationEn": "O God, we ask that our prayers be accepted. Grant us good health and forgive us. Give us assistance to be obedient and grateful to You. Do not let us depend on anyone else but You. Let us die in perfect faith and Islam, while You are pleased with us. O Allah, O Lord, protect me from all evil throughout my life, and keep me from doing things that are of no benefit, and bestow upon me a good perspective on things that lead to Your pleasure, O Lord who is Most Compassionate.",
      "translationMy": "Ya Tuhan, kami memohon diterima doa kami. Afiatkanlah dan ampunilah kami. Berilah pertolongan kepada kami untuk taat dan bersyukur kepada Engkau. Janganlah membiarkan kami bergantung kepada yang lain, selain dari Engkau. Matikanlah kami di dalam iman dan islam yang sempurna, sedang Engkau reda kepada kami. Ya Allah, Ya Tuhan, peliharalah diriku dengan meninggalkan segala kejahatan selama hidupku, dan peliharalah aku supaya tidak membuat perkara yang tidak memberi guna, dan kurniakanlah kepadaku elok pandangan pada perkara-perkara yang membawa keredaan Engkau wahai Tuhan yang bersifat Amat Belas Kasihan."
    }],
    "categoryKey": ["sa'i"],
    "audio": "doa_selesai_sai.mp3"
  },
  {
    "id": 65,
    "titleEn": "Dua While Shaving/Shortening",
    "titleMy": "Doa Ketika Bercukur/Bergunting",
    "doa": [{
      "id": 1,
      "arabic": "اَللهُ أَكْبَرُ، اَللَّهُ أَكْبَرُ، اَللهُ أَكْبَرُ، اَللّٰهُمَّ هَذِهِ نَاصِيَتِي بِيَدِكَ. فَاجْعَلْ لِي بِكُلِّ شَعْرَةٍ نُوْرًا يَوْمَ الْقِيَامَةِ، وَاغْفِرْلِي ذَنْبِي يَا وَاسِعَ الْمَغْفِرَةِ. آمِين",
      "translationEn": "Allah is the Greatest, Allah is the Greatest, Allah is the Greatest. O Allah, this crown of my head is in Your power, so make every strand of hair a light on the Day of Judgment. And forgive my sins, O Lord Who is Most Forgiving.",
      "translationMy": "Allah Maha Besar, Allah Maha besar, Allah Maha Besar. Ya Allah, ubun-ubun kepalaku ini di dalam kekuasaanMu, maka jadikanlah setiap helai rambut suatu cahaya di hari kiamat. Dan ampunkanlah dosaku Ya Tuhan Yang Maha Luas PengampunanNya."
    }],
    "categoryKey": ["tahalul"],
    "audio": "doa_ketika_bercukur.mp3"
  },
  {
    "id": 66,
    "titleEn": "Dua After Shaving/Shortening",
    "titleMy": "Doa Setelah Bercukur/Bergunting",
    "doa": [{
      "id": 1,
      "arabic": "اَلحَمْدُ لِلَّهِ الَّذِي قَضَى عَنِّيْ نُسُكِي، اَللّٰهُمَّ آتِنِي بِكُلِّ شَعْرَةٍ حَسَنَةً \nوَامْحُ عَنِّي بِهَا سَيِّئَةً، وَارْفَعْ لِي بِهَا دَرَجَةً، وَاغْفِرْ لِي وَلِلْمُحَلِّقِيْنَ وَالْمُقَصِّرِينَ \nوَجَمِيعِ الْمُسْلِمِيْنَ، اَللّٰهُمَّ زِدْنَا إِيْمَانًا وَيَقِيْنًا وَتَوْفِيقًا وَعَوْنًا وَاغْفِرْلَنَا\nوَلِآبَائِنَا وَأُمَّهَاتِنَا وَصَلَّى اللهُ عَلَى سَيِّدِنَا مُحَمَّدٍ وَعَلَى آلِهِ وَصَحْبِهِ وَسَلَّمَ",
      "translationEn": "All praise is due to Allah, who has aided me in fulfilling this worship (Hajj or Umrah). O Allah, grant me a blessing for every strand of hair, and erase an evil with it. And elevate me with it to a rank. Forgive me and all those who shave and cut their hair, and all Muslims. O Allah, increase us in faith, certainty, guidance, and assistance. And forgive us and our parents, May Allah's blessings be upon our leader Prophet Muhammad (PBUH) along with his family and companions.",
      "translationMy": "Segala puji bagi Allah, yang telah menolongku menunaikan ibadatku ini (haji atau umrah). Ya Allah berilah aku satu kebaikan dengan setiap helai rambut ini, dan padamkanlah dengannya satu kejahatan. Dan angkatkan aku dengannya satu darjat. Ampunkanlah aku dan sekelian yang bercukur dan yang bergunting dan sekelian  muslimin. Ya Allah, tambahkanlah kami dengan keimanan, keyakinan, taufik dan pertolongan. Dan ampunilah kami serta ibu bapa kami, selawat Allah ke atas penghulu kami Nabi Muhammad SAW berserta keluarga dan sahabatnya."
    }],
    "categoryKey": ["tahalul"],
    "audio": "doa_setelah_bercukur.mp3"
  },
  {
    "id": 17,
    "titleEn": "Farewell Tawaf",
    "titleMy": "Tawaf Wada'",
    "doa": [{
      "id": 1,
      "arabic": "نَوَيْتُ أَن أَطُوفَ طَوَافَ الوَدَاعِ سَبعَةَ أَشوَاطٍ لِلّٰهِ تَعَالَى",
      "translationEn": "I intended to perform farewell tawaf, seven rounds for the sake of Allah Most High",
      "translationMy": "Sahaja aku berniat mengerjakan tawaf wada' tujuh pusingan kerana Allah Ta’ala"
    }],
    "categoryKey": ["tawaf-wada"],
    "audio": "niat_tawaf_wada.mp3"
  },
  {
    "id": 67,
    "titleEn": "Dua During Farewell Tawaf At All Rounds",
    "titleMy": "Doa Tawaf Wada’ Di Semua Pusingan",
    "doa": [{
      "id": 1,
      "arabic": "بِسْمِ اللَّهِ، اَللَّهُ أَكْبَرُ، سُبْحَانَ اللَّهِ وَالْحَمْدُ لِلَّهِ وَلَا إِلٰهَ إِلَّا اللَّهُ، وَاللَّهُ أَكْبَرُ\n وَلَا حَوْلَ وَلَا قُوَّةَ إِلَّا بِاللَّهِ العَلِيِّ الْعَظِيمِ، وَالصَّلَاةُ وَالسَّلَامُ عَلَى رَسُولِ اللَّهِ\nصَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ، اَللَّهُمَّ إِيمَانًا بِكَ وَتَصْدِيْقًا بِكِتَابِكَ، وَوَفَاءً بِعَهْدِكَ\nوَاتِّبَاعًا لِسُنَّةِ نَبِيِّكَ مُحَمَّدٍ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ، إِنَّ الَّذِي فَرَضَ عَلَيْكَ القُرْآنَ\nلَرَآدُّكَ إِلَى مَعَادٍ، يَا مُعِيدُ أَعِدنِي، وَيَا سَمِيعُ اِسْمَعنِي، يَا جَبَّارُ اجْبُرْنِي",
      "translationEn": "In the name of Allah, Allah is the Greatest. Allah is Pure, and all praise is due to Allah. There is no deity except Allah, and Allah is the Greatest. There is no power and no strength except by the permission of Allah, the Most High and Most Great. Blessings and peace be upon the Messenger of Allah, peace be upon him. O Allah, I come here because I believe in You and trust in Your book, fulfilling Your covenant and following the Sunnah of Your Prophet, Muhammad, peace be upon him. Indeed, the Lord who revealed the Quran to you will return me to Your presence. O Lord, the Most Returning, return me. O Lord, the All-Hearing, hear me. O Lord, the Almighty, strengthen me. O Lord, the Concealer, cover my faults. O Lord, the Most Compassionate, have mercy on me. O Lord, the Most Returning, return me to this Kaabah of Yours and grant me the opportunity to return repeatedly, repent, worship, and journey in a state of praising You. Allah fulfills promises and helps His servants.' and destroy the enemy, alone. O God, keep me from the right, and from the left, and from the front, and from the back, and from above, and from below, that You may deliver me to my family and my country. O Allah, make this journey easy for us, and fold for us this earth. O Allah, join us on our journey, and nourish our families, O Most Merciful God, O God of the Universe.",
      "translationMy": "Dengan nama Allah, Allah Maha Besar. Allah Maha Suci, dan segala puji bagi Allah. Tiada Tuhan kecuali Allah dan Allah Maha Besar. Tiada upaya dan tiada kekuatan kecuali dengan izin Allah Yang Maha Tinggi dan Maha Agong. Selawat dan salam bagi Rasulullah s.a.w. Ya Allah, aku datang ke sini kerana beriman kepadaMu dan mempercayai kitabMu, memenuhi janjimu dan kerana mengikut sunnah NabiMu, Muhammad s.a.w. Sesungguhnya Tuhan yang menurunkan kepadamu Al-Quran akan mengembalikan ke tempatmu. Ya Tuhan Yang Maha Mengembalikan, kembalikanlah aku. Ya Tuhan Yang Maha Mendengar, dengarkanlah aku. Ya Tuhan Yang Maha Perkasa, kuatkanlah aku. Wahai Tuhan Yang Maha Menutup, tutuplah aibku. Wahai Tuhan Yang Maha Pengasih, kasihilah aku. Wahai Tuhan Yang Maha Mengembalikan, kembalikanlah aku ke KaabahMu ini dan anugerahilah aku kesempatan untuk kembali, dan Kembali berulang-ulang kembali, bertaubat, beribadat, mengembara dalam keadaan memujiMu. Allah Maha Menepati janji dan membantu hambaNya, dan menghancurkan musuh, sendiri sahaja. Ya Allah, peliharalah aku dari kanan, dan kiri, dan dari hadapan, dan dari belakang, dan dari atas, dan dari bawah, sehingga Engkau sampaikan aku kepada keluargaku dan negeriku. Ya Allah, ringankanlah bagi kami perjalanan ini, dan lipatkanlah bagi kami bumi ini. Ya Allah, sertailah kami dalam perjalanan kami, dan peliharalah keluarga kami, wahai Tuhan Yang Maha Penyayang, Ya Tuhan Pemelihara alam semesta."
    }],
    "categoryKey": ["tawaf-wada"],
    "audio": ""
  },
  {
    "id": 68,
    "titleEn": "Sunnah Prayer Intention  After Tawaf",
    "titleMy": "Niat Solat Sunnah Tawaf",
    "doa": [{
      "id": 1,
      "arabic": "اُصَلِّي سُنَّةَ الطَّوَافِ رَكْعَتَيْنِ لِلّٰهِ تَعَالٰى",
      "translationEn": "I intended to pray two raka’at of sunnah Tawaf for the sake of Allah Most High",
      "translationMy": "Sahaja aku solat Tawaf dua rakaat kerana Allah Taala"
    }],
    "categoryKey": ["tawaf-wada"],
    "audio": ""
  },
  {
    "id": 69,
    "titleEn": "Dua After Tawaf Wada' Prayer",
    "titleMy": "Doa Setelah Solat Sunat Tawaf Wada'",
    "doa": [{
      "id": 1,
      "arabic": "اَللَّهُمَّ إِنَّ البَيْتَ بَيْتُكَ وَالْعَبْدَ عَبْدُكَ وَابْنُ عَبْدِكَ وَابْنُ أَمَتِكَ\nحَمَلْتَنِي عَلَى مَا سَخَّرْتَنِيْ لِيْ مِنْ خَلْقِكَ حَتَّى سَيَّرْتَنِيْ فِيْ بِلَادِكَ\nوَبَلَغْتَنِيْ بِنِعْمَتِكَ حَتَّى أَعَنْتَنِيْ عَلَى قَضَاءِ مَنَاسِكِكَ\nفَإِنْ كُنْتَ رَضِيْتَ عَنِّيْ فَازْدَدْ عَنِّيْ رِضَا\nوَإِلَّا فَمُنَّ الْآنَ قَبْلَ تَبَاعُدِيْ عَنْ بَيْتِكَ هٰذَا أَوَانُ انْصِرَافِيْ\nإِنْ أَذِنْتَ لِيْ غَيْرَ مُسْتَبْدِلٍ بِكَ وَلَا بِبَيْتِكَ وَلَا رَاغِبٍ عَنْكَ\nوَلَا عَنْ بَيْتِكَ، اَللّٰهُمَّ أَصْحِبْنِيَ الْعَافِيَةَ فِي بَدَنِيْ وَالْعِصْمَةَ فِيْ دِيْنِيْ\nوَأَحْسِنْ مُنْقَلَبِيْ وَارْزُقْنِيْ طَاعَتَكَ مَا أَبْقَيْتَنِيْ\nوَاجْمَعْ لِيْ خَيْرَيِ الدُّنْيَا وَالْآخِرَةِ، إِنَّكَ عَلَى كُلِّ شَيْءٍ قَدِيرٌ\nاَللّٰهُمَّ لَا تَجْعَلْ هَذَا آخِرَ الْعَهْدِ بِبَيْتِكَ الْحَرَامِ\nوَإِنْ جَعَلْتَهُ آخِرَ عَهْدِيْ فَعَوِّضْنِيْ عَنْهُ الْجَنَّةَ\nبِرَحْمَتِكَ يَا أَرْحَمَ الرَّاحِمِينَ، آمِيْنَ يَا رَبِّ الْعَالَمِيْنَ",
      "translationEn": "O Allah, this house is Your house, and I am Your servant, my male and female children are Your servants, You brought me by the means of transportation that You made easy for me, until You brought me to this land of Yours, and You granted me Your blessings, so that You aid me in performing Hajj (Umrah). If You are pleased with me, grant me Your pleasure. If not, then from now, accept me before I am far from Your house, Now it is my time to return, if You allow me, without changing anything for You and not with Your house, and without displeasing Your house. O Allah, accompany my body with health, protect my faith, and make my return good. Grant me obedience to You forever. As long as You allow me to live, gather for me goodness in this world and the Hereafter. O Allah, truly You are All-Powerful over all things. O Allah, do not let this be the last chance for me to do good in this world and the hereafter. O Allah, indeed You are All-Powerful over everything. O Allah, do not let this be the end for me in Your noble house. If You make this my final opportunity, then replace it with Your paradise and mercy, O Most Compassionate and Most Merciful. Grant it, O Lord, the call of all creation.",
      "translationMy": "Ya Allah, rumah ini rumahMu, dan hamba Adalah hambaMu, anak hambaMu yang lelaki dan hambaMu yang perempuan, Engkau bawa aku dengan kenderaan yang Engkau mudahkan bagiku, sehingga Engkau jalankan aku di negeriMu ini, dan Engkau sampaikan aku dengan nikmatMu, sehingga Engkau tolong aku untuk melaksanakan ibadah Haji (Umrah). Jika Engkau Redha kepadaku, maka tambahilah bagiku redhaMu. Jika tidak, maka sejak dari sekarang, redakanlah aku sebelum aku jauh dari rumahMu, Sekarang waktuku untuk pulang jika Engkau izinkan bagiku, tanpa menukar sesuatu untuk Engkau dan juga tidak dengan rumahMu, serta tidak benci kepada rumahMu. Ya Allah, dampingilah tubuhku dengan kesihatan, dan bentengi agamaku, dan baikkan kepulanganku. Kurniailah aku ketaatan kepadaMu selama-lamanya. Selama Engkau biarkan aku hidup, maka kumpulkanlah bagiku kebaikan di dunia dan di akhirat. Ya Allah, sesungguhnya Engkau Maha Kuasa atas segala-galanya. Ya Allah, janganlah jadikan ini akhir kesempatan bagiku kebaikan di dunia dan di akhirat. Ya Allah, sesungguhnya Engkau Maha Kuasa atas segala-galanya. Ya Allah, janganlah jadikan ini akhir bagiku di rumahMu yang mulia ini. Bila Engkau jadikan kesempatan yang terakhir bagiku, maka gantilah ia dengan syurga dan rahmatMu, wahai Yang Maha Pengasih dan Penyayang. Perkenankanlah ya Tuhan seru sekelian alam."
    }],
    "categoryKey": ["tawaf-wada"],
    "audio": ""
  },
  {
    "id": 70,
    "titleEn": "Dua When Entering Madinah",
    "titleMy": "Doa Apabila Tiba Di Madinah",
    "doa": [{
      "id": 1,
      "arabic": "اَللّٰهُمَّ إِنَّ هٰذَا حَرَمُ نَبِيِّكَ، وَقَدْ حَرَّمْتَهُ عَلَى لِسَانِهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ\nفَاجْعَلْهُ وِقَايَةً لِيْ مِنَ النَّارِ، وَأَمَانًا مِنْ سُوْءِ الْحِسَابِ",
      "translationEn": "O my Lord, indeed this sacred land is the place of Your Prophet Muhammad (peace be upon him), and You have made it a Sacred Land through the verbal statements of Your Prophet (peace be upon him). Therefore, I ask by its honor, make it a shield for me from the fire of Hell and grant me safety from undesirable reckoning on the Day of Judgment.",
      "translationMy": "Ya Tuhanku, sesungguhnya tanah haram ini tempat Nabi Engkau Muhammad SAW, dan Engkau telah menjadikan ia Tanah Haram menerusi kenyataan lisan Nabi Engkau s.a.w. maka aku mohonkan dengan kemuliaannya, jadikanlah ia sebagai perisai bagi diriku daripada api neraka dan keamanan daripada perhitungan yang tidak baik pada hari kiamat"
    }],
    "categoryKey": ["madinah"],
    "audio": ""
  },
  {
    "id": 71,
    "titleEn": "Dua When Entering Nabawi Mosque",
    "titleMy": "Doa Ketika Masuk Masjid Nabawi",
    "doa": [{
      "id": 1,
      "arabic": "بِسْمِ اللَّهِ وَعَلَى مِلَّةِ رَسُوْلِ الله رَبِّ أَدْخِلْنِي مُدْخَلَ صِدْقٍ\nوَأَخْرِجْنِي مُخْرَجَ صِدْقٍ، وَاجْعَلْ لِي مِنْ لَدُنْكَ سُلْطَانًا نَصِيرًا\nاَللّٰهُمَّ صَلِّ وَسَلَّمْ عَلَى سَيِّدِنَا مُحَمَّدٍ وَعَلَى آلِ سَيِّدِنَا مُحَمَّدٍ\nوَاغْفِرْ لِي ذُنُوبِي، وَافْتَحْ لِي أَبْوَابَ رَحْمَتِكَ وَأَدْخِلْنِي فِيْهَا، يَا أَرْحَمَ الرَّاحِمِينَ",
      "translationEn": "In the name of Allah, and upon the religion of the Messenger of Allah. O my Lord, admit me to the gate of truth, and lead me out through the gate of truth. O my Lord, grant me from Your presence the evidence and power that will assist me. O Allah, O my Lord, send blessings and mercy upon our master Prophet Muhammad (peace be upon him) and his family. Forgive my sins, open the doors of Your mercy, and admit me into them, O Most Merciful Lord.",
      "translationMy": "Dengan nama Allah, dan di atas agama Rasulullah. Ya Tuhanku, masukkanlah aku ke dalam pintu kebenaran, dan keluarkanlah aku ke pintu kebenaran. Ya Tuhanku. Berikanlah kepadaku dari sisimu hujah keterangan serta kekuasaan yang menolongku. Ya Allah, Ya Tuhanku selawat dan rahmat ke atas junjungan kami Nabi Muhammad s.a.w. dan keluarganya. Ampunilah dosa-dosaku dan bukakanlah pintu-pintu rahmatMu, dan masukkan daku kedalamnya wahai Tuhan yang amat mengasihani."
    }],
    "categoryKey": ["madinah"],
    "audio": ""
  },
  {
    "id": 72,
    "titleEn": "Dua While In Noble Raudhah",
    "titleMy": "Doa Ketika Di Raudhah",
    "doa": [{
      "id": 1,
      "arabic": "اَللّٰهُمَّ إِنَّ هَذِهِ رَوْضَةٌ مِنْ رِيَاضِ الْجَنَّةِ شَرَّفْتَهَا وَكَرَّمْتَهَا وَنَوَّرْتَهَا\nبِنُوْرِ نَبِيِّكَ وَحَبِيْبِكَ مُحَمَّدٍ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ\nفَاحْشُرْنِي فِي زُمْرَتِهِ وَأَمِتْنِي عَلَى مَحَبَّتِهِ وَسُنَّتِهِ، وَاسْقِنِي مِنْ حَوْضِهِ\nوَبِيَدِهِ الشَّرِيفَةِ شَرْبَةً هَنِيئَةً لَا أَظْمَأُ بَعْدَهَا أَبَدًا، إِنَّكَ عَلَى كُلِّ شَيْءٍ قَدِيرٌ\nوَصَلَّى اللَّهُ عَلَى سَيِّدِنَا مُحَمَّدٍ وَعَلَى آلِهِ وَصَحْبِهِ وَسَلَّمَ وَالْحَمْدُ للهِ رَبِّ الْعَالَمِينَ",
      "translationEn": "O Allah, verily this is one of the gardens of Paradise that You have honored and illuminated with the light of Your Prophet and beloved, Muhammad (peace be upon him). So gather me among its companions, and cause me to die in his love, in following him, and adhering to his Sunnah. And let me drink from its spring and from his noble hands with a satisfying drink, after which I will never thirst again. Indeed, You have power over all things. Peace and blessings of Allah be upon our leader, Prophet Muhammad, along with his family and companions. And all praise is due to Allah, the Lord of all worlds.",
      "translationMy": "Ya Allah, sesungguhnya inilah satu dari taman-taman syurga yang telah Engkau muliakan dan Engkau terangi dengan cahaya NabiMu dan kekasihMu Muhammad s.a.w. Maka himpunkanlah aku di dalam kumpulannya, dan matikanlah aku atas kecintaannya, kepadanya dan atas sunahnya. Dan berikanlah aku minum dari telaganya dan dari tangannya yang mulia dengan minuman yang memuaskan, yang tidak akan haus lagi selepasnya. Sesungguhnya Engkau Amat Berkuasa atas segala sesuatu. Selawat Allah ke atas penghulu kami Nabi Muhammad beserta keluarga dan sahabatnya. Dan Segala puji bagi Allah semesta alam"
    }],
    "categoryKey": ["madinah"],
    "audio": ""
  },
  {
    "id": 73,
    "titleEn": "Greeting Our Beloved Prophet PBUH",
    "titleMy": "Memberi Salam Kepada Baginda SAW",
    "doa": [{
      "id": 1,
      "arabic": "وَالرَّءُوْفُ الرَّحِيمُ\nوَرَحْمَتُ اللَّهِ وَبَرَكَاتُهُ، اَلسَّلَامُ عَلَيْكَ يَا نَبِيَّ اللَّهِ\nاَلسَّلَامُ عَلَيْكَ يَا صَفْوَةَ خَلْقِ اللّٰهِ، اَلسَّلَامُ عَلَيْكَ يَا حَبِيْبَ اللهِ\nأَشْهَدُ أَنْ لَا إِلٰهَ إِلَّا اللهُ وَحْدَهُ لَا شَرِيكَ لَهُ، وَأَنَّكَ عَبْدُهُ وَرَسُوْلُهُ\nوَأَشْهَدُ أَنَّكَ بَلَّغْتَ الرِّسَالَةَ، وَأَدَّيْتَ الْأَمَانَةَ، وَنَصَحْتَ الْأُمَّةَ\n\nوَجَاهَدْتَ فِي سَبِيلِ اللَّهِ، فَصَلَّى عَلَيْكَ اللهُ، صَلَاةً دَائِمَةً إِلَى يَوْمِ الدِّيْنَ\nاَللّٰهُمَّ آتِهِ الْفَضِيلَةَ وَالدَّرَجَةَ الرَّفِيعَةَ وَابْعَثْهُ مَقَامًا مَحْمُوْدًا الَّذِي وَعَدْتَهُ\nإِنَّكَ لَا تُخْلِفُ الْمِيعَادَ",
      "translationEn": "Peace be upon you, O noble Master, exalted Prophet, the generous, the compassionate. May Allah have mercy on you and bless you. Peace be upon you, O Prophet of Allah. Peace be upon you, O chosen servant of Allah. Peace be upon you, O beloved of Allah. I bear witness that there is no deity worthy of worship except Allah, the One, with no partner, and verily you are His servant and His Messenger. I bear witness that you have fulfilled the responsibilities of prophethood, have carried out your trust, have advised the people, and have striven in the path of Allah. May Allah send blessings upon you, endlessly until the Day of Judgment. O Allah, grant the Master honor, ranks, and high status, and grant him the praiseworthy position that You have promised. Indeed, You never fail in Your promise.",
      "translationMy": "Selamat sejahtera atas engkau wahai junjungan yang”mulia, Rasul yang agung, yang pemurah, penyayang. Moga-moga dirahmati dan diberkati Allah atasnya. Selamat Sejahtera wahai Nabi Allah. Selamat sejahtera wahai makhluk pilihan Allah. Selamat sejahtera wahai kekasih Allah. Aku bersaksi bahawa tiada Tuhan yang disembah melainkan Allah Yang Tunggal. Tiada sekutu bagiNya, dan sesungguhnya engkau adalah hambaNya dan RasulNya. Aku bersaksi bahawa engkau telah menyampaikan tanggungjawab kerasulan, dan telah menunaikan amanat, dan telah menasihatkan umat, dan telah berjihad ke jalan Allah. Maka Allah memberi selawat (rahmat) ke atasmu, berkekalan sehingga hari kiamat. Ya Allah, kurniakanlah kepada Junjungan akan kemuliaan, pangkat-pangkat dan darjat, serta anugerahkanlah kepadanya tempat yang terpuji yang Engkau telah janjikan. Sesungguhnya Engkau tidak sekali-kali memungkiri janji."
    }],
    "categoryKey": ["madinah"],
    "audio": ""
  },
  {
    "id": 74,
    "titleEn": "Greetings To Saidina Abu Bakar",
    "titleMy": "Memberi Salam Kepada Saidina Abu Bakar",
    "doa": [{
      "id": 1,
      "arabic": "اَلسَّلَامُ عَلَيْكَ يَا خَلِيْفَةَ رَسُوْلِ اللَّهِ\nاَلسَّلَامُ عَلَيْكَ يَا صَاحِبَ رَسُوْلِ اللَّهِ فِي الْغَارِ\nاَلسَّلَامُ عَلَيْكَ يَا أَمِيْنَهُ عَلَى الْأَسْرَارِ\nجَزَاكَ اللهُ عَنَّا أَفْضَلَ مَا جَزَى بِهِ إِمَامًا عَنْ أُمَّةِ نَبِيِّهِ\nفَلَقَدْ خَلَقْتَهُ أَحْسَنَ الْخَلْقِ، وَسَلَكْتَ طَرِيقَهُ وَمِنْهَا جَهُ خَيْرَ سُلُوْكٍ\nوَنَصَرْتَ الْإِسْلَامَ، وَوَصَلْتَ الْأَرْحَامَ، وَلَمْ تَزَلْ قَائِمًا بِالْحَقِّ أَتَاكَ الْيَقِينُ\nوَالسَّلَامُ عَلَيْكَ وَرَحْمَةُ اللهِ وَبَرَكَاتُهُ",
      "translationEn": "Peace be upon you, O Caliph of the Messenger of Allah (peace be upon him). Peace be upon you, O companion of the Messenger of Allah (peace be upon him) in the cave of Thur. Peace be upon you who faithfully keeps the secret. Receive the reward from God, as a reward for the leader who guides his Prophet's people. Verily, you have succeeded the Messenger of Allah (peace be upon him) by performing your duties in the best manner, and you have sincerely followed his path, served Islam, and maintained the bonds of kinship until the end of your life. So receive the reward, and may peace, mercy, and blessings from Allah be upon you.",
      "translationMy": "Salam sejahtera kepada tuan, wahai khalifah Rasulullah s.a.w. Salam sejahtera wahai teman Rasulullah s.a.w. di gua Thur. Salam sejahtera ke atas tuan yang setia menyimpan rahsia. Terimalah balasan daripada Tuhan, sebagai balasan ketua yang memimpin umat Nabinya. Bahawasanya tuan telah menggantikan Rasulullah s.a.w. dengan menjalankan tanggungjawab dengan sebaik-baiknya dan tuan telah mengikuti jalannya dengan bersungguh-sungguh, serta berkhidmat kepada agama Islam dan telah menyambungkan silaturrahim sehingga akhir hayat tuan. Maka terimalah balasan, dan selamat sejahtera dan rahmat dari Allah dan berkahNya"
    }],
    "categoryKey": ["madinah"],
    "audio": ""
  },
  {
    "id": 75,
    "titleEn": "Greetings To Saidina Umar",
    "titleMy": "Memberi Salam Kepada Saidina Umar",
    "doa": [{
      "id": 1,
      "arabic": "اَلسَّلَامُ عَلَيْكَ يَا مُظْهِرَ الْإِسْلَامِ، اَلسَّلَامُ عَلَيْكَ يَا فَارُوْقُ\nاَلسَّلَامُ عَلَيْكَ يَا مَنْ نَطَقَ بِالصَّوَابِ\nكَفَلْتَ الْأَيْتَامَ، وَوَصَلْتَ الْأَرْحَامَ، وَقَوِيَ بِكَ الْإِسْلَامُ\nاَلسَّلَامُ عَلَيْكَ وَرَحْمَةُ اللهِ وَبَرَكَاتُهُ",
      "translationEn": "Peace be upon you, sir, O expander of Islam. Peace be upon you, sir, O one who has been given the title Faruk (the one who distinguishes between right and wrong). Peace be upon you, who always speaks the truth, safeguards the rights of orphans, and fosters love and compassion. It is through you that Islam becomes strong. So receive peace, mercy from Allah, and His blessings.",
      "translationMy": "Salam sejahtera kepada tuan, wahai pengembang agama Islam. Salam sejahtera kepada tuan, wahai yang telah diberi gelaran Faruk (yang memutuskan antara yang benar dan yang salah). Salam sejahtera kepada tuan, yang sentiasa bercakap benar, serta memelihara hak anak yatim, dan menghubungkan kasih sayang. Maka dengan tuanlah agama Islam menjadi kuat. Maka terimalah salam sejahtera serta rahmat dari Allah dan barakahNya"
    }],
    "categoryKey": ["madinah"],
    "audio": ""
  },
  {
    "id": 76,
    "titleEn": "Dua at Beloved Prophets PBUH Tomb",
    "titleMy": "Doa Di Maqam Nabi SAW",
    "doa": [{
      "id": 1,
      "arabic": "اَلْحَمْدُ لِلَّهِ رَبِّ الْعَالَمِينَ، اَللّٰهُمَّ صَلِّ وَسَلِّمْ عَلَى سَيِّدِنَا مُحَمَّدٍ\nوَعَلَى آلِهِ وَصَحْبِهِ، اَلسَّلَامُ عَلَيْكَ يَا سَيِّدِي يَا رَسُولَ اللَّهِ\nإِنَّ اللَّهَ أَنْزَلَ إِلَيْكَ كِتَابًا صَادِقًا قَالَ فِيْهِ\nوَلَوْ أَنَّهُمْ إِذْ ظَلَمُوا أَنْفُسَهُمْ جَآءُوكَ فَاسْتَغْفَرُوا اللَّهَ\nوَاسْتَغْفَرَلَهُمُ الرَّسُوْلُ لَوَجَدُوا اللَّهَ تَوَّابًا رَحِيمًا\nوَقَدْ جِئْتُكَ مُسْتَغْفِرًا مِنْ ذَنْبِي مُسْتَشْفِعًا بِكَ إِلَى رَبِّي\nفَاشْفَعْ لِيْ يَا شَفِيْعَ الْأُمَّةِ وَأَجِرْنِي مِنَ النَّارِ يَا نَبِيَّ الرَّحْمَةِ\nاَلصَّلَاةُ وَالسَّلَامُ عَلَيْكَ وَعَلَى سَائِرِ الْأَنْبِيَاءِ وَالْمُرْسَلِيْنَ\nوَالْحَمْدُ لِلَّهِ رَبِّ الْعَالَمِينَ",
      "translationEn": "All praise be to Allah, Lord of all the worlds. Peace and blessings be upon the beloved Prophet Muhammad (peace be upon him). Peace be upon you, O Chief, O Messenger of Allah (peace be upon him). Indeed, Allah has revealed to you a true book, in which He has said: '...and if they, after doing wrong to themselves, come to you, then seek forgiveness from Allah and [ask forgiveness for] them, they will certainly find Allah to be Accepting of Repentance, Merciful...'. Indeed, I come seeking forgiveness for my sins, seeking intercession from Allah, by your blessing, grant that intercession for me, O Prophet who intercedes for your nation, and protect me from hellfire, O Prophet endowed with mercy. Peace and blessings be upon you and upon all the Prophets and Messengers. And all praise be to Allah, Lord of all the worlds.",
      "translationMy": "Segala puji bagi Allah Tuhan semesta alam. Selawat dan salam ke atas junjungan Nabi Muhammad s.a.w. Salam sejahtera ke atasmu, wahai Penghulu, wahai Rasulullah s.a.w. Sesungguhnya Allah telah menurunkan kepadamu sebuah kitab yang benar, yang Dia telah berfirman di dalamnya: ''..dan jika mereka sesudah menzalimi diri mereka datang kepadamu, lalu mereka memohon ampun kepada Allah dan Rasul, juga mintakan ampun bagi mereka, nescaya mereka dapati Allah itu penerima taubat, penyayang...\". Sesungguhnya aku datang memohon ampun dari dosaku, memohon syafaat kepada Allah, dengan berkatmu, berilah syafaat itu untukku wahai Nabi yang memberi syafaat kepada umatnya, dan jauhkanlah aku dari neraka, wahai Nabi yang mempunyai belas kasihan. Selawat dan salam atasmu dan ke atas semua para Nabi dan Rasul. Dan segala puji bagi Allah Tuhan seru sekelian alam"
    }],
    "categoryKey": ["madinah"],
    "audio": ""
  },
  {
    "id": 77,
    "titleEn": "Conveying Greetings to Beloved Prophet PBUH",
    "titleMy": "Menyampaikan Salam Kepada Baginda SAW",
    "doa": [{
      "id": 1,
      "arabic": "اَلسَّلَامُ عَلَيْكَ أَيُّهَا النَّبِيُّ وَرَحْمَةُ اللهِ وَبَرَكَاتُهُ، يَا سَيِّدِي يَا رَسُوْلَ اللهِ\nجِئتُكَ نائِبًا وَزَائِرًا عَنْ ......... مُسَلِّمًا عَنْهُ سَائِلًا مِنْكَ الشَّفَاعَةَ لَهُ\nفِي غُفْرَانِ ذُنُوْبِهِ، فَاشْفَعْ لَهُ عِنْدَ اللَّهِ يَا رَسُوْلَ اللهِ",
      "translationEn": "Peace be upon you, O Prophet, as well as the mercy and blessings of Allah. O my master, O Messenger of Allah, I come to greet you on behalf of __________ bin __________ He seeks your intercession to obtain forgiveness for his sins. Grant him intercession with Allah, O Messenger of Allah.",
      "translationMy": "Salam sejahtera atasMu wahai Nabi, serta rahmat Allah dan berkatNya, Ya junjunganku, wahai Rasulullah, saya datang memberi salam kepada tuan daripada __________ bin __________ dia memohon syafaat daripadamu untuk mendapatkan pengampunan bagi dosanya, Berilah syafaat di sisi Allah kepadanya wahai Rasulullah"
    }],
    "categoryKey": ["madinah"],
    "audio": ""
  },
  {
    "id": 78,
    "titleEn": "Greetings And Dua At Baqi' Cemetery",
    "titleMy": "Salam Dan Doa Di Perkuburan Baqi'",
    "doa": [{
      "id": 1,
      "arabic": "اَلسَّلَامُ عَلَيْكُمْ دَارَ قَوْمٍ مُؤْمِنِيْنَ، وَإِنَّا إِنْ شَاءَ اللهُ بِكُمْ لَاحِقُوْنَ\nأَنْتُمْ سَلَفُنَا وَنَحْنُ بِالْأَثَرِ، يَغْفِرُ اللهُ لَنَا وَلَكُمْ\nوَيَرْحَمُ اللَّهُ الْمُسْتَقْدِمِيْنَ مِنْكُمْ وَالْمُسْتَأْخِرِيْنَ\nاَللّٰهُمَّ لَا تَحْرِمْنَا أَجْرَهُمْ وَلَا تَفْتِنَا بَعْدَهُمْ وَاغْفِرْلَنَا وَلَهُمْ\nاَللّٰهُمَّ اغْفِرْ لِأَهْلِ الْبَقِيْعِ الْغَرْقَدِ",
      "translationEn": "Peace be upon you, O dwelling place of the believers. Surely we will follow you. You are the ones who came before us, and we are your followers. May Allah forgive us as well as you, and have mercy on those who came before and those who came last. O Allah, do not discourage us from the reward of their deeds and do not _tnahkan us after them. Forgive us our sins and their sins and forgive the sins of the Baqi Al-Gharkadi",
      "translationMy": "Salam sejahtera di atas kamu wahai tempat tinggal orang-orang yang beriman. Sesungguhnya kami akan mengikut  kamu. Kamu adalah orang-orang yang terdahulu daripada kami, dan kami adalah pengikut kamu. Mudah-mudahan Allah mengampunkan kami juga kamu, dan mengasihani mereka yang dahulu-dahulu dan mereka yang terkemudian. Ya Allah, janganlah Engkau kecewakan kami daripada mendapat pahala amalan mereka dan janganlah Engkau _tnahkan kami selepas mereka. Ampunilah dosa kami dan dosa mereka serta ampunilah dosa ahli Baqi al-Gharkadi"
    }],
    "categoryKey": ["madinah"],
    "audio": ""
  },
  {
    "id": 79,
    "titleEn": "Doa at historic mosque around Madinah",
    "titleMy": "Dua di masjid-masjid bersejarah di sekitar Madinah",
    "doa": [{
      "id": 1,
      "arabic": "اَللّٰهُمَّ رَبَّنَا تَقَبَّلْ مِنَّا وَعَافِنَا وَاعْفُ عَنَّا، اَللّٰهُمَّ تَوَفَّنَا مُسْلِمِينَ\nوَأَحْيِنَا مُسْلِمِيْنَ، وَاَلْحِقْنَا بِالصَّالِحِيْنَ، اَللّٰهُمَّ إِنِّي أَوْدَعْتُ هَذَا الْمَحَلَّ الشَّرِيفَ\nمِنْ يَوْمِنَا هَذَا إِلَى يَوْمِ الْقِيَامَةِ خَالِصًا مُخْلِصًا\n(أَشْهَدُ أَنْ لَا إِلَهَ إِلَّا اللَّهُ\nوَأَنَّ مُحَمَّدًا عَبْدُهُ وَرَسُوْلُهُ) اَلْفَاتِحَة",
      "translationEn": "O Allah, our Lord, accept our prayers, grant us good health, forgive our mistakes, let us die in Islam, let us live in Islam, and gather us with the righteous. O Allah, my Lord, I dedicate this sacred place from today until the Day of Judgment, sincerely and truthfully. I bear witness that there is no god but Allah, and indeed Muhammad is His servant and Messenger (AI-Fatihah)",
      "translationMy": "Ya Allah. Ya Tuhan kami. Perkenankanlah doa kami, afiatkanlah kami, maafkanlah kesalahan kami, matikanlah kami di dalam Islam, hidupkanlah kami di dalam Islam, himpunkanlah kami dengan orang-orang yang soleh. Ya Allah. Ya Tuhan aku abadikan tempat yang suci ini daripada hari ini sehingga hari kiamat, dengan ikhlas dan jujur. Aku menyaksi tiada tuhan melainkan Allah dan sesungguhnya Nabi Muhammad hambaNya dan PesuruhNya' (AI-Fatihah)"
    }],
    "categoryKey": ["madinah"],
    "audio": ""
  },
  {
    "id": 80,
    "titleEn": "Greetings and Prayers at the Martyrs' Cemetery of Uhud",
    "titleMy": "Salam Dan Doa Di Perkuburan Syuhada’ Uhud",
    "doa": [{
      "id": 1,
      "arabic": "اَلسَّلَامُ عَلَيْكَ يَا حَمْزَةُ عَمَّ رَسُوْلِ اللَّهِ، اَلسَّلَامُ عَلَيْكَ يَا سَيِّدَ الشُّهَدَاءِ\nاَلسَّلَامُ عَلَيْكَ يَا أَسَدَ اللهِ وَأَسَدَ رَسُوْلِهِ\nاَلسَّلَامُ عَلَيْكَ يَا عَبْدَ اللَّهِ بِنْ جَحْشٍ، اَلسَّلَامُ عَلَيْكَ يَا مُصْعَبَ بْنَ عُمَيْرِ\nاَلسَّلَامُ عَلَيْكُمْ يَا شُهَدَاءَ أَحُدٍ، اَلسَّلَامُ عَلَيْكُمْ بِمَا صَبَرْتُمْ فَنِعْمَ عُقْبَى الدَّارِ\nاَللّٰهُمَّ اجْزِهِمْ عَنِ الْإِسْلَامِ وَأَهْلِهِ أَفْضَلَ الْجَزَاءِ\nوَأَجْزِلْ ثَوَابَهُمْ وَأَكْرِمْ مَقَامَهُمْ وَارْفَعْ دَرَجَاتِهِمْ بِمَنِّكَ وَكَرَمِكَ\nيَا أَكْرَمَ الْأَكْرَمِيْنَ",
      "translationEn": "Peace be upon you, O Saiyidina Hamzah, uncle of the Prophet s.a.w, Peace be upon you, O chief of the martyrs, Peace be upon you, the lion of Allah and the lion of the Messenger of Allah. Peace be upon you, O Saiyidina Abdullah bin Jahsyi, Peace be upon you, O Saiyidina Musab bin Omair, Peace be upon you, O those who died in the battle of Uhud, Peace be upon you, for your patience in facing the enemy to uphold the truth of Islam, which is the best reward you will receive from Allah. O Allah, O my Lord, multiply the reward of their deeds, which they have done for the sanctity of Islam and its adherents. Elevate their rank and rank with Your mercy, O Most Merciful God",
      "translationMy": "Salam sejahtera atas engkau wahai Saiyidina Hamzah, bapa saudara Rasulullah s.a.w, Salam sejahtera atas engkau wahai penghulu bagi para syahid, Salam sejahtera atas engkau singa Allah dan singa Rasulullah. Salam sejahtera atas engkau wahai Saiyidina Abdullah bin Jahsyi, Salam sejahtera atas engkau wahai Saiyidina Musab bin Omair, Salam sejahtera atas kamu wahai orang-orang yang mati di dalam peperangan Uhud, Salam sejahtera atas kamu, atas kesabaran kamu menghadapi musuh untuk menegakkan kebenaran Islam, iaitu sebaik-baik balasan yang akan kamu terima dari Allah. Ya Allah Ya Tuhanku, gandakanlah pahala amalan mereka, yang telah mereka lakukan untuk kesucian agama Islam dan pemelukpemeluknya. Tinggikan pangkat dan darjat mereka dengan kemurahan Engkau wahai Tuhan Yang Amat Pemurah"
    }],
    "categoryKey": ["madinah"],
    "audio": ""
  },
  {
    "id": 81,
    "titleEn": "Farewell Ziarah",
    "titleMy": "Ziarah Wada'",
    "doa": [{
      "id": 1,
      "arabic": "",
      "translationEn": "It is recommended to bid farewell (visit) to the Prophet Muhammad PBUH as a form of respect. For women who are unable, it is sufficient to visit outside the mosque at a place near the maqam.",
      "translationMy": "Disunatkan berziarah wadak (selamat tinggal) kepada baginda Rasulullah SAW. sebagai menghormatinya, bagi wanita yang uzur, memadailah dengan ziarah di luar masjid di tempat yang berhampiran dengan maqam."
    }],
    "categoryKey": ["madinah"],
    "audio": ""
  },
  {
    "id": 82,
    "titleEn": "Dua After Farewell Ziarah",
    "titleMy": "Doa Setelah Ziarah Wada'",
    "doa": [{
      "id": 1,
      "arabic": "اَللّٰهُمَّ لَا تَجْعَلْهُ آخِرَ الْعَهْدِ مِنْ هَذَا الْمَكَانِ الشَّرِيفِ\nوَارْزُقْنِيْ إِلَيْهِ الْعَوْدَةَ فِي خَيْرٍ وَعَافِيَةٍ وَصِحَّةٍ وَسَلَامَةٍ\nإِنْ عِشْتُ إِنْ شَاءَ اللهُ جِئْتُ، وَإِنْ مُتُّ أَوْدَعْتُ عِنْدَكَ شَهَادَتِيْ\nوَأَمَانَتِيْ وَعَهْدِيْ وَمِيْثَاقِيْ مِنْ يَوْمِنَا هَذَا إِلَى يَوْمِ الْقِيَامَةِ\nوَهِيَ شَهَادَةُ أَنْ لَا إِلٰهَ إِلَّا اللَّهُ وَحْدَهُ لَا شَرِيكَ لَهُ\nوَشَهَادَةُ أَنَّ مُحَمَّدًا عَبْدُهُ وَرَسُوْلُهُ\nسُبْحَانَ رَبِّكَ رَبِّ الْعِزَّةِ عَمَّا يَصِفُوْنَ\nوَسَلَامٌ عَلَى الْمُرْسَلِينَ، وَالْحَمْدُ لِلَّهِ رَبِّ الْعَالَمِينَ",
      "translationEn": "O Allah, do not let the visit of Your servant to this noble place be the last visit; grant Your servant the opportunity to return to this place in good health, safety, and well-being. If my life is prolonged, God willing, I will come again; if my time comes, then I have committed to You my testimony and covenant from this day until the Day of Judgment. I bear witness that there is no God but Allah, the One God who has no partner, and I bear witness that Muhammad is His servant and messenger. Glory be to the Lord who possesses Majesty and Power, above what they describe. Peace be upon all the Prophets, and all praises are due to Allah, the Lord who preserves and governs the entire universe.",
      "translationMy": "Ya Allah, janganlah jadikan ziarah hambaMu di tempat yang mulia ini sebagai ziarah yang penghabisan, kurniakanlah kepada hambaMu peluang untuk menziarahi kembali ke tempat ini dalam keadaan baik, sihat dan selamat. Jika panjang umur hamba, insya Allah, hamba akan datang lagi, jika sampai ajal hamba, maka hamba telah mengabadikan kepadaMu syahadat dan perjanjian hamba dari hari ini sehingga hari kiamat. laitu hamba bersaksi tiada Tuhan melainkan Allah, Tuhan Yang Esa yang tidak ada sekutu bagiNya dan hamba naik saksi bahawa Nabi Muhammad hambaNya dan pesuruhNya. Maha suci Tuhan yang mempunyai Keagungan dan Kekuasaan, dari apa yang mereka sifatkan. Dan salam sejahtera ke atas sekelian Rasul, serta segala puji-pujian tertentu bagi Allah, Tuhan yang memelihara dan mentadbir seluruh alam."
    }],
    "categoryKey": ["madinah"],
    "audio": ""
  }
]