{
  "about": [
    "Halijah Manasik is a digital Umrah and Hajj guide developed based on the guidebook Menyahut Seruan Ilahi. It is designed to accompany pilgrims through the main rituals of Umrah, whether they are following a mutawwif or performing Umrah on their own.",
    "With Allah’s permission, we hope this app will serve as a source of ease and guidance in fulfilling the rites of Hajj and Umrah. May Allah envelop every pilgrim with His Mercy and Pleasure, and bless all who strive and serve along this noble and sacred journey.",
    "May this app also be a lasting source of reward and ongoing charity for everyone who has contributed their efforts to it in any way, and especially for the late founder, Allahyarhamah Halijah Binte Abdul Hamid Almunawwarah, the founder of Halijah Travels, whose love for innovation and dedication to finding new ways to support pilgrims continue to inspire this work."
  ],
  "contributors": [
    {
      "name": "Ustaz Haji Sawifi Bin Samson",
      "description": "Author of \"Menyahut Seruan Ilahi\" and \"Sempurnakan Umrah\", which the app’s core content is adapted from."
    },
    {
      "name": "Ustaz Haji Muhammad Syarafuddeen Bin Mazlan",
      "description": "Structured and organised the app’s content and recorded and produced majority of the in-app audio."
    },
    {
      "name": "Ustaz Haji Mohammed Iqbal Bin Abdullah",
      "description": "Provided verification and review to ensure the accuracy and reliability of the app content."
    },
    {
      "name": "Muhammad Hilwan Bin Mohamed Idrus",
      "description": "Software Engineer responsible for the development, and technical implementation and maintenance of the application."
    },
    {
      "name": "",
      "description": "We also extend our gratitude to Turntable Music for providing the studio used for the application’s audio recordings."
    }
  ],
  "footer": {
    "socialsIntro": "To checkout more tours by Halijah Travels, please visit our website and our socials here:",
    "socialLinks": [
      {
        "href": "https://halijah.com.sg/group-tours",
        "icon": "globe"
      },
      {
        "href": "https://www.instagram.com/halijahtravels",
        "icon": "logo-instagram"
      },
      {
        "href": "https://www.facebook.com/HalijahTravels",
        "icon": "logo-facebook"
      },
      {
        "href": "https://www.youtube.com/@HalijahTravels",
        "icon": "logo-youtube"
      }
    ]
  },
  "getInTouch": {
    "intro": "Have a question or feedback? We'd love to hear from you.",
    "emailAddress": "mailto:app@halijah.com.sg",
    "emailText": "Email us at app@halijah.com.sg"
  }
}